/* automatically generated by rust-bindgen */

pub const _STDINT_H : :: std :: os :: raw :: c_uint = 1 ; pub const _FEATURES_H : :: std :: os :: raw :: c_uint = 1 ; pub const _DEFAULT_SOURCE : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_ISOC11 : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_ISOC99 : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_ISOC95 : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_POSIX_IMPLICITLY : :: std :: os :: raw :: c_uint = 1 ; pub const _POSIX_SOURCE : :: std :: os :: raw :: c_uint = 1 ; pub const _POSIX_C_SOURCE : :: std :: os :: raw :: c_uint = 200809 ; pub const __USE_POSIX : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_POSIX2 : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_POSIX199309 : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_POSIX199506 : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_XOPEN2K : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_XOPEN2K8 : :: std :: os :: raw :: c_uint = 1 ; pub const _ATFILE_SOURCE : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_MISC : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_ATFILE : :: std :: os :: raw :: c_uint = 1 ; pub const __USE_FORTIFY_LEVEL : :: std :: os :: raw :: c_uint = 0 ; pub const __GLIBC_USE_DEPRECATED_GETS : :: std :: os :: raw :: c_uint = 0 ; pub const _STDC_PREDEF_H : :: std :: os :: raw :: c_uint = 1 ; pub const __STDC_IEC_559__ : :: std :: os :: raw :: c_uint = 1 ; pub const __STDC_IEC_559_COMPLEX__ : :: std :: os :: raw :: c_uint = 1 ; pub const __STDC_ISO_10646__ : :: std :: os :: raw :: c_uint = 201706 ; pub const __STDC_NO_THREADS__ : :: std :: os :: raw :: c_uint = 1 ; pub const __GNU_LIBRARY__ : :: std :: os :: raw :: c_uint = 6 ; pub const __GLIBC__ : :: std :: os :: raw :: c_uint = 2 ; pub const __GLIBC_MINOR__ : :: std :: os :: raw :: c_uint = 26 ; pub const _SYS_CDEFS_H : :: std :: os :: raw :: c_uint = 1 ; pub const __glibc_c99_flexarr_available : :: std :: os :: raw :: c_uint = 1 ; pub const __WORDSIZE : :: std :: os :: raw :: c_uint = 64 ; pub const __WORDSIZE_TIME64_COMPAT32 : :: std :: os :: raw :: c_uint = 1 ; pub const __SYSCALL_WORDSIZE : :: std :: os :: raw :: c_uint = 64 ; pub const __HAVE_GENERIC_SELECTION : :: std :: os :: raw :: c_uint = 1 ; pub const __GLIBC_USE_LIB_EXT2 : :: std :: os :: raw :: c_uint = 0 ; pub const __GLIBC_USE_IEC_60559_BFP_EXT : :: std :: os :: raw :: c_uint = 0 ; pub const __GLIBC_USE_IEC_60559_FUNCS_EXT : :: std :: os :: raw :: c_uint = 0 ; pub const __GLIBC_USE_IEC_60559_TYPES_EXT : :: std :: os :: raw :: c_uint = 0 ; pub const _BITS_TYPES_H : :: std :: os :: raw :: c_uint = 1 ; pub const _BITS_TYPESIZES_H : :: std :: os :: raw :: c_uint = 1 ; pub const __OFF_T_MATCHES_OFF64_T : :: std :: os :: raw :: c_uint = 1 ; pub const __INO_T_MATCHES_INO64_T : :: std :: os :: raw :: c_uint = 1 ; pub const __RLIM_T_MATCHES_RLIM64_T : :: std :: os :: raw :: c_uint = 1 ; pub const __FD_SETSIZE : :: std :: os :: raw :: c_uint = 1024 ; pub const _BITS_WCHAR_H : :: std :: os :: raw :: c_uint = 1 ; pub const _BITS_STDINT_INTN_H : :: std :: os :: raw :: c_uint = 1 ; pub const _BITS_STDINT_UINTN_H : :: std :: os :: raw :: c_uint = 1 ; pub const INT8_MIN : :: std :: os :: raw :: c_int = -128 ; pub const INT16_MIN : :: std :: os :: raw :: c_int = -32768 ; pub const INT32_MIN : :: std :: os :: raw :: c_int = -2147483648 ; pub const INT8_MAX : :: std :: os :: raw :: c_uint = 127 ; pub const INT16_MAX : :: std :: os :: raw :: c_uint = 32767 ; pub const INT32_MAX : :: std :: os :: raw :: c_uint = 2147483647 ; pub const UINT8_MAX : :: std :: os :: raw :: c_uint = 255 ; pub const UINT16_MAX : :: std :: os :: raw :: c_uint = 65535 ; pub const UINT32_MAX : :: std :: os :: raw :: c_uint = 4294967295 ; pub const INT_LEAST8_MIN : :: std :: os :: raw :: c_int = -128 ; pub const INT_LEAST16_MIN : :: std :: os :: raw :: c_int = -32768 ; pub const INT_LEAST32_MIN : :: std :: os :: raw :: c_int = -2147483648 ; pub const INT_LEAST8_MAX : :: std :: os :: raw :: c_uint = 127 ; pub const INT_LEAST16_MAX : :: std :: os :: raw :: c_uint = 32767 ; pub const INT_LEAST32_MAX : :: std :: os :: raw :: c_uint = 2147483647 ; pub const UINT_LEAST8_MAX : :: std :: os :: raw :: c_uint = 255 ; pub const UINT_LEAST16_MAX : :: std :: os :: raw :: c_uint = 65535 ; pub const UINT_LEAST32_MAX : :: std :: os :: raw :: c_uint = 4294967295 ; pub const INT_FAST8_MIN : :: std :: os :: raw :: c_int = -128 ; pub const INT_FAST16_MIN : :: std :: os :: raw :: c_longlong = -9223372036854775808 ; pub const INT_FAST32_MIN : :: std :: os :: raw :: c_longlong = -9223372036854775808 ; pub const INT_FAST8_MAX : :: std :: os :: raw :: c_uint = 127 ; pub const INT_FAST16_MAX : :: std :: os :: raw :: c_ulonglong = 9223372036854775807 ; pub const INT_FAST32_MAX : :: std :: os :: raw :: c_ulonglong = 9223372036854775807 ; pub const UINT_FAST8_MAX : :: std :: os :: raw :: c_uint = 255 ; pub const UINT_FAST16_MAX : :: std :: os :: raw :: c_int = -1 ; pub const UINT_FAST32_MAX : :: std :: os :: raw :: c_int = -1 ; pub const INTPTR_MIN : :: std :: os :: raw :: c_longlong = -9223372036854775808 ; pub const INTPTR_MAX : :: std :: os :: raw :: c_ulonglong = 9223372036854775807 ; pub const UINTPTR_MAX : :: std :: os :: raw :: c_int = -1 ; pub const PTRDIFF_MIN : :: std :: os :: raw :: c_longlong = -9223372036854775808 ; pub const PTRDIFF_MAX : :: std :: os :: raw :: c_ulonglong = 9223372036854775807 ; pub const SIG_ATOMIC_MIN : :: std :: os :: raw :: c_int = -2147483648 ; pub const SIG_ATOMIC_MAX : :: std :: os :: raw :: c_uint = 2147483647 ; pub const SIZE_MAX : :: std :: os :: raw :: c_int = -1 ; pub const WINT_MIN : :: std :: os :: raw :: c_uint = 0 ; pub const WINT_MAX : :: std :: os :: raw :: c_uint = 4294967295 ; pub const _STRING_H : :: std :: os :: raw :: c_uint = 1 ; pub const _BITS_TYPES_LOCALE_T_H : :: std :: os :: raw :: c_uint = 1 ; pub const _BITS_TYPES___LOCALE_T_H : :: std :: os :: raw :: c_uint = 1 ; pub const _STRINGS_H : :: std :: os :: raw :: c_uint = 1 ; pub const BR_HASHDESC_ID_OFF : :: std :: os :: raw :: c_uint = 0 ; pub const BR_HASHDESC_ID_MASK : :: std :: os :: raw :: c_uint = 255 ; pub const BR_HASHDESC_OUT_OFF : :: std :: os :: raw :: c_uint = 8 ; pub const BR_HASHDESC_OUT_MASK : :: std :: os :: raw :: c_uint = 127 ; pub const BR_HASHDESC_STATE_OFF : :: std :: os :: raw :: c_uint = 15 ; pub const BR_HASHDESC_STATE_MASK : :: std :: os :: raw :: c_uint = 255 ; pub const BR_HASHDESC_LBLEN_OFF : :: std :: os :: raw :: c_uint = 23 ; pub const BR_HASHDESC_LBLEN_MASK : :: std :: os :: raw :: c_uint = 15 ; pub const br_md5_ID : :: std :: os :: raw :: c_uint = 1 ; pub const br_md5_SIZE : :: std :: os :: raw :: c_uint = 16 ; pub const br_sha1_ID : :: std :: os :: raw :: c_uint = 2 ; pub const br_sha1_SIZE : :: std :: os :: raw :: c_uint = 20 ; pub const br_sha224_ID : :: std :: os :: raw :: c_uint = 3 ; pub const br_sha224_SIZE : :: std :: os :: raw :: c_uint = 28 ; pub const br_sha256_ID : :: std :: os :: raw :: c_uint = 4 ; pub const br_sha256_SIZE : :: std :: os :: raw :: c_uint = 32 ; pub const br_sha384_ID : :: std :: os :: raw :: c_uint = 5 ; pub const br_sha384_SIZE : :: std :: os :: raw :: c_uint = 48 ; pub const br_sha512_ID : :: std :: os :: raw :: c_uint = 6 ; pub const br_sha512_SIZE : :: std :: os :: raw :: c_uint = 64 ; pub const br_md5sha1_ID : :: std :: os :: raw :: c_uint = 0 ; pub const br_md5sha1_SIZE : :: std :: os :: raw :: c_uint = 36 ; pub const br_aes_big_BLOCK_SIZE : :: std :: os :: raw :: c_uint = 16 ; pub const br_aes_small_BLOCK_SIZE : :: std :: os :: raw :: c_uint = 16 ; pub const br_aes_ct_BLOCK_SIZE : :: std :: os :: raw :: c_uint = 16 ; pub const br_aes_ct64_BLOCK_SIZE : :: std :: os :: raw :: c_uint = 16 ; pub const br_aes_x86ni_BLOCK_SIZE : :: std :: os :: raw :: c_uint = 16 ; pub const br_aes_pwr8_BLOCK_SIZE : :: std :: os :: raw :: c_uint = 16 ; pub const br_des_tab_BLOCK_SIZE : :: std :: os :: raw :: c_uint = 8 ; pub const br_des_ct_BLOCK_SIZE : :: std :: os :: raw :: c_uint = 8 ; pub const BR_EC_sect163k1 : :: std :: os :: raw :: c_uint = 1 ; pub const BR_EC_sect163r1 : :: std :: os :: raw :: c_uint = 2 ; pub const BR_EC_sect163r2 : :: std :: os :: raw :: c_uint = 3 ; pub const BR_EC_sect193r1 : :: std :: os :: raw :: c_uint = 4 ; pub const BR_EC_sect193r2 : :: std :: os :: raw :: c_uint = 5 ; pub const BR_EC_sect233k1 : :: std :: os :: raw :: c_uint = 6 ; pub const BR_EC_sect233r1 : :: std :: os :: raw :: c_uint = 7 ; pub const BR_EC_sect239k1 : :: std :: os :: raw :: c_uint = 8 ; pub const BR_EC_sect283k1 : :: std :: os :: raw :: c_uint = 9 ; pub const BR_EC_sect283r1 : :: std :: os :: raw :: c_uint = 10 ; pub const BR_EC_sect409k1 : :: std :: os :: raw :: c_uint = 11 ; pub const BR_EC_sect409r1 : :: std :: os :: raw :: c_uint = 12 ; pub const BR_EC_sect571k1 : :: std :: os :: raw :: c_uint = 13 ; pub const BR_EC_sect571r1 : :: std :: os :: raw :: c_uint = 14 ; pub const BR_EC_secp160k1 : :: std :: os :: raw :: c_uint = 15 ; pub const BR_EC_secp160r1 : :: std :: os :: raw :: c_uint = 16 ; pub const BR_EC_secp160r2 : :: std :: os :: raw :: c_uint = 17 ; pub const BR_EC_secp192k1 : :: std :: os :: raw :: c_uint = 18 ; pub const BR_EC_secp192r1 : :: std :: os :: raw :: c_uint = 19 ; pub const BR_EC_secp224k1 : :: std :: os :: raw :: c_uint = 20 ; pub const BR_EC_secp224r1 : :: std :: os :: raw :: c_uint = 21 ; pub const BR_EC_secp256k1 : :: std :: os :: raw :: c_uint = 22 ; pub const BR_EC_secp256r1 : :: std :: os :: raw :: c_uint = 23 ; pub const BR_EC_secp384r1 : :: std :: os :: raw :: c_uint = 24 ; pub const BR_EC_secp521r1 : :: std :: os :: raw :: c_uint = 25 ; pub const BR_EC_brainpoolP256r1 : :: std :: os :: raw :: c_uint = 26 ; pub const BR_EC_brainpoolP384r1 : :: std :: os :: raw :: c_uint = 27 ; pub const BR_EC_brainpoolP512r1 : :: std :: os :: raw :: c_uint = 28 ; pub const BR_EC_curve25519 : :: std :: os :: raw :: c_uint = 29 ; pub const BR_EC_curve448 : :: std :: os :: raw :: c_uint = 30 ; pub const BR_ERR_X509_OK : :: std :: os :: raw :: c_uint = 32 ; pub const BR_ERR_X509_INVALID_VALUE : :: std :: os :: raw :: c_uint = 33 ; pub const BR_ERR_X509_TRUNCATED : :: std :: os :: raw :: c_uint = 34 ; pub const BR_ERR_X509_EMPTY_CHAIN : :: std :: os :: raw :: c_uint = 35 ; pub const BR_ERR_X509_INNER_TRUNC : :: std :: os :: raw :: c_uint = 36 ; pub const BR_ERR_X509_BAD_TAG_CLASS : :: std :: os :: raw :: c_uint = 37 ; pub const BR_ERR_X509_BAD_TAG_VALUE : :: std :: os :: raw :: c_uint = 38 ; pub const BR_ERR_X509_INDEFINITE_LENGTH : :: std :: os :: raw :: c_uint = 39 ; pub const BR_ERR_X509_EXTRA_ELEMENT : :: std :: os :: raw :: c_uint = 40 ; pub const BR_ERR_X509_UNEXPECTED : :: std :: os :: raw :: c_uint = 41 ; pub const BR_ERR_X509_NOT_CONSTRUCTED : :: std :: os :: raw :: c_uint = 42 ; pub const BR_ERR_X509_NOT_PRIMITIVE : :: std :: os :: raw :: c_uint = 43 ; pub const BR_ERR_X509_PARTIAL_BYTE : :: std :: os :: raw :: c_uint = 44 ; pub const BR_ERR_X509_BAD_BOOLEAN : :: std :: os :: raw :: c_uint = 45 ; pub const BR_ERR_X509_OVERFLOW : :: std :: os :: raw :: c_uint = 46 ; pub const BR_ERR_X509_BAD_DN : :: std :: os :: raw :: c_uint = 47 ; pub const BR_ERR_X509_BAD_TIME : :: std :: os :: raw :: c_uint = 48 ; pub const BR_ERR_X509_UNSUPPORTED : :: std :: os :: raw :: c_uint = 49 ; pub const BR_ERR_X509_LIMIT_EXCEEDED : :: std :: os :: raw :: c_uint = 50 ; pub const BR_ERR_X509_WRONG_KEY_TYPE : :: std :: os :: raw :: c_uint = 51 ; pub const BR_ERR_X509_BAD_SIGNATURE : :: std :: os :: raw :: c_uint = 52 ; pub const BR_ERR_X509_TIME_UNKNOWN : :: std :: os :: raw :: c_uint = 53 ; pub const BR_ERR_X509_EXPIRED : :: std :: os :: raw :: c_uint = 54 ; pub const BR_ERR_X509_DN_MISMATCH : :: std :: os :: raw :: c_uint = 55 ; pub const BR_ERR_X509_BAD_SERVER_NAME : :: std :: os :: raw :: c_uint = 56 ; pub const BR_ERR_X509_CRITICAL_EXTENSION : :: std :: os :: raw :: c_uint = 57 ; pub const BR_ERR_X509_NOT_CA : :: std :: os :: raw :: c_uint = 58 ; pub const BR_ERR_X509_FORBIDDEN_KEY_USAGE : :: std :: os :: raw :: c_uint = 59 ; pub const BR_ERR_X509_WEAK_PUBLIC_KEY : :: std :: os :: raw :: c_uint = 60 ; pub const BR_ERR_X509_NOT_TRUSTED : :: std :: os :: raw :: c_uint = 62 ; pub const BR_X509_TA_CA : :: std :: os :: raw :: c_uint = 1 ; pub const BR_KEYTYPE_RSA : :: std :: os :: raw :: c_uint = 1 ; pub const BR_KEYTYPE_EC : :: std :: os :: raw :: c_uint = 2 ; pub const BR_KEYTYPE_KEYX : :: std :: os :: raw :: c_uint = 16 ; pub const BR_KEYTYPE_SIGN : :: std :: os :: raw :: c_uint = 32 ; pub const BR_X509_BUFSIZE_KEY : :: std :: os :: raw :: c_uint = 520 ; pub const BR_X509_BUFSIZE_SIG : :: std :: os :: raw :: c_uint = 512 ; pub const BR_SSL_BUFSIZE_INPUT : :: std :: os :: raw :: c_uint = 16709 ; pub const BR_SSL_BUFSIZE_OUTPUT : :: std :: os :: raw :: c_uint = 16469 ; pub const BR_SSL_BUFSIZE_MONO : :: std :: os :: raw :: c_uint = 16709 ; pub const BR_SSL_BUFSIZE_BIDI : :: std :: os :: raw :: c_uint = 33178 ; pub const BR_SSL30 : :: std :: os :: raw :: c_uint = 768 ; pub const BR_TLS10 : :: std :: os :: raw :: c_uint = 769 ; pub const BR_TLS11 : :: std :: os :: raw :: c_uint = 770 ; pub const BR_TLS12 : :: std :: os :: raw :: c_uint = 771 ; pub const BR_ERR_OK : :: std :: os :: raw :: c_uint = 0 ; pub const BR_ERR_BAD_PARAM : :: std :: os :: raw :: c_uint = 1 ; pub const BR_ERR_BAD_STATE : :: std :: os :: raw :: c_uint = 2 ; pub const BR_ERR_UNSUPPORTED_VERSION : :: std :: os :: raw :: c_uint = 3 ; pub const BR_ERR_BAD_VERSION : :: std :: os :: raw :: c_uint = 4 ; pub const BR_ERR_BAD_LENGTH : :: std :: os :: raw :: c_uint = 5 ; pub const BR_ERR_TOO_LARGE : :: std :: os :: raw :: c_uint = 6 ; pub const BR_ERR_BAD_MAC : :: std :: os :: raw :: c_uint = 7 ; pub const BR_ERR_NO_RANDOM : :: std :: os :: raw :: c_uint = 8 ; pub const BR_ERR_UNKNOWN_TYPE : :: std :: os :: raw :: c_uint = 9 ; pub const BR_ERR_UNEXPECTED : :: std :: os :: raw :: c_uint = 10 ; pub const BR_ERR_BAD_CCS : :: std :: os :: raw :: c_uint = 12 ; pub const BR_ERR_BAD_ALERT : :: std :: os :: raw :: c_uint = 13 ; pub const BR_ERR_BAD_HANDSHAKE : :: std :: os :: raw :: c_uint = 14 ; pub const BR_ERR_OVERSIZED_ID : :: std :: os :: raw :: c_uint = 15 ; pub const BR_ERR_BAD_CIPHER_SUITE : :: std :: os :: raw :: c_uint = 16 ; pub const BR_ERR_BAD_COMPRESSION : :: std :: os :: raw :: c_uint = 17 ; pub const BR_ERR_BAD_FRAGLEN : :: std :: os :: raw :: c_uint = 18 ; pub const BR_ERR_BAD_SECRENEG : :: std :: os :: raw :: c_uint = 19 ; pub const BR_ERR_EXTRA_EXTENSION : :: std :: os :: raw :: c_uint = 20 ; pub const BR_ERR_BAD_SNI : :: std :: os :: raw :: c_uint = 21 ; pub const BR_ERR_BAD_HELLO_DONE : :: std :: os :: raw :: c_uint = 22 ; pub const BR_ERR_LIMIT_EXCEEDED : :: std :: os :: raw :: c_uint = 23 ; pub const BR_ERR_BAD_FINISHED : :: std :: os :: raw :: c_uint = 24 ; pub const BR_ERR_RESUME_MISMATCH : :: std :: os :: raw :: c_uint = 25 ; pub const BR_ERR_INVALID_ALGORITHM : :: std :: os :: raw :: c_uint = 26 ; pub const BR_ERR_BAD_SIGNATURE : :: std :: os :: raw :: c_uint = 27 ; pub const BR_ERR_WRONG_KEY_USAGE : :: std :: os :: raw :: c_uint = 28 ; pub const BR_ERR_NO_CLIENT_AUTH : :: std :: os :: raw :: c_uint = 29 ; pub const BR_ERR_IO : :: std :: os :: raw :: c_uint = 31 ; pub const BR_ERR_RECV_FATAL_ALERT : :: std :: os :: raw :: c_uint = 256 ; pub const BR_ERR_SEND_FATAL_ALERT : :: std :: os :: raw :: c_uint = 512 ; pub const BR_MAX_CIPHER_SUITES : :: std :: os :: raw :: c_uint = 40 ; pub const BR_SSL_CLOSED : :: std :: os :: raw :: c_uint = 1 ; pub const BR_SSL_SENDREC : :: std :: os :: raw :: c_uint = 2 ; pub const BR_SSL_RECVREC : :: std :: os :: raw :: c_uint = 4 ; pub const BR_SSL_SENDAPP : :: std :: os :: raw :: c_uint = 8 ; pub const BR_SSL_RECVAPP : :: std :: os :: raw :: c_uint = 16 ; pub const BR_AUTH_ECDH : :: std :: os :: raw :: c_uint = 0 ; pub const BR_AUTH_RSA : :: std :: os :: raw :: c_uint = 1 ; pub const BR_AUTH_ECDSA : :: std :: os :: raw :: c_uint = 3 ; pub const BR_SSLKEYX_RSA : :: std :: os :: raw :: c_uint = 0 ; pub const BR_SSLKEYX_ECDHE_RSA : :: std :: os :: raw :: c_uint = 1 ; pub const BR_SSLKEYX_ECDHE_ECDSA : :: std :: os :: raw :: c_uint = 2 ; pub const BR_SSLKEYX_ECDH_RSA : :: std :: os :: raw :: c_uint = 3 ; pub const BR_SSLKEYX_ECDH_ECDSA : :: std :: os :: raw :: c_uint = 4 ; pub const BR_SSLENC_3DES_CBC : :: std :: os :: raw :: c_uint = 0 ; pub const BR_SSLENC_AES128_CBC : :: std :: os :: raw :: c_uint = 1 ; pub const BR_SSLENC_AES256_CBC : :: std :: os :: raw :: c_uint = 2 ; pub const BR_SSLENC_AES128_GCM : :: std :: os :: raw :: c_uint = 3 ; pub const BR_SSLENC_AES256_GCM : :: std :: os :: raw :: c_uint = 4 ; pub const BR_SSLENC_CHACHA20 : :: std :: os :: raw :: c_uint = 5 ; pub const BR_SSLMAC_AEAD : :: std :: os :: raw :: c_uint = 0 ; pub const BR_SSLMAC_SHA1 : :: std :: os :: raw :: c_uint = 2 ; pub const BR_SSLMAC_SHA256 : :: std :: os :: raw :: c_uint = 4 ; pub const BR_SSLMAC_SHA384 : :: std :: os :: raw :: c_uint = 5 ; pub const BR_SSLPRF_SHA256 : :: std :: os :: raw :: c_uint = 4 ; pub const BR_SSLPRF_SHA384 : :: std :: os :: raw :: c_uint = 5 ; pub const BR_TLS_NULL_WITH_NULL_NULL : :: std :: os :: raw :: c_uint = 0 ; pub const BR_TLS_RSA_WITH_NULL_MD5 : :: std :: os :: raw :: c_uint = 1 ; pub const BR_TLS_RSA_WITH_NULL_SHA : :: std :: os :: raw :: c_uint = 2 ; pub const BR_TLS_RSA_WITH_NULL_SHA256 : :: std :: os :: raw :: c_uint = 59 ; pub const BR_TLS_RSA_WITH_RC4_128_MD5 : :: std :: os :: raw :: c_uint = 4 ; pub const BR_TLS_RSA_WITH_RC4_128_SHA : :: std :: os :: raw :: c_uint = 5 ; pub const BR_TLS_RSA_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 10 ; pub const BR_TLS_RSA_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 47 ; pub const BR_TLS_RSA_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 53 ; pub const BR_TLS_RSA_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 60 ; pub const BR_TLS_RSA_WITH_AES_256_CBC_SHA256 : :: std :: os :: raw :: c_uint = 61 ; pub const BR_TLS_DH_DSS_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 13 ; pub const BR_TLS_DH_RSA_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 16 ; pub const BR_TLS_DHE_DSS_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 19 ; pub const BR_TLS_DHE_RSA_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 22 ; pub const BR_TLS_DH_DSS_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 48 ; pub const BR_TLS_DH_RSA_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 49 ; pub const BR_TLS_DHE_DSS_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 50 ; pub const BR_TLS_DHE_RSA_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 51 ; pub const BR_TLS_DH_DSS_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 54 ; pub const BR_TLS_DH_RSA_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 55 ; pub const BR_TLS_DHE_DSS_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 56 ; pub const BR_TLS_DHE_RSA_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 57 ; pub const BR_TLS_DH_DSS_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 62 ; pub const BR_TLS_DH_RSA_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 63 ; pub const BR_TLS_DHE_DSS_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 64 ; pub const BR_TLS_DHE_RSA_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 103 ; pub const BR_TLS_DH_DSS_WITH_AES_256_CBC_SHA256 : :: std :: os :: raw :: c_uint = 104 ; pub const BR_TLS_DH_RSA_WITH_AES_256_CBC_SHA256 : :: std :: os :: raw :: c_uint = 105 ; pub const BR_TLS_DHE_DSS_WITH_AES_256_CBC_SHA256 : :: std :: os :: raw :: c_uint = 106 ; pub const BR_TLS_DHE_RSA_WITH_AES_256_CBC_SHA256 : :: std :: os :: raw :: c_uint = 107 ; pub const BR_TLS_DH_anon_WITH_RC4_128_MD5 : :: std :: os :: raw :: c_uint = 24 ; pub const BR_TLS_DH_anon_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 27 ; pub const BR_TLS_DH_anon_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 52 ; pub const BR_TLS_DH_anon_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 58 ; pub const BR_TLS_DH_anon_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 108 ; pub const BR_TLS_DH_anon_WITH_AES_256_CBC_SHA256 : :: std :: os :: raw :: c_uint = 109 ; pub const BR_TLS_ECDH_ECDSA_WITH_NULL_SHA : :: std :: os :: raw :: c_uint = 49153 ; pub const BR_TLS_ECDH_ECDSA_WITH_RC4_128_SHA : :: std :: os :: raw :: c_uint = 49154 ; pub const BR_TLS_ECDH_ECDSA_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 49155 ; pub const BR_TLS_ECDH_ECDSA_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 49156 ; pub const BR_TLS_ECDH_ECDSA_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 49157 ; pub const BR_TLS_ECDHE_ECDSA_WITH_NULL_SHA : :: std :: os :: raw :: c_uint = 49158 ; pub const BR_TLS_ECDHE_ECDSA_WITH_RC4_128_SHA : :: std :: os :: raw :: c_uint = 49159 ; pub const BR_TLS_ECDHE_ECDSA_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 49160 ; pub const BR_TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 49161 ; pub const BR_TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 49162 ; pub const BR_TLS_ECDH_RSA_WITH_NULL_SHA : :: std :: os :: raw :: c_uint = 49163 ; pub const BR_TLS_ECDH_RSA_WITH_RC4_128_SHA : :: std :: os :: raw :: c_uint = 49164 ; pub const BR_TLS_ECDH_RSA_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 49165 ; pub const BR_TLS_ECDH_RSA_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 49166 ; pub const BR_TLS_ECDH_RSA_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 49167 ; pub const BR_TLS_ECDHE_RSA_WITH_NULL_SHA : :: std :: os :: raw :: c_uint = 49168 ; pub const BR_TLS_ECDHE_RSA_WITH_RC4_128_SHA : :: std :: os :: raw :: c_uint = 49169 ; pub const BR_TLS_ECDHE_RSA_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 49170 ; pub const BR_TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 49171 ; pub const BR_TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 49172 ; pub const BR_TLS_ECDH_anon_WITH_NULL_SHA : :: std :: os :: raw :: c_uint = 49173 ; pub const BR_TLS_ECDH_anon_WITH_RC4_128_SHA : :: std :: os :: raw :: c_uint = 49174 ; pub const BR_TLS_ECDH_anon_WITH_3DES_EDE_CBC_SHA : :: std :: os :: raw :: c_uint = 49175 ; pub const BR_TLS_ECDH_anon_WITH_AES_128_CBC_SHA : :: std :: os :: raw :: c_uint = 49176 ; pub const BR_TLS_ECDH_anon_WITH_AES_256_CBC_SHA : :: std :: os :: raw :: c_uint = 49177 ; pub const BR_TLS_RSA_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 156 ; pub const BR_TLS_RSA_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 157 ; pub const BR_TLS_DHE_RSA_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 158 ; pub const BR_TLS_DHE_RSA_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 159 ; pub const BR_TLS_DH_RSA_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 160 ; pub const BR_TLS_DH_RSA_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 161 ; pub const BR_TLS_DHE_DSS_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 162 ; pub const BR_TLS_DHE_DSS_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 163 ; pub const BR_TLS_DH_DSS_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 164 ; pub const BR_TLS_DH_DSS_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 165 ; pub const BR_TLS_DH_anon_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 166 ; pub const BR_TLS_DH_anon_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 167 ; pub const BR_TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 49187 ; pub const BR_TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA384 : :: std :: os :: raw :: c_uint = 49188 ; pub const BR_TLS_ECDH_ECDSA_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 49189 ; pub const BR_TLS_ECDH_ECDSA_WITH_AES_256_CBC_SHA384 : :: std :: os :: raw :: c_uint = 49190 ; pub const BR_TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 49191 ; pub const BR_TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA384 : :: std :: os :: raw :: c_uint = 49192 ; pub const BR_TLS_ECDH_RSA_WITH_AES_128_CBC_SHA256 : :: std :: os :: raw :: c_uint = 49193 ; pub const BR_TLS_ECDH_RSA_WITH_AES_256_CBC_SHA384 : :: std :: os :: raw :: c_uint = 49194 ; pub const BR_TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 49195 ; pub const BR_TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 49196 ; pub const BR_TLS_ECDH_ECDSA_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 49197 ; pub const BR_TLS_ECDH_ECDSA_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 49198 ; pub const BR_TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 49199 ; pub const BR_TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 49200 ; pub const BR_TLS_ECDH_RSA_WITH_AES_128_GCM_SHA256 : :: std :: os :: raw :: c_uint = 49201 ; pub const BR_TLS_ECDH_RSA_WITH_AES_256_GCM_SHA384 : :: std :: os :: raw :: c_uint = 49202 ; pub const BR_TLS_ECDHE_RSA_WITH_CHACHA20_POLY1305_SHA256 : :: std :: os :: raw :: c_uint = 52392 ; pub const BR_TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305_SHA256 : :: std :: os :: raw :: c_uint = 52393 ; pub const BR_TLS_DHE_RSA_WITH_CHACHA20_POLY1305_SHA256 : :: std :: os :: raw :: c_uint = 52394 ; pub const BR_TLS_PSK_WITH_CHACHA20_POLY1305_SHA256 : :: std :: os :: raw :: c_uint = 52395 ; pub const BR_TLS_ECDHE_PSK_WITH_CHACHA20_POLY1305_SHA256 : :: std :: os :: raw :: c_uint = 52396 ; pub const BR_TLS_DHE_PSK_WITH_CHACHA20_POLY1305_SHA256 : :: std :: os :: raw :: c_uint = 52397 ; pub const BR_TLS_RSA_PSK_WITH_CHACHA20_POLY1305_SHA256 : :: std :: os :: raw :: c_uint = 52398 ; pub const BR_TLS_FALLBACK_SCSV : :: std :: os :: raw :: c_uint = 22016 ; pub const BR_ALERT_CLOSE_NOTIFY : :: std :: os :: raw :: c_uint = 0 ; pub const BR_ALERT_UNEXPECTED_MESSAGE : :: std :: os :: raw :: c_uint = 10 ; pub const BR_ALERT_BAD_RECORD_MAC : :: std :: os :: raw :: c_uint = 20 ; pub const BR_ALERT_RECORD_OVERFLOW : :: std :: os :: raw :: c_uint = 22 ; pub const BR_ALERT_DECOMPRESSION_FAILURE : :: std :: os :: raw :: c_uint = 30 ; pub const BR_ALERT_HANDSHAKE_FAILURE : :: std :: os :: raw :: c_uint = 40 ; pub const BR_ALERT_BAD_CERTIFICATE : :: std :: os :: raw :: c_uint = 42 ; pub const BR_ALERT_UNSUPPORTED_CERTIFICATE : :: std :: os :: raw :: c_uint = 43 ; pub const BR_ALERT_CERTIFICATE_REVOKED : :: std :: os :: raw :: c_uint = 44 ; pub const BR_ALERT_CERTIFICATE_EXPIRED : :: std :: os :: raw :: c_uint = 45 ; pub const BR_ALERT_CERTIFICATE_UNKNOWN : :: std :: os :: raw :: c_uint = 46 ; pub const BR_ALERT_ILLEGAL_PARAMETER : :: std :: os :: raw :: c_uint = 47 ; pub const BR_ALERT_UNKNOWN_CA : :: std :: os :: raw :: c_uint = 48 ; pub const BR_ALERT_ACCESS_DENIED : :: std :: os :: raw :: c_uint = 49 ; pub const BR_ALERT_DECODE_ERROR : :: std :: os :: raw :: c_uint = 50 ; pub const BR_ALERT_DECRYPT_ERROR : :: std :: os :: raw :: c_uint = 51 ; pub const BR_ALERT_PROTOCOL_VERSION : :: std :: os :: raw :: c_uint = 70 ; pub const BR_ALERT_INSUFFICIENT_SECURITY : :: std :: os :: raw :: c_uint = 71 ; pub const BR_ALERT_INTERNAL_ERROR : :: std :: os :: raw :: c_uint = 80 ; pub const BR_ALERT_USER_CANCELED : :: std :: os :: raw :: c_uint = 90 ; pub const BR_ALERT_NO_RENEGOTIATION : :: std :: os :: raw :: c_uint = 100 ; pub const BR_ALERT_UNSUPPORTED_EXTENSION : :: std :: os :: raw :: c_uint = 110 ; pub const BR_ALERT_NO_APPLICATION_PROTOCOL : :: std :: os :: raw :: c_uint = 120 ; pub const BR_PEM_BEGIN_OBJ : :: std :: os :: raw :: c_uint = 1 ; pub const BR_PEM_END_OBJ : :: std :: os :: raw :: c_uint = 2 ; pub const BR_PEM_ERROR : :: std :: os :: raw :: c_uint = 3 ; pub type wchar_t = :: std :: os :: raw :: c_int ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct max_align_t { pub __clang_max_align_nonce1 : :: std :: os :: raw :: c_longlong , pub __bindgen_padding_0 : u64 , pub __clang_max_align_nonce2 : f64 , } # [ test ] fn bindgen_test_layout_max_align_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < max_align_t > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( max_align_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < max_align_t > ( ) ) ) . __clang_max_align_nonce1 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( max_align_t ) , "::" , stringify ! ( __clang_max_align_nonce1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < max_align_t > ( ) ) ) . __clang_max_align_nonce2 as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( max_align_t ) , "::" , stringify ! ( __clang_max_align_nonce2 ) ) ) ; } pub type __u_char = :: std :: os :: raw :: c_uchar ; pub type __u_short = :: std :: os :: raw :: c_ushort ; pub type __u_int = :: std :: os :: raw :: c_uint ; pub type __u_long = :: std :: os :: raw :: c_ulong ; pub type __int8_t = :: std :: os :: raw :: c_schar ; pub type __uint8_t = :: std :: os :: raw :: c_uchar ; pub type __int16_t = :: std :: os :: raw :: c_short ; pub type __uint16_t = :: std :: os :: raw :: c_ushort ; pub type __int32_t = :: std :: os :: raw :: c_int ; pub type __uint32_t = :: std :: os :: raw :: c_uint ; pub type __int64_t = :: std :: os :: raw :: c_long ; pub type __uint64_t = :: std :: os :: raw :: c_ulong ; pub type __quad_t = :: std :: os :: raw :: c_long ; pub type __u_quad_t = :: std :: os :: raw :: c_ulong ; pub type __intmax_t = :: std :: os :: raw :: c_long ; pub type __uintmax_t = :: std :: os :: raw :: c_ulong ; pub type __dev_t = :: std :: os :: raw :: c_ulong ; pub type __uid_t = :: std :: os :: raw :: c_uint ; pub type __gid_t = :: std :: os :: raw :: c_uint ; pub type __ino_t = :: std :: os :: raw :: c_ulong ; pub type __ino64_t = :: std :: os :: raw :: c_ulong ; pub type __mode_t = :: std :: os :: raw :: c_uint ; pub type __nlink_t = :: std :: os :: raw :: c_ulong ; pub type __off_t = :: std :: os :: raw :: c_long ; pub type __off64_t = :: std :: os :: raw :: c_long ; pub type __pid_t = :: std :: os :: raw :: c_int ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __fsid_t { pub __val : [ :: std :: os :: raw :: c_int ; 2usize ] , } # [ test ] fn bindgen_test_layout___fsid_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __fsid_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __fsid_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __fsid_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __fsid_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < __fsid_t > ( ) ) ) . __val as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( __fsid_t ) , "::" , stringify ! ( __val ) ) ) ; } pub type __clock_t = :: std :: os :: raw :: c_long ; pub type __rlim_t = :: std :: os :: raw :: c_ulong ; pub type __rlim64_t = :: std :: os :: raw :: c_ulong ; pub type __id_t = :: std :: os :: raw :: c_uint ; pub type __time_t = :: std :: os :: raw :: c_long ; pub type __useconds_t = :: std :: os :: raw :: c_uint ; pub type __suseconds_t = :: std :: os :: raw :: c_long ; pub type __daddr_t = :: std :: os :: raw :: c_int ; pub type __key_t = :: std :: os :: raw :: c_int ; pub type __clockid_t = :: std :: os :: raw :: c_int ; pub type __timer_t = * mut :: std :: os :: raw :: c_void ; pub type __blksize_t = :: std :: os :: raw :: c_long ; pub type __blkcnt_t = :: std :: os :: raw :: c_long ; pub type __blkcnt64_t = :: std :: os :: raw :: c_long ; pub type __fsblkcnt_t = :: std :: os :: raw :: c_ulong ; pub type __fsblkcnt64_t = :: std :: os :: raw :: c_ulong ; pub type __fsfilcnt_t = :: std :: os :: raw :: c_ulong ; pub type __fsfilcnt64_t = :: std :: os :: raw :: c_ulong ; pub type __fsword_t = :: std :: os :: raw :: c_long ; pub type __ssize_t = :: std :: os :: raw :: c_long ; pub type __syscall_slong_t = :: std :: os :: raw :: c_long ; pub type __syscall_ulong_t = :: std :: os :: raw :: c_ulong ; pub type __loff_t = __off64_t ; pub type __qaddr_t = * mut __quad_t ; pub type __caddr_t = * mut :: std :: os :: raw :: c_char ; pub type __intptr_t = :: std :: os :: raw :: c_long ; pub type __socklen_t = :: std :: os :: raw :: c_uint ; pub type __sig_atomic_t = :: std :: os :: raw :: c_int ; pub type int_least8_t = :: std :: os :: raw :: c_schar ; pub type int_least16_t = :: std :: os :: raw :: c_short ; pub type int_least32_t = :: std :: os :: raw :: c_int ; pub type int_least64_t = :: std :: os :: raw :: c_long ; pub type uint_least8_t = :: std :: os :: raw :: c_uchar ; pub type uint_least16_t = :: std :: os :: raw :: c_ushort ; pub type uint_least32_t = :: std :: os :: raw :: c_uint ; pub type uint_least64_t = :: std :: os :: raw :: c_ulong ; pub type int_fast8_t = :: std :: os :: raw :: c_schar ; pub type int_fast16_t = :: std :: os :: raw :: c_long ; pub type int_fast32_t = :: std :: os :: raw :: c_long ; pub type int_fast64_t = :: std :: os :: raw :: c_long ; pub type uint_fast8_t = :: std :: os :: raw :: c_uchar ; pub type uint_fast16_t = :: std :: os :: raw :: c_ulong ; pub type uint_fast32_t = :: std :: os :: raw :: c_ulong ; pub type uint_fast64_t = :: std :: os :: raw :: c_ulong ; pub type intmax_t = __intmax_t ; pub type uintmax_t = __uintmax_t ; extern "C" {
 pub fn memcpy ( __dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __n : usize , ) -> * mut :: std :: os :: raw :: c_void ; 
} extern "C" {
 pub fn memmove ( __dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __n : usize , ) -> * mut :: std :: os :: raw :: c_void ; 
} extern "C" {
 pub fn memccpy ( __dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : usize , ) -> * mut :: std :: os :: raw :: c_void ; 
} extern "C" {
 pub fn memset ( __s : * mut :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : usize , ) -> * mut :: std :: os :: raw :: c_void ; 
} extern "C" {
 pub fn memcmp ( __s1 : * const :: std :: os :: raw :: c_void , __s2 : * const :: std :: os :: raw :: c_void , __n : usize , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn memchr ( __s : * const :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : usize , ) -> * mut :: std :: os :: raw :: c_void ; 
} extern "C" {
 pub fn strcpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strncpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strcat ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strncat ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strcmp ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strncmp ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __n : usize , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strcoll ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strxfrm ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize , ) -> :: std :: os :: raw :: c_ulong ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __locale_struct { pub __locales : [ * mut __locale_data ; 13usize ] , pub __ctype_b : * const :: std :: os :: raw :: c_ushort , pub __ctype_tolower : * const :: std :: os :: raw :: c_int , pub __ctype_toupper : * const :: std :: os :: raw :: c_int , pub __names : [ * const :: std :: os :: raw :: c_char ; 13usize ] , } # [ test ] fn bindgen_test_layout___locale_struct ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __locale_struct > ( ) , 232usize , concat ! ( "Size of: " , stringify ! ( __locale_struct ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __locale_struct > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __locale_struct ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < __locale_struct > ( ) ) ) . __locales as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __locales ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < __locale_struct > ( ) ) ) . __ctype_b as * const _ as usize } , 104usize , concat ! ( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_b ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < __locale_struct > ( ) ) ) . __ctype_tolower as * const _ as usize } , 112usize , concat ! ( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_tolower ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < __locale_struct > ( ) ) ) . __ctype_toupper as * const _ as usize } , 120usize , concat ! ( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_toupper ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < __locale_struct > ( ) ) ) . __names as * const _ as usize } , 128usize , concat ! ( "Offset of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __names ) ) ) ; } pub type __locale_t = * mut __locale_struct ; pub type locale_t = __locale_t ; extern "C" {
 pub fn strcoll_l ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __l : locale_t , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strxfrm_l ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize , __l : locale_t , ) -> usize ; 
} extern "C" {
 pub fn strdup ( __s : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strndup ( __string : * const :: std :: os :: raw :: c_char , __n : usize , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strchr ( __s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strrchr ( __s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strcspn ( __s : * const :: std :: os :: raw :: c_char , __reject : * const :: std :: os :: raw :: c_char , ) -> :: std :: os :: raw :: c_ulong ; 
} extern "C" {
 pub fn strspn ( __s : * const :: std :: os :: raw :: c_char , __accept : * const :: std :: os :: raw :: c_char , ) -> :: std :: os :: raw :: c_ulong ; 
} extern "C" {
 pub fn strpbrk ( __s : * const :: std :: os :: raw :: c_char , __accept : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strstr ( __haystack : * const :: std :: os :: raw :: c_char , __needle : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strtok ( __s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn __strtok_r ( __s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char , __save_ptr : * mut * mut :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strtok_r ( __s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char , __save_ptr : * mut * mut :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strlen ( __s : * const :: std :: os :: raw :: c_char , ) -> :: std :: os :: raw :: c_ulong ; 
} extern "C" {
 pub fn strnlen ( __string : * const :: std :: os :: raw :: c_char , __maxlen : usize , ) -> usize ; 
} extern "C" {
 pub fn strerror ( __errnum : :: std :: os :: raw :: c_int , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 # [ link_name = "\u{1}__xpg_strerror_r" ] 
 pub fn strerror_r ( __errnum : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strerror_l ( __errnum : :: std :: os :: raw :: c_int , __l : locale_t , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn bcmp ( __s1 : * const :: std :: os :: raw :: c_void , __s2 : * const :: std :: os :: raw :: c_void , __n : usize , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn bcopy ( __src : * const :: std :: os :: raw :: c_void , __dest : * mut :: std :: os :: raw :: c_void , __n : usize , ) ; 
} extern "C" {
 pub fn bzero ( __s : * mut :: std :: os :: raw :: c_void , __n : usize , ) ; 
} extern "C" {
 pub fn index ( __s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn rindex ( __s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn ffs ( __i : :: std :: os :: raw :: c_int , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strcasecmp ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strncasecmp ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __n : usize , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strcasecmp_l ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __loc : locale_t , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn strncasecmp_l ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __n : usize , __loc : locale_t , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 pub fn explicit_bzero ( __s : * mut :: std :: os :: raw :: c_void , __n : usize , ) ; 
} extern "C" {
 pub fn strsep ( __stringp : * mut * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn strsignal ( __sig : :: std :: os :: raw :: c_int , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn __stpcpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn stpcpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn __stpncpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize , ) -> * mut :: std :: os :: raw :: c_char ; 
} extern "C" {
 pub fn stpncpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize , ) -> * mut :: std :: os :: raw :: c_char ; 
} 
 /// \brief Class type for hash function implementations.
///
/// A `br_hash_class` instance references the methods implementing a hash
/// function. Constant instances of this structure are defined for each
/// implemented hash function. Such instances are also called "vtables".
///
/// Vtables are used to support object-oriented programming, as
/// described on [the BearSSL Web site](https://www.bearssl.org/oop.html). 
 pub type br_hash_class = br_hash_class_ ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_hash_class_ { 
 /// \brief Size (in bytes) of the context structure appropriate for
    /// computing this hash function. 
 pub context_size : usize , 
 /// \brief Descriptor word that contains information about the hash
    /// function.
    ///
    /// For each word `xxx` described below, use `BR_HASHDESC_xxx_OFF`
    /// and `BR_HASHDESC_xxx_MASK` to access the specific value, as
    /// follows:
    ///
    /// (hf->desc >> BR_HASHDESC_xxx_OFF) & BR_HASHDESC_xxx_MASK
    ///
    /// The defined elements are:
    ///
    /// - `ID`: the symbolic identifier for the function, as defined
    /// in [TLS](https://tools.ietf.org/html/rfc5246#section-7.4.1.4.1)
    /// (MD5 = 1, SHA-1 = 2,...).
    ///
    /// - `OUT`: hash output size, in bytes.
    ///
    /// - `STATE`: internal running state size, in bytes.
    ///
    /// - `LBLEN`: base-2 logarithm for the internal block size, as
    /// defined for HMAC processing (this is 6 for MD5, SHA-1, SHA-224
    /// and SHA-256, since these functions use 64-byte blocks; for
    /// SHA-384 and SHA-512, this is 7, corresponding to their
    /// 128-byte blocks).
    ///
    /// The descriptor may contain a few other flags. 
 pub desc : u32 , 
 /// \brief Initialisation method.
    ///
    /// This method takes as parameter a pointer to a context area,
    /// that it initialises. The first field of the context is set
    /// to this vtable; other elements are initialised for a new hash
    /// computation.
    ///
    /// \param ctx   pointer to (the first field of) the context. 
 pub init : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_hash_class ) > , 
 /// \brief Data injection method.
    ///
    /// The `len` bytes starting at address `data` are injected into
    /// the running hash computation incarnated by the specified
    /// context. The context is updated accordingly. It is allowed
    /// to have `len == 0`, in which case `data` is ignored (and could
    /// be `NULL`), and nothing happens.
    /// on the input data.
    ///
    /// \param ctx    pointer to (the first field of) the context.
    /// \param data   pointer to the first data byte to inject.
    /// \param len    number of bytes to inject. 
 pub update : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_hash_class , data : * const :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Produce hash output.
    ///
    /// The hash output corresponding to all data bytes injected in the
    /// context since the last `init()` call is computed, and written
    /// in the buffer pointed to by `dst`. The hash output size depends
    /// on the implemented hash function (e.g. 16 bytes for MD5).
    /// The context is _not_ modified by this call, so further bytes
    /// may be afterwards injected to continue the current computation.
    ///
    /// \param ctx   pointer to (the first field of) the context.
    /// \param dst   destination buffer for the hash output. 
 pub out : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_hash_class , dst : * mut :: std :: os :: raw :: c_void ) > , 
 /// \brief Get running state.
    ///
    /// This method saves the current running state into the `dst`
    /// buffer. What constitutes the "running state" depends on the
    /// hash function; for Merkle-Damgård hash functions (like
    /// MD5 or SHA-1), this is the output obtained after processing
    /// each block. The number of bytes injected so far is returned.
    /// The context is not modified by this call.
    ///
    /// \param ctx   pointer to (the first field of) the context.
    /// \param dst   destination buffer for the state.
    /// \return  the injected total byte length. 
 pub state : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_hash_class , dst : * mut :: std :: os :: raw :: c_void ) -> u64 > , 
 /// \brief Set running state.
    ///
    /// This methods replaces the running state for the function.
    ///
    /// \param ctx     pointer to (the first field of) the context.
    /// \param stb     source buffer for the state.
    /// \param count   injected total byte length. 
 pub set_state : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_hash_class , stb : * const :: std :: os :: raw :: c_void , count : u64 ) > , } # [ test ] fn bindgen_test_layout_br_hash_class_ ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_hash_class_ > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( br_hash_class_ ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_hash_class_ > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_hash_class_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_class_ > ( ) ) ) . context_size as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_class_ ) , "::" , stringify ! ( context_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_class_ > ( ) ) ) . desc as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_class_ ) , "::" , stringify ! ( desc ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_class_ > ( ) ) ) . init as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_class_ ) , "::" , stringify ! ( init ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_class_ > ( ) ) ) . update as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_class_ ) , "::" , stringify ! ( update ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_class_ > ( ) ) ) . out as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_class_ ) , "::" , stringify ! ( out ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_class_ > ( ) ) ) . state as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_class_ ) , "::" , stringify ! ( state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_class_ > ( ) ) ) . set_state as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_class_ ) , "::" , stringify ! ( set_state ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_md5_vtable" ] 
 pub static mut  br_md5_vtable  :  br_hash_class ;
} 
 /// \brief MD5 context.
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_md5_context { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_hash_class , pub buf : [ :: std :: os :: raw :: c_uchar ; 64usize ] , pub count : u64 , pub val : [ u32 ; 4usize ] , } # [ test ] fn bindgen_test_layout_br_md5_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_md5_context > ( ) , 96usize , concat ! ( "Size of: " , stringify ! ( br_md5_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_md5_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_md5_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_md5_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5_context > ( ) ) ) . buf as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_md5_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5_context > ( ) ) ) . count as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( br_md5_context ) , "::" , stringify ! ( count ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5_context > ( ) ) ) . val as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( br_md5_context ) , "::" , stringify ! ( val ) ) ) ; } extern "C" {
 
 /// \brief MD5 context initialisation.
///
/// This function initialises or resets a context for a new MD5
/// computation. It also sets the vtable pointer.
///
/// \param ctx   pointer to the context structure. 
 
 pub fn br_md5_init ( ctx : * mut br_md5_context , ) ; 
} extern "C" {
 
 /// \brief Inject some data bytes in a running MD5 computation.
///
/// The provided context is updated with some data bytes. If the number
/// of bytes (`len`) is zero, then the data pointer (`data`) is ignored
/// and may be `NULL`, and this function does nothing.
///
/// \param ctx    pointer to the context structure.
/// \param data   pointer to the injected data.
/// \param len    injected data length (in bytes). 
 
 pub fn br_md5_update ( ctx : * mut br_md5_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute MD5 output.
///
/// The MD5 output for the concatenation of all bytes injected in the
/// provided context since the last initialisation or reset call, is
/// computed and written in the buffer pointed to by `out`. The context
/// itself is not modified, so extra bytes may be injected afterwards
/// to continue that computation.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the hash output. 
 
 pub fn br_md5_out ( ctx : * const br_md5_context , out : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 
 /// \brief Save MD5 running state.
///
/// The running state for MD5 (output of the last internal block
/// processing) is written in the buffer pointed to by `out`. The
/// number of bytes injected since the last initialisation or reset
/// call is returned. The context is not modified.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the running state.
/// \return  the injected total byte length. 
 
 pub fn br_md5_state ( ctx : * const br_md5_context , out : * mut :: std :: os :: raw :: c_void , ) -> u64 ; 
} extern "C" {
 
 /// \brief Restore MD5 running state.
///
/// The running state for MD5 is set to the provided values.
///
/// \param ctx     pointer to the context structure.
/// \param stb     source buffer for the running state.
/// \param count   the injected total byte length. 
 
 pub fn br_md5_set_state ( ctx : * mut br_md5_context , stb : * const :: std :: os :: raw :: c_void , count : u64 , ) ; 
} extern "C" {
 # [ link_name = "\u{1}br_sha1_vtable" ] 
 pub static mut  br_sha1_vtable  :  br_hash_class ;
} 
 /// \brief SHA-1 context.
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_sha1_context { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_hash_class , pub buf : [ :: std :: os :: raw :: c_uchar ; 64usize ] , pub count : u64 , pub val : [ u32 ; 5usize ] , } # [ test ] fn bindgen_test_layout_br_sha1_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_sha1_context > ( ) , 104usize , concat ! ( "Size of: " , stringify ! ( br_sha1_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_sha1_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_sha1_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha1_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_sha1_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha1_context > ( ) ) ) . buf as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_sha1_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha1_context > ( ) ) ) . count as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( br_sha1_context ) , "::" , stringify ! ( count ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha1_context > ( ) ) ) . val as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( br_sha1_context ) , "::" , stringify ! ( val ) ) ) ; } extern "C" {
 
 /// \brief SHA-1 context initialisation.
///
/// This function initialises or resets a context for a new SHA-1
/// computation. It also sets the vtable pointer.
///
/// \param ctx   pointer to the context structure. 
 
 pub fn br_sha1_init ( ctx : * mut br_sha1_context , ) ; 
} extern "C" {
 
 /// \brief Inject some data bytes in a running SHA-1 computation.
///
/// The provided context is updated with some data bytes. If the number
/// of bytes (`len`) is zero, then the data pointer (`data`) is ignored
/// and may be `NULL`, and this function does nothing.
///
/// \param ctx    pointer to the context structure.
/// \param data   pointer to the injected data.
/// \param len    injected data length (in bytes). 
 
 pub fn br_sha1_update ( ctx : * mut br_sha1_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute SHA-1 output.
///
/// The SHA-1 output for the concatenation of all bytes injected in the
/// provided context since the last initialisation or reset call, is
/// computed and written in the buffer pointed to by `out`. The context
/// itself is not modified, so extra bytes may be injected afterwards
/// to continue that computation.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the hash output. 
 
 pub fn br_sha1_out ( ctx : * const br_sha1_context , out : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 
 /// \brief Save SHA-1 running state.
///
/// The running state for SHA-1 (output of the last internal block
/// processing) is written in the buffer pointed to by `out`. The
/// number of bytes injected since the last initialisation or reset
/// call is returned. The context is not modified.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the running state.
/// \return  the injected total byte length. 
 
 pub fn br_sha1_state ( ctx : * const br_sha1_context , out : * mut :: std :: os :: raw :: c_void , ) -> u64 ; 
} extern "C" {
 
 /// \brief Restore SHA-1 running state.
///
/// The running state for SHA-1 is set to the provided values.
///
/// \param ctx     pointer to the context structure.
/// \param stb     source buffer for the running state.
/// \param count   the injected total byte length. 
 
 pub fn br_sha1_set_state ( ctx : * mut br_sha1_context , stb : * const :: std :: os :: raw :: c_void , count : u64 , ) ; 
} extern "C" {
 # [ link_name = "\u{1}br_sha224_vtable" ] 
 pub static mut  br_sha224_vtable  :  br_hash_class ;
} 
 /// \brief SHA-224 context.
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_sha224_context { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_hash_class , pub buf : [ :: std :: os :: raw :: c_uchar ; 64usize ] , pub count : u64 , pub val : [ u32 ; 8usize ] , } # [ test ] fn bindgen_test_layout_br_sha224_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_sha224_context > ( ) , 112usize , concat ! ( "Size of: " , stringify ! ( br_sha224_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_sha224_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_sha224_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha224_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_sha224_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha224_context > ( ) ) ) . buf as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_sha224_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha224_context > ( ) ) ) . count as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( br_sha224_context ) , "::" , stringify ! ( count ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha224_context > ( ) ) ) . val as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( br_sha224_context ) , "::" , stringify ! ( val ) ) ) ; } extern "C" {
 
 /// \brief SHA-224 context initialisation.
///
/// This function initialises or resets a context for a new SHA-224
/// computation. It also sets the vtable pointer.
///
/// \param ctx   pointer to the context structure. 
 
 pub fn br_sha224_init ( ctx : * mut br_sha224_context , ) ; 
} extern "C" {
 
 /// \brief Inject some data bytes in a running SHA-224 computation.
///
/// The provided context is updated with some data bytes. If the number
/// of bytes (`len`) is zero, then the data pointer (`data`) is ignored
/// and may be `NULL`, and this function does nothing.
///
/// \param ctx    pointer to the context structure.
/// \param data   pointer to the injected data.
/// \param len    injected data length (in bytes). 
 
 pub fn br_sha224_update ( ctx : * mut br_sha224_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute SHA-224 output.
///
/// The SHA-224 output for the concatenation of all bytes injected in the
/// provided context since the last initialisation or reset call, is
/// computed and written in the buffer pointed to by `out`. The context
/// itself is not modified, so extra bytes may be injected afterwards
/// to continue that computation.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the hash output. 
 
 pub fn br_sha224_out ( ctx : * const br_sha224_context , out : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 
 /// \brief Save SHA-224 running state.
///
/// The running state for SHA-224 (output of the last internal block
/// processing) is written in the buffer pointed to by `out`. The
/// number of bytes injected since the last initialisation or reset
/// call is returned. The context is not modified.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the running state.
/// \return  the injected total byte length. 
 
 pub fn br_sha224_state ( ctx : * const br_sha224_context , out : * mut :: std :: os :: raw :: c_void , ) -> u64 ; 
} extern "C" {
 
 /// \brief Restore SHA-224 running state.
///
/// The running state for SHA-224 is set to the provided values.
///
/// \param ctx     pointer to the context structure.
/// \param stb     source buffer for the running state.
/// \param count   the injected total byte length. 
 
 pub fn br_sha224_set_state ( ctx : * mut br_sha224_context , stb : * const :: std :: os :: raw :: c_void , count : u64 , ) ; 
} extern "C" {
 # [ link_name = "\u{1}br_sha256_vtable" ] 
 pub static mut  br_sha256_vtable  :  br_hash_class ;
} pub type br_sha256_context = br_sha224_context ; extern "C" {
 
 /// \brief SHA-256 context initialisation.
///
/// This function initialises or resets a context for a new SHA-256
/// computation. It also sets the vtable pointer.
///
/// \param ctx   pointer to the context structure. 
 
 pub fn br_sha256_init ( ctx : * mut br_sha256_context , ) ; 
} extern "C" {
 
 /// \brief Compute SHA-256 output.
///
/// The SHA-256 output for the concatenation of all bytes injected in the
/// provided context since the last initialisation or reset call, is
/// computed and written in the buffer pointed to by `out`. The context
/// itself is not modified, so extra bytes may be injected afterwards
/// to continue that computation.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the hash output. 
 
 pub fn br_sha256_out ( ctx : * const br_sha256_context , out : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 # [ link_name = "\u{1}br_sha384_vtable" ] 
 pub static mut  br_sha384_vtable  :  br_hash_class ;
} 
 /// \brief SHA-384 context.
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_sha384_context { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_hash_class , pub buf : [ :: std :: os :: raw :: c_uchar ; 128usize ] , pub count : u64 , pub val : [ u64 ; 8usize ] , } # [ test ] fn bindgen_test_layout_br_sha384_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_sha384_context > ( ) , 208usize , concat ! ( "Size of: " , stringify ! ( br_sha384_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_sha384_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_sha384_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha384_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_sha384_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha384_context > ( ) ) ) . buf as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_sha384_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha384_context > ( ) ) ) . count as * const _ as usize } , 136usize , concat ! ( "Offset of field: " , stringify ! ( br_sha384_context ) , "::" , stringify ! ( count ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_sha384_context > ( ) ) ) . val as * const _ as usize } , 144usize , concat ! ( "Offset of field: " , stringify ! ( br_sha384_context ) , "::" , stringify ! ( val ) ) ) ; } extern "C" {
 
 /// \brief SHA-384 context initialisation.
///
/// This function initialises or resets a context for a new SHA-384
/// computation. It also sets the vtable pointer.
///
/// \param ctx   pointer to the context structure. 
 
 pub fn br_sha384_init ( ctx : * mut br_sha384_context , ) ; 
} extern "C" {
 
 /// \brief Inject some data bytes in a running SHA-384 computation.
///
/// The provided context is updated with some data bytes. If the number
/// of bytes (`len`) is zero, then the data pointer (`data`) is ignored
/// and may be `NULL`, and this function does nothing.
///
/// \param ctx    pointer to the context structure.
/// \param data   pointer to the injected data.
/// \param len    injected data length (in bytes). 
 
 pub fn br_sha384_update ( ctx : * mut br_sha384_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute SHA-384 output.
///
/// The SHA-384 output for the concatenation of all bytes injected in the
/// provided context since the last initialisation or reset call, is
/// computed and written in the buffer pointed to by `out`. The context
/// itself is not modified, so extra bytes may be injected afterwards
/// to continue that computation.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the hash output. 
 
 pub fn br_sha384_out ( ctx : * const br_sha384_context , out : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 
 /// \brief Save SHA-384 running state.
///
/// The running state for SHA-384 (output of the last internal block
/// processing) is written in the buffer pointed to by `out`. The
/// number of bytes injected since the last initialisation or reset
/// call is returned. The context is not modified.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the running state.
/// \return  the injected total byte length. 
 
 pub fn br_sha384_state ( ctx : * const br_sha384_context , out : * mut :: std :: os :: raw :: c_void , ) -> u64 ; 
} extern "C" {
 
 /// \brief Restore SHA-384 running state.
///
/// The running state for SHA-384 is set to the provided values.
///
/// \param ctx     pointer to the context structure.
/// \param stb     source buffer for the running state.
/// \param count   the injected total byte length. 
 
 pub fn br_sha384_set_state ( ctx : * mut br_sha384_context , stb : * const :: std :: os :: raw :: c_void , count : u64 , ) ; 
} extern "C" {
 # [ link_name = "\u{1}br_sha512_vtable" ] 
 pub static mut  br_sha512_vtable  :  br_hash_class ;
} pub type br_sha512_context = br_sha384_context ; extern "C" {
 
 /// \brief SHA-512 context initialisation.
///
/// This function initialises or resets a context for a new SHA-512
/// computation. It also sets the vtable pointer.
///
/// \param ctx   pointer to the context structure. 
 
 pub fn br_sha512_init ( ctx : * mut br_sha512_context , ) ; 
} extern "C" {
 
 /// \brief Compute SHA-512 output.
///
/// The SHA-512 output for the concatenation of all bytes injected in the
/// provided context since the last initialisation or reset call, is
/// computed and written in the buffer pointed to by `out`. The context
/// itself is not modified, so extra bytes may be injected afterwards
/// to continue that computation.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the hash output. 
 
 pub fn br_sha512_out ( ctx : * const br_sha512_context , out : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 # [ link_name = "\u{1}br_md5sha1_vtable" ] 
 pub static mut  br_md5sha1_vtable  :  br_hash_class ;
} 
 /// \brief MD5+SHA-1 context.
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_md5sha1_context { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_hash_class , pub buf : [ :: std :: os :: raw :: c_uchar ; 64usize ] , pub count : u64 , pub val_md5 : [ u32 ; 4usize ] , pub val_sha1 : [ u32 ; 5usize ] , } # [ test ] fn bindgen_test_layout_br_md5sha1_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_md5sha1_context > ( ) , 120usize , concat ! ( "Size of: " , stringify ! ( br_md5sha1_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_md5sha1_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_md5sha1_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5sha1_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_md5sha1_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5sha1_context > ( ) ) ) . buf as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_md5sha1_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5sha1_context > ( ) ) ) . count as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( br_md5sha1_context ) , "::" , stringify ! ( count ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5sha1_context > ( ) ) ) . val_md5 as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( br_md5sha1_context ) , "::" , stringify ! ( val_md5 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_md5sha1_context > ( ) ) ) . val_sha1 as * const _ as usize } , 96usize , concat ! ( "Offset of field: " , stringify ! ( br_md5sha1_context ) , "::" , stringify ! ( val_sha1 ) ) ) ; } extern "C" {
 
 /// \brief MD5+SHA-1 context initialisation.
///
/// This function initialises or resets a context for a new SHA-512
/// computation. It also sets the vtable pointer.
///
/// \param ctx   pointer to the context structure. 
 
 pub fn br_md5sha1_init ( ctx : * mut br_md5sha1_context , ) ; 
} extern "C" {
 
 /// \brief Inject some data bytes in a running MD5+SHA-1 computation.
///
/// The provided context is updated with some data bytes. If the number
/// of bytes (`len`) is zero, then the data pointer (`data`) is ignored
/// and may be `NULL`, and this function does nothing.
///
/// \param ctx    pointer to the context structure.
/// \param data   pointer to the injected data.
/// \param len    injected data length (in bytes). 
 
 pub fn br_md5sha1_update ( ctx : * mut br_md5sha1_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute MD5+SHA-1 output.
///
/// The MD5+SHA-1 output for the concatenation of all bytes injected in the
/// provided context since the last initialisation or reset call, is
/// computed and written in the buffer pointed to by `out`. The context
/// itself is not modified, so extra bytes may be injected afterwards
/// to continue that computation.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the hash output. 
 
 pub fn br_md5sha1_out ( ctx : * const br_md5sha1_context , out : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 
 /// \brief Save MD5+SHA-1 running state.
///
/// The running state for MD5+SHA-1 (output of the last internal block
/// processing) is written in the buffer pointed to by `out`. The
/// number of bytes injected since the last initialisation or reset
/// call is returned. The context is not modified.
///
/// \param ctx   pointer to the context structure.
/// \param out   destination buffer for the running state.
/// \return  the injected total byte length. 
 
 pub fn br_md5sha1_state ( ctx : * const br_md5sha1_context , out : * mut :: std :: os :: raw :: c_void , ) -> u64 ; 
} extern "C" {
 
 /// \brief Restore MD5+SHA-1 running state.
///
/// The running state for MD5+SHA-1 is set to the provided values.
///
/// \param ctx     pointer to the context structure.
/// \param stb     source buffer for the running state.
/// \param count   the injected total byte length. 
 
 pub fn br_md5sha1_set_state ( ctx : * mut br_md5sha1_context , stb : * const :: std :: os :: raw :: c_void , count : u64 , ) ; 
} 
 /// \brief Aggregate context for configurable hash function support.
///
/// The `br_hash_compat_context` type is a type which is large enough to
/// serve as context for all standard hash functions defined above. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_hash_compat_context { pub vtable : * const br_hash_class , pub md5 : br_md5_context , pub sha1 : br_sha1_context , pub sha224 : br_sha224_context , pub sha256 : br_sha256_context , pub sha384 : br_sha384_context , pub sha512 : br_sha512_context , pub md5sha1 : br_md5sha1_context , _bindgen_union_align : [ u64 ; 26usize ] , } # [ test ] fn bindgen_test_layout_br_hash_compat_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_hash_compat_context > ( ) , 208usize , concat ! ( "Size of: " , stringify ! ( br_hash_compat_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_hash_compat_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_hash_compat_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_compat_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_compat_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_compat_context > ( ) ) ) . md5 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_compat_context ) , "::" , stringify ! ( md5 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_compat_context > ( ) ) ) . sha1 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_compat_context ) , "::" , stringify ! ( sha1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_compat_context > ( ) ) ) . sha224 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_compat_context ) , "::" , stringify ! ( sha224 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_compat_context > ( ) ) ) . sha256 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_compat_context ) , "::" , stringify ! ( sha256 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_compat_context > ( ) ) ) . sha384 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_compat_context ) , "::" , stringify ! ( sha384 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_compat_context > ( ) ) ) . sha512 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_compat_context ) , "::" , stringify ! ( sha512 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hash_compat_context > ( ) ) ) . md5sha1 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hash_compat_context ) , "::" , stringify ! ( md5sha1 ) ) ) ; } 
 /// \brief Multi-hasher context structure.
///
/// The multi-hasher runs up to six hash functions in the standard TLS list
/// (MD5, SHA-1, SHA-224, SHA-256, SHA-384 and SHA-512) in parallel, over
/// the same input.
///
/// The multi-hasher does _not_ follow the OOP structure with a vtable.
/// Instead, it is configured with the vtables of the hash functions it
/// should run. Structure fields are not supposed to be accessed directly. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_multihash_context { pub buf : [ :: std :: os :: raw :: c_uchar ; 128usize ] , pub count : u64 , pub val_32 : [ u32 ; 25usize ] , pub val_64 : [ u64 ; 16usize ] , pub impl_ : [ * const br_hash_class ; 6usize ] , } # [ test ] fn bindgen_test_layout_br_multihash_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_multihash_context > ( ) , 416usize , concat ! ( "Size of: " , stringify ! ( br_multihash_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_multihash_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_multihash_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_multihash_context > ( ) ) ) . buf as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_multihash_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_multihash_context > ( ) ) ) . count as * const _ as usize } , 128usize , concat ! ( "Offset of field: " , stringify ! ( br_multihash_context ) , "::" , stringify ! ( count ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_multihash_context > ( ) ) ) . val_32 as * const _ as usize } , 136usize , concat ! ( "Offset of field: " , stringify ! ( br_multihash_context ) , "::" , stringify ! ( val_32 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_multihash_context > ( ) ) ) . val_64 as * const _ as usize } , 240usize , concat ! ( "Offset of field: " , stringify ! ( br_multihash_context ) , "::" , stringify ! ( val_64 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_multihash_context > ( ) ) ) . impl_ as * const _ as usize } , 368usize , concat ! ( "Offset of field: " , stringify ! ( br_multihash_context ) , "::" , stringify ! ( impl_ ) ) ) ; } extern "C" {
 
 /// \brief Clear a multi-hasher context.
///
/// This should always be called once on a given context, _before_ setting
/// the implementation pointers.
///
/// \param ctx   the multi-hasher context. 
 
 pub fn br_multihash_zero ( ctx : * mut br_multihash_context , ) ; 
} extern "C" {
 
 /// \brief Reset a multi-hasher context.
///
/// This function prepares the context for a new hashing computation,
/// for all implementations configured at that point.
///
/// \param ctx    the multi-hasher context. 
 
 pub fn br_multihash_init ( ctx : * mut br_multihash_context , ) ; 
} extern "C" {
 
 /// \brief Inject some data bytes in a running multi-hashing computation.
///
/// The provided context is updated with some data bytes. If the number
/// of bytes (`len`) is zero, then the data pointer (`data`) is ignored
/// and may be `NULL`, and this function does nothing.
///
/// \param ctx    pointer to the context structure.
/// \param data   pointer to the injected data.
/// \param len    injected data length (in bytes). 
 
 pub fn br_multihash_update ( ctx : * mut br_multihash_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute a hash output from a multi-hasher.
///
/// The hash output for the concatenation of all bytes injected in the
/// provided context since the last initialisation or reset call, is
/// computed and written in the buffer pointed to by `dst`. The hash
/// function to use is identified by `id` and must be one of the standard
/// hash functions. If that hash function was indeed configured in the
/// multi-hasher context, the corresponding hash value is written in
/// `dst` and its length (in bytes) is returned. If the hash function
/// was _not_ configured, then nothing is written in `dst` and 0 is
/// returned.
///
/// The context itself is not modified, so extra bytes may be injected
/// afterwards to continue the hash computations.
///
/// \param ctx   pointer to the context structure.
/// \param id    the hash function symbolic identifier.
/// \param dst   destination buffer for the hash output.
/// \return  the hash output length (in bytes), or 0. 
 
 pub fn br_multihash_out ( ctx : * const br_multihash_context , id : :: std :: os :: raw :: c_int , dst : * mut :: std :: os :: raw :: c_void , ) -> usize ; 
} 
 /// \brief Type for a GHASH implementation.
///
/// GHASH is a sort of keyed hash meant to be used to implement GCM in
/// combination with a block cipher (with 16-byte blocks).
///
/// The `y` array has length 16 bytes and is used for input and output; in
/// a complete GHASH run, it starts with an all-zero value. `h` is a 16-byte
/// value that serves as key (it is derived from the encryption key in GCM,
/// using the block cipher). The data length (`len`) is expressed in bytes.
/// The `y` array is updated.
///
/// If the data length is not a multiple of 16, then the data is implicitly
/// padded with zeros up to the next multiple of 16. Thus, when using GHASH
/// in GCM, this method may be called twice, for the associated data and
/// for the ciphertext, respectively; the zero-padding implements exactly
/// the GCM rules.
///
/// \param y      the array to update.
/// \param h      the GHASH key.
/// \param data   the input data (may be `NULL` if `len` is zero).
/// \param len    the input data length (in bytes). 
 pub type br_ghash = :: std :: option :: Option < unsafe extern "C" fn ( y : * mut :: std :: os :: raw :: c_void , h : * const :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize ) > ; extern "C" {
 
 /// \brief GHASH implementation using multiplications (mixed 32-bit).
///
/// This implementation uses multiplications of 32-bit values, with a
/// 64-bit result. It is constant-time (if multiplications are
/// constant-time).
///
/// \param y      the array to update.
/// \param h      the GHASH key.
/// \param data   the input data (may be `NULL` if `len` is zero).
/// \param len    the input data length (in bytes). 
 
 pub fn br_ghash_ctmul ( y : * mut :: std :: os :: raw :: c_void , h : * const :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief GHASH implementation using multiplications (strict 32-bit).
///
/// This implementation uses multiplications of 32-bit values, with a
/// 32-bit result. It is usually somewhat slower than `br_ghash_ctmul()`,
/// but it is expected to be faster on architectures for which the
/// 32-bit multiplication opcode does not yield the upper 32 bits of the
/// product. It is constant-time (if multiplications are constant-time).
///
/// \param y      the array to update.
/// \param h      the GHASH key.
/// \param data   the input data (may be `NULL` if `len` is zero).
/// \param len    the input data length (in bytes). 
 
 pub fn br_ghash_ctmul32 ( y : * mut :: std :: os :: raw :: c_void , h : * const :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief GHASH implementation using multiplications (64-bit).
///
/// This implementation uses multiplications of 64-bit values, with a
/// 64-bit result. It is constant-time (if multiplications are
/// constant-time). It is substantially faster than `br_ghash_ctmul()`
/// and `br_ghash_ctmul32()` on most 64-bit architectures.
///
/// \param y      the array to update.
/// \param h      the GHASH key.
/// \param data   the input data (may be `NULL` if `len` is zero).
/// \param len    the input data length (in bytes). 
 
 pub fn br_ghash_ctmul64 ( y : * mut :: std :: os :: raw :: c_void , h : * const :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief GHASH implementation using the `pclmulqdq` opcode (part of the
/// AES-NI instructions).
///
/// This implementation is available only on x86 platforms where the
/// compiler supports the relevant intrinsic functions. Even if the
/// compiler supports these functions, the local CPU might not support
/// the `pclmulqdq` opcode, meaning that a call will fail with an
/// illegal instruction exception. To safely obtain a pointer to this
/// function when supported (or 0 otherwise), use `br_ghash_pclmul_get()`.
///
/// \param y      the array to update.
/// \param h      the GHASH key.
/// \param data   the input data (may be `NULL` if `len` is zero).
/// \param len    the input data length (in bytes). 
 
 pub fn br_ghash_pclmul ( y : * mut :: std :: os :: raw :: c_void , h : * const :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Obtain the `pclmul` GHASH implementation, if available.
///
/// If the `pclmul` implementation was compiled in the library (depending
/// on the compiler abilities) _and_ the local CPU appears to support the
/// opcode, then this function will return a pointer to the
/// `br_ghash_pclmul()` function. Otherwise, it will return `0`.
///
/// \return  the `pclmul` GHASH implementation, or `0`. 
 
 pub fn br_ghash_pclmul_get ( ) -> br_ghash ; 
} extern "C" {
 
 /// \brief GHASH implementation using the POWER8 opcodes.
///
/// This implementation is available only on POWER8 platforms (and later).
/// To safely obtain a pointer to this function when supported (or 0
/// otherwise), use `br_ghash_pwr8_get()`.
///
/// \param y      the array to update.
/// \param h      the GHASH key.
/// \param data   the input data (may be `NULL` if `len` is zero).
/// \param len    the input data length (in bytes). 
 
 pub fn br_ghash_pwr8 ( y : * mut :: std :: os :: raw :: c_void , h : * const :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Obtain the `pwr8` GHASH implementation, if available.
///
/// If the `pwr8` implementation was compiled in the library (depending
/// on the compiler abilities) _and_ the local CPU appears to support the
/// opcode, then this function will return a pointer to the
/// `br_ghash_pwr8()` function. Otherwise, it will return `0`.
///
/// \return  the `pwr8` GHASH implementation, or `0`. 
 
 pub fn br_ghash_pwr8_get ( ) -> br_ghash ; 
} 
 /// \brief HMAC key context.
///
/// The HMAC key context is initialised with a hash function implementation
/// and a secret key. Contents are opaque (callers should not access them
/// directly). The caller is responsible for allocating the context where
/// appropriate. Context initialisation and usage incurs no dynamic
/// allocation, so there is no release function. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_hmac_key_context { pub dig_vtable : * const br_hash_class , pub ksi : [ :: std :: os :: raw :: c_uchar ; 64usize ] , pub kso : [ :: std :: os :: raw :: c_uchar ; 64usize ] , } # [ test ] fn bindgen_test_layout_br_hmac_key_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_hmac_key_context > ( ) , 136usize , concat ! ( "Size of: " , stringify ! ( br_hmac_key_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_hmac_key_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_hmac_key_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_key_context > ( ) ) ) . dig_vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_key_context ) , "::" , stringify ! ( dig_vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_key_context > ( ) ) ) . ksi as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_key_context ) , "::" , stringify ! ( ksi ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_key_context > ( ) ) ) . kso as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_key_context ) , "::" , stringify ! ( kso ) ) ) ; } extern "C" {
 
 /// \brief HMAC key context initialisation.
///
/// Initialise the key context with the provided key, using the hash function
/// identified by `digest_vtable`. This supports arbitrary key lengths.
///
/// \param kc              HMAC key context to initialise.
/// \param digest_vtable   pointer to the hash function implementation vtable.
/// \param key             pointer to the HMAC secret key.
/// \param key_len         HMAC secret key length (in bytes). 
 
 pub fn br_hmac_key_init ( kc : * mut br_hmac_key_context , digest_vtable : * const br_hash_class , key : * const :: std :: os :: raw :: c_void , key_len : usize , ) ; 
} 
 /// \brief HMAC computation context.
///
/// The HMAC computation context maintains the state for a single HMAC
/// computation. It is modified as input bytes are injected. The context
/// is caller-allocated and has no release function since it does not
/// dynamically allocate external resources. Its contents are opaque. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_hmac_context { pub dig : br_hash_compat_context , pub kso : [ :: std :: os :: raw :: c_uchar ; 64usize ] , pub out_len : usize , } # [ test ] fn bindgen_test_layout_br_hmac_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_hmac_context > ( ) , 280usize , concat ! ( "Size of: " , stringify ! ( br_hmac_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_hmac_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_hmac_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_context > ( ) ) ) . dig as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_context ) , "::" , stringify ! ( dig ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_context > ( ) ) ) . kso as * const _ as usize } , 208usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_context ) , "::" , stringify ! ( kso ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_context > ( ) ) ) . out_len as * const _ as usize } , 272usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_context ) , "::" , stringify ! ( out_len ) ) ) ; } extern "C" {
 
 /// \brief HMAC computation initialisation.
///
/// Initialise a HMAC context with a key context. The key context is
/// unmodified. Relevant data from the key context is immediately copied;
/// the key context can thus be independently reused, modified or released
/// without impacting this HMAC computation.
///
/// An explicit output length can be specified; the actual output length
/// will be the minimum of that value and the natural HMAC output length.
/// If `out_len` is 0, then the natural HMAC output length is selected. The
/// "natural output length" is the output length of the underlying hash
/// function.
///
/// \param ctx       HMAC context to initialise.
/// \param kc        HMAC key context (already initialised with the key).
/// \param out_len   HMAC output length (0 to select "natural length"). 
 
 pub fn br_hmac_init ( ctx : * mut br_hmac_context , kc : * const br_hmac_key_context , out_len : usize , ) ; 
} extern "C" {
 
 /// \brief Inject some bytes in HMAC.
///
/// The provided `len` bytes are injected as extra input in the HMAC
/// computation incarnated by the `ctx` HMAC context. It is acceptable
/// that `len` is zero, in which case `data` is ignored (and may be
/// `NULL`) and this function does nothing. 
 
 pub fn br_hmac_update ( ctx : * mut br_hmac_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute the HMAC output.
///
/// The destination buffer MUST be large enough to accomodate the result;
/// its length is at most the "natural length" of HMAC (i.e. the output
/// length of the underlying hash function). The context is NOT modified;
/// further bytes may be processed. Thus, "partial HMAC" values can be
/// efficiently obtained.
///
/// Returned value is the output length (in bytes).
///
/// \param ctx   HMAC computation context.
/// \param out   destination buffer for the HMAC output.
/// \return  the produced value length (in bytes). 
 
 pub fn br_hmac_out ( ctx : * const br_hmac_context , out : * mut :: std :: os :: raw :: c_void , ) -> usize ; 
} extern "C" {
 
 /// \brief Constant-time HMAC computation.
///
/// This function compute the HMAC output in constant time. Some extra
/// input bytes are processed, then the output is computed. The extra
/// input consists in the `len` bytes pointed to by `data`. The `len`
/// parameter must lie between `min_len` and `max_len` (inclusive);
/// `max_len` bytes are actually read from `data`. Computing time (and
/// memory access pattern) will not depend upon the data byte contents or
/// the value of `len`.
///
/// The output is written in the `out` buffer, that MUST be large enough
/// to receive it.
///
/// The difference `max_len - min_len` MUST be less than 2<sup>30</sup>
/// (i.e. about one gigabyte).
///
/// This function computes the output properly only if the underlying
/// hash function uses MD padding (i.e. MD5, SHA-1, SHA-224, SHA-256,
/// SHA-384 or SHA-512).
///
/// The provided context is NOT modified.
///
/// \param ctx       the (already initialised) HMAC computation context.
/// \param data      the extra input bytes.
/// \param len       the extra input length (in bytes).
/// \param min_len   minimum extra input length (in bytes).
/// \param max_len   maximum extra input length (in bytes).
/// \param out       destination buffer for the HMAC output.
/// \return  the produced value length (in bytes). 
 
 pub fn br_hmac_outCT ( ctx : * const br_hmac_context , data : * const :: std :: os :: raw :: c_void , len : usize , min_len : usize , max_len : usize , out : * mut :: std :: os :: raw :: c_void , ) -> usize ; 
} 
 /// \brief Class type for PRNG implementations.
///
/// A `br_prng_class` instance references the methods implementing a PRNG.
/// Constant instances of this structure are defined for each implemented
/// PRNG. Such instances are also called "vtables". 
 pub type br_prng_class = br_prng_class_ ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_prng_class_ { 
 /// \brief Size (in bytes) of the context structure appropriate for
    /// running this PRNG. 
 pub context_size : usize , 
 /// \brief Initialisation method.
    ///
    /// The context to initialise is provided as a pointer to its
    /// first field (the vtable pointer); this function sets that
    /// first field to a pointer to the vtable.
    ///
    /// The extra parameters depend on the implementation; each
    /// implementation defines what kind of extra parameters it
    /// expects (if any).
    ///
    /// Requirements on the initial seed depend on the implemented
    /// PRNG.
    ///
    /// \param ctx        PRNG context to initialise.
    /// \param params     extra parameters for the PRNG.
    /// \param seed       initial seed.
    /// \param seed_len   initial seed length (in bytes). 
 pub init : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_prng_class , params : * const :: std :: os :: raw :: c_void , seed : * const :: std :: os :: raw :: c_void , seed_len : usize ) > , 
 /// \brief Random bytes generation.
    ///
    /// This method produces `len` pseudorandom bytes, in the `out`
    /// buffer. The context is updated accordingly.
    ///
    /// \param ctx   PRNG context.
    /// \param out   output buffer.
    /// \param len   number of pseudorandom bytes to produce. 
 pub generate : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_prng_class , out : * mut :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Inject additional seed bytes.
    ///
    /// The provided seed bytes are added into the PRNG internal
    /// entropy pool.
    ///
    /// \param ctx        PRNG context.
    /// \param seed       additional seed.
    /// \param seed_len   additional seed length (in bytes). 
 pub update : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_prng_class , seed : * const :: std :: os :: raw :: c_void , seed_len : usize ) > , } # [ test ] fn bindgen_test_layout_br_prng_class_ ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_prng_class_ > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( br_prng_class_ ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_prng_class_ > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_prng_class_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_prng_class_ > ( ) ) ) . context_size as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_prng_class_ ) , "::" , stringify ! ( context_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_prng_class_ > ( ) ) ) . init as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_prng_class_ ) , "::" , stringify ! ( init ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_prng_class_ > ( ) ) ) . generate as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_prng_class_ ) , "::" , stringify ! ( generate ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_prng_class_ > ( ) ) ) . update as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_prng_class_ ) , "::" , stringify ! ( update ) ) ) ; } 
 /// \brief Context for HMAC_DRBG.
///
/// The context contents are opaque, except the first field, which
/// supports OOP. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_hmac_drbg_context { 
 /// \brief Pointer to the vtable.
    ///
    /// This field is set with the initialisation method/function. 
 pub vtable : * const br_prng_class , pub K : [ :: std :: os :: raw :: c_uchar ; 64usize ] , pub V : [ :: std :: os :: raw :: c_uchar ; 64usize ] , pub digest_class : * const br_hash_class , } # [ test ] fn bindgen_test_layout_br_hmac_drbg_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_hmac_drbg_context > ( ) , 144usize , concat ! ( "Size of: " , stringify ! ( br_hmac_drbg_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_hmac_drbg_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_hmac_drbg_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_drbg_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_drbg_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_drbg_context > ( ) ) ) . K as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_drbg_context ) , "::" , stringify ! ( K ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_drbg_context > ( ) ) ) . V as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_drbg_context ) , "::" , stringify ! ( V ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_hmac_drbg_context > ( ) ) ) . digest_class as * const _ as usize } , 136usize , concat ! ( "Offset of field: " , stringify ! ( br_hmac_drbg_context ) , "::" , stringify ! ( digest_class ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_hmac_drbg_vtable" ] 
 pub static mut  br_hmac_drbg_vtable  :  br_prng_class ;
} extern "C" {
 
 /// \brief HMAC_DRBG initialisation.
///
/// The context to initialise is provided as a pointer to its first field
/// (the vtable pointer); this function sets that first field to a
/// pointer to the vtable.
///
/// The `seed` value is what is called, in NIST terminology, the
/// concatenation of the "seed", "nonce" and "personalization string", in
/// that order.
///
/// The `digest_class` parameter defines the underlying hash function.
/// Formally, the NIST standard specifies that the hash function shall
/// be only SHA-1 or one of the SHA-2 functions. This implementation also
/// works with any other implemented hash function (such as MD5), but
/// this is non-standard and therefore not recommended.
///
/// \param ctx            HMAC_DRBG context to initialise.
/// \param digest_class   vtable for the underlying hash function.
/// \param seed           initial seed.
/// \param seed_len       initial seed length (in bytes). 
 
 pub fn br_hmac_drbg_init ( ctx : * mut br_hmac_drbg_context , digest_class : * const br_hash_class , seed : * const :: std :: os :: raw :: c_void , seed_len : usize , ) ; 
} extern "C" {
 
 /// \brief Random bytes generation with HMAC_DRBG.
///
/// This method produces `len` pseudorandom bytes, in the `out`
/// buffer. The context is updated accordingly. Formally, requesting
/// more than 65536 bytes in one request falls out of specification
/// limits (but it won't fail).
///
/// \param ctx   HMAC_DRBG context.
/// \param out   output buffer.
/// \param len   number of pseudorandom bytes to produce. 
 
 pub fn br_hmac_drbg_generate ( ctx : * mut br_hmac_drbg_context , out : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Inject additional seed bytes in HMAC_DRBG.
///
/// The provided seed bytes are added into the HMAC_DRBG internal
/// entropy pool. The process does not _replace_ existing entropy,
/// thus pushing non-random bytes (i.e. bytes which are known to the
/// attackers) does not degrade the overall quality of generated bytes.
///
/// \param ctx        HMAC_DRBG context.
/// \param seed       additional seed.
/// \param seed_len   additional seed length (in bytes). 
 
 pub fn br_hmac_drbg_update ( ctx : * mut br_hmac_drbg_context , seed : * const :: std :: os :: raw :: c_void , seed_len : usize , ) ; 
} 
 /// \brief Type for a provider of entropy seeds.
///
/// A "seeder" is a function that is able to obtain random values from
/// some source and inject them as entropy seed in a PRNG. A seeder
/// shall guarantee that the total entropy of the injected seed is large
/// enough to seed a PRNG for purposes of cryptographic key generation
/// (i.e. at least 128 bits).
///
/// A seeder may report a failure to obtain adequate entropy. Seeders
/// shall endeavour to fix themselves transient errors by trying again;
/// thus, callers may consider reported errors as permanent.
///
/// \param ctx   PRNG context to seed.
/// \return  1 on success, 0 on error. 
 pub type br_prng_seeder = :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_prng_class ) -> :: std :: os :: raw :: c_int > ; extern "C" {
 
 /// \brief Get a seeder backed by the operating system or hardware.
///
/// Get a seeder that feeds on RNG facilities provided by the current
/// operating system or hardware. If no such facility is known, then 0
/// is returned.
///
/// If `name` is not `NULL`, then `*name` is set to a symbolic string
/// that identifies the seeder implemention. If no seeder is returned
/// and `name` is not `NULL`, then `*name` is set to a pointer to the
/// constant string `"none"`.
///
/// \param name   receiver for seeder name, or `NULL`.
/// \return  the system seeder, if available, or 0. 
 
 pub fn br_prng_seeder_system ( name : * mut * const :: std :: os :: raw :: c_char , ) -> br_prng_seeder ; 
} 
 /// \brief Type for a seed chunk.
///
/// Each chunk may have an arbitrary length, and may be empty (no byte at
/// all). If the chunk length is zero, then the pointer to the chunk data
/// may be `NULL`. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_tls_prf_seed_chunk { 
 /// \brief Pointer to the chunk data. 
 pub data : * const :: std :: os :: raw :: c_void , 
 /// \brief Chunk length (in bytes). 
 pub len : usize , } # [ test ] fn bindgen_test_layout_br_tls_prf_seed_chunk ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_tls_prf_seed_chunk > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( br_tls_prf_seed_chunk ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_tls_prf_seed_chunk > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_tls_prf_seed_chunk ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_tls_prf_seed_chunk > ( ) ) ) . data as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_tls_prf_seed_chunk ) , "::" , stringify ! ( data ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_tls_prf_seed_chunk > ( ) ) ) . len as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_tls_prf_seed_chunk ) , "::" , stringify ! ( len ) ) ) ; } extern "C" {
 
 /// \brief PRF implementation for TLS 1.0 and 1.1.
///
/// This PRF is the one specified by TLS 1.0 and 1.1. It internally uses
/// MD5 and SHA-1.
///
/// \param dst          destination buffer.
/// \param len          output length (in bytes).
/// \param secret       secret value (key) for this computation.
/// \param secret_len   length of "secret" (in bytes).
/// \param label        PRF label (zero-terminated ASCII string).
/// \param seed_num     number of seed chunks.
/// \param seed         seed chnks for this computation (usually non-secret). 
 
 pub fn br_tls10_prf ( dst : * mut :: std :: os :: raw :: c_void , len : usize , secret : * const :: std :: os :: raw :: c_void , secret_len : usize , label : * const :: std :: os :: raw :: c_char , seed_num : usize , seed : * const br_tls_prf_seed_chunk , ) ; 
} extern "C" {
 
 /// \brief PRF implementation for TLS 1.2, with SHA-256.
///
/// This PRF is the one specified by TLS 1.2, when the underlying hash
/// function is SHA-256.
///
/// \param dst          destination buffer.
/// \param len          output length (in bytes).
/// \param secret       secret value (key) for this computation.
/// \param secret_len   length of "secret" (in bytes).
/// \param label        PRF label (zero-terminated ASCII string).
/// \param seed_num     number of seed chunks.
/// \param seed         seed chnks for this computation (usually non-secret). 
 
 pub fn br_tls12_sha256_prf ( dst : * mut :: std :: os :: raw :: c_void , len : usize , secret : * const :: std :: os :: raw :: c_void , secret_len : usize , label : * const :: std :: os :: raw :: c_char , seed_num : usize , seed : * const br_tls_prf_seed_chunk , ) ; 
} extern "C" {
 
 /// \brief PRF implementation for TLS 1.2, with SHA-384.
///
/// This PRF is the one specified by TLS 1.2, when the underlying hash
/// function is SHA-384.
///
/// \param dst          destination buffer.
/// \param len          output length (in bytes).
/// \param secret       secret value (key) for this computation.
/// \param secret_len   length of "secret" (in bytes).
/// \param label        PRF label (zero-terminated ASCII string).
/// \param seed_num     number of seed chunks.
/// \param seed         seed chnks for this computation (usually non-secret). 
 
 pub fn br_tls12_sha384_prf ( dst : * mut :: std :: os :: raw :: c_void , len : usize , secret : * const :: std :: os :: raw :: c_void , secret_len : usize , label : * const :: std :: os :: raw :: c_char , seed_num : usize , seed : * const br_tls_prf_seed_chunk , ) ; 
} 
 /// brief A convenient type name for a PRF implementation.
///
/// \param dst          destination buffer.
/// \param len          output length (in bytes).
/// \param secret       secret value (key) for this computation.
/// \param secret_len   length of "secret" (in bytes).
/// \param label        PRF label (zero-terminated ASCII string).
/// \param seed_num     number of seed chunks.
/// \param seed         seed chnks for this computation (usually non-secret). 
 pub type br_tls_prf_impl = :: std :: option :: Option < unsafe extern "C" fn ( dst : * mut :: std :: os :: raw :: c_void , len : usize , secret : * const :: std :: os :: raw :: c_void , secret_len : usize , label : * const :: std :: os :: raw :: c_char , seed_num : usize , seed : * const br_tls_prf_seed_chunk ) > ; 
 /// \brief Class type for CBC encryption implementations.
///
/// A `br_block_cbcenc_class` instance points to the functions implementing
/// a specific block cipher, when used in CBC mode for encrypting data. 
 pub type br_block_cbcenc_class = br_block_cbcenc_class_ ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_block_cbcenc_class_ { 
 /// \brief Size (in bytes) of the context structure appropriate
    /// for containing subkeys. 
 pub context_size : usize , 
 /// \brief Size of individual blocks (in bytes). 
 pub block_size : :: std :: os :: raw :: c_uint , 
 /// \brief Base-2 logarithm of the size of individual blocks,
    /// expressed in bytes. 
 pub log_block_size : :: std :: os :: raw :: c_uint , 
 /// \brief Initialisation function.
    ///
    /// This function sets the `vtable` field in the context structure.
    /// The key length MUST be one of the key lengths supported by
    /// the implementation.
    ///
    /// \param ctx       context structure to initialise.
    /// \param key       secret key.
    /// \param key_len   key length (in bytes). 
 pub init : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_block_cbcenc_class , key : * const :: std :: os :: raw :: c_void , key_len : usize ) > , 
 /// \brief Run the CBC encryption.
    ///
    /// The `iv` parameter points to the IV for this run; it is
    /// updated with a copy of the last encrypted block. The data
    /// is encrypted "in place"; its length (`len`) MUST be a
    /// multiple of the block size.
    ///
    /// \param ctx    context structure (already initialised).
    /// \param iv     IV for CBC encryption (updated).
    /// \param data   data to encrypt.
    /// \param len    data length (in bytes, multiple of block size). 
 pub run : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_block_cbcenc_class , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize ) > , } # [ test ] fn bindgen_test_layout_br_block_cbcenc_class_ ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_block_cbcenc_class_ > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( br_block_cbcenc_class_ ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_block_cbcenc_class_ > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_block_cbcenc_class_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcenc_class_ > ( ) ) ) . context_size as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcenc_class_ ) , "::" , stringify ! ( context_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcenc_class_ > ( ) ) ) . block_size as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcenc_class_ ) , "::" , stringify ! ( block_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcenc_class_ > ( ) ) ) . log_block_size as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcenc_class_ ) , "::" , stringify ! ( log_block_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcenc_class_ > ( ) ) ) . init as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcenc_class_ ) , "::" , stringify ! ( init ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcenc_class_ > ( ) ) ) . run as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcenc_class_ ) , "::" , stringify ! ( run ) ) ) ; } 
 /// \brief Class type for CBC decryption implementations.
///
/// A `br_block_cbcdec_class` instance points to the functions implementing
/// a specific block cipher, when used in CBC mode for decrypting data. 
 pub type br_block_cbcdec_class = br_block_cbcdec_class_ ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_block_cbcdec_class_ { 
 /// \brief Size (in bytes) of the context structure appropriate
    /// for containing subkeys. 
 pub context_size : usize , 
 /// \brief Size of individual blocks (in bytes). 
 pub block_size : :: std :: os :: raw :: c_uint , 
 /// \brief Base-2 logarithm of the size of individual blocks,
    /// expressed in bytes. 
 pub log_block_size : :: std :: os :: raw :: c_uint , 
 /// \brief Initialisation function.
    ///
    /// This function sets the `vtable` field in the context structure.
    /// The key length MUST be one of the key lengths supported by
    /// the implementation.
    ///
    /// \param ctx       context structure to initialise.
    /// \param key       secret key.
    /// \param key_len   key length (in bytes). 
 pub init : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_block_cbcdec_class , key : * const :: std :: os :: raw :: c_void , key_len : usize ) > , 
 /// \brief Run the CBC decryption.
    ///
    /// The `iv` parameter points to the IV for this run; it is
    /// updated with a copy of the last encrypted block. The data
    /// is decrypted "in place"; its length (`len`) MUST be a
    /// multiple of the block size.
    ///
    /// \param ctx    context structure (already initialised).
    /// \param iv     IV for CBC decryption (updated).
    /// \param data   data to decrypt.
    /// \param len    data length (in bytes, multiple of block size). 
 pub run : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_block_cbcdec_class , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize ) > , } # [ test ] fn bindgen_test_layout_br_block_cbcdec_class_ ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_block_cbcdec_class_ > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( br_block_cbcdec_class_ ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_block_cbcdec_class_ > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_block_cbcdec_class_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcdec_class_ > ( ) ) ) . context_size as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcdec_class_ ) , "::" , stringify ! ( context_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcdec_class_ > ( ) ) ) . block_size as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcdec_class_ ) , "::" , stringify ! ( block_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcdec_class_ > ( ) ) ) . log_block_size as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcdec_class_ ) , "::" , stringify ! ( log_block_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcdec_class_ > ( ) ) ) . init as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcdec_class_ ) , "::" , stringify ! ( init ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_cbcdec_class_ > ( ) ) ) . run as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_block_cbcdec_class_ ) , "::" , stringify ! ( run ) ) ) ; } 
 /// \brief Class type for CTR encryption/decryption implementations.
///
/// A `br_block_ctr_class` instance points to the functions implementing
/// a specific block cipher, when used in CTR mode for encrypting or
/// decrypting data. 
 pub type br_block_ctr_class = br_block_ctr_class_ ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_block_ctr_class_ { 
 /// \brief Size (in bytes) of the context structure appropriate
    /// for containing subkeys. 
 pub context_size : usize , 
 /// \brief Size of individual blocks (in bytes). 
 pub block_size : :: std :: os :: raw :: c_uint , 
 /// \brief Base-2 logarithm of the size of individual blocks,
    /// expressed in bytes. 
 pub log_block_size : :: std :: os :: raw :: c_uint , 
 /// \brief Initialisation function.
    ///
    /// This function sets the `vtable` field in the context structure.
    /// The key length MUST be one of the key lengths supported by
    /// the implementation.
    ///
    /// \param ctx       context structure to initialise.
    /// \param key       secret key.
    /// \param key_len   key length (in bytes). 
 pub init : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_block_ctr_class , key : * const :: std :: os :: raw :: c_void , key_len : usize ) > , 
 /// \brief Run the CTR encryption or decryption.
    ///
    /// The `iv` parameter points to the IV for this run; its
    /// length is exactly 4 bytes less than the block size (e.g.
    /// 12 bytes for AES/CTR). The IV is combined with a 32-bit
    /// block counter to produce the block value which is processed
    /// with the block cipher.
    ///
    /// The data to encrypt or decrypt is updated "in place". Its
    /// length (`len` bytes) is not required to be a multiple of
    /// the block size; if the final block is partial, then the
    /// corresponding key stream bits are dropped.
    ///
    /// The resulting counter value is returned.
    ///
    /// \param ctx    context structure (already initialised).
    /// \param iv     IV for CTR encryption/decryption.
    /// \param cc     initial value for the block counter.
    /// \param data   data to encrypt or decrypt.
    /// \param len    data length (in bytes).
    /// \return  the new block counter value. 
 pub run : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_block_ctr_class , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize ) -> u32 > , } # [ test ] fn bindgen_test_layout_br_block_ctr_class_ ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_block_ctr_class_ > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( br_block_ctr_class_ ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_block_ctr_class_ > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_block_ctr_class_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctr_class_ > ( ) ) ) . context_size as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctr_class_ ) , "::" , stringify ! ( context_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctr_class_ > ( ) ) ) . block_size as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctr_class_ ) , "::" , stringify ! ( block_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctr_class_ > ( ) ) ) . log_block_size as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctr_class_ ) , "::" , stringify ! ( log_block_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctr_class_ > ( ) ) ) . init as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctr_class_ ) , "::" , stringify ! ( init ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctr_class_ > ( ) ) ) . run as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctr_class_ ) , "::" , stringify ! ( run ) ) ) ; } 
 /// \brief Class type for combined CTR and CBC-MAC implementations.
///
/// A `br_block_ctrcbc_class` instance points to the functions implementing
/// a specific block cipher, when used in CTR mode for encrypting or
/// decrypting data, along with CBC-MAC. 
 pub type br_block_ctrcbc_class = br_block_ctrcbc_class_ ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_block_ctrcbc_class_ { 
 /// \brief Size (in bytes) of the context structure appropriate
    /// for containing subkeys. 
 pub context_size : usize , 
 /// \brief Size of individual blocks (in bytes). 
 pub block_size : :: std :: os :: raw :: c_uint , 
 /// \brief Base-2 logarithm of the size of individual blocks,
    /// expressed in bytes. 
 pub log_block_size : :: std :: os :: raw :: c_uint , 
 /// \brief Initialisation function.
    ///
    /// This function sets the `vtable` field in the context structure.
    /// The key length MUST be one of the key lengths supported by
    /// the implementation.
    ///
    /// \param ctx       context structure to initialise.
    /// \param key       secret key.
    /// \param key_len   key length (in bytes). 
 pub init : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * mut * const br_block_ctrcbc_class , key : * const :: std :: os :: raw :: c_void , key_len : usize ) > , 
 /// \brief Run the CTR encryption + CBC-MAC.
    ///
    /// The `ctr` parameter points to the counter; its length shall
    /// be equal to the block size. It is updated by this function
    /// as encryption proceeds.
    ///
    /// The `cbcmac` parameter points to the IV for CBC-MAC. The MAC
    /// is computed over the encrypted data (output of CTR
    /// encryption). Its length shall be equal to the block size. The
    /// computed CBC-MAC value is written over the `cbcmac` array.
    ///
    /// The data to encrypt is updated "in place". Its length (`len`
    /// bytes) MUST be a multiple of the block size.
    ///
    /// \param ctx      context structure (already initialised).
    /// \param ctr      counter for CTR encryption (initial and final).
    /// \param cbcmac   IV and output buffer for CBC-MAC.
    /// \param data     data to encrypt.
    /// \param len      data length (in bytes). 
 pub encrypt : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_block_ctrcbc_class , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Run the CTR decryption + CBC-MAC.
    ///
    /// The `ctr` parameter points to the counter; its length shall
    /// be equal to the block size. It is updated by this function
    /// as decryption proceeds.
    ///
    /// The `cbcmac` parameter points to the IV for CBC-MAC. The MAC
    /// is computed over the encrypted data (i.e. before CTR
    /// decryption). Its length shall be equal to the block size. The
    /// computed CBC-MAC value is written over the `cbcmac` array.
    ///
    /// The data to decrypt is updated "in place". Its length (`len`
    /// bytes) MUST be a multiple of the block size.
    ///
    /// \param ctx      context structure (already initialised).
    /// \param ctr      counter for CTR encryption (initial and final).
    /// \param cbcmac   IV and output buffer for CBC-MAC.
    /// \param data     data to decrypt.
    /// \param len      data length (in bytes). 
 pub decrypt : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_block_ctrcbc_class , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Run the CTR encryption/decryption only.
    ///
    /// The `ctr` parameter points to the counter; its length shall
    /// be equal to the block size. It is updated by this function
    /// as decryption proceeds.
    ///
    /// The data to decrypt is updated "in place". Its length (`len`
    /// bytes) MUST be a multiple of the block size.
    ///
    /// \param ctx      context structure (already initialised).
    /// \param ctr      counter for CTR encryption (initial and final).
    /// \param data     data to decrypt.
    /// \param len      data length (in bytes). 
 pub ctr : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_block_ctrcbc_class , ctr : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Run the CBC-MAC only.
    ///
    /// The `cbcmac` parameter points to the IV for CBC-MAC. The MAC
    /// is computed over the encrypted data (i.e. before CTR
    /// decryption). Its length shall be equal to the block size. The
    /// computed CBC-MAC value is written over the `cbcmac` array.
    ///
    /// The data is unmodified. Its length (`len` bytes) MUST be a
    /// multiple of the block size.
    ///
    /// \param ctx      context structure (already initialised).
    /// \param cbcmac   IV and output buffer for CBC-MAC.
    /// \param data     data to decrypt.
    /// \param len      data length (in bytes). 
 pub mac : :: std :: option :: Option < unsafe extern "C" fn ( ctx : * const * const br_block_ctrcbc_class , cbcmac : * mut :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize ) > , } # [ test ] fn bindgen_test_layout_br_block_ctrcbc_class_ ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_block_ctrcbc_class_ > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( br_block_ctrcbc_class_ ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_block_ctrcbc_class_ > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_block_ctrcbc_class_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctrcbc_class_ > ( ) ) ) . context_size as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctrcbc_class_ ) , "::" , stringify ! ( context_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctrcbc_class_ > ( ) ) ) . block_size as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctrcbc_class_ ) , "::" , stringify ! ( block_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctrcbc_class_ > ( ) ) ) . log_block_size as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctrcbc_class_ ) , "::" , stringify ! ( log_block_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctrcbc_class_ > ( ) ) ) . init as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctrcbc_class_ ) , "::" , stringify ! ( init ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctrcbc_class_ > ( ) ) ) . encrypt as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctrcbc_class_ ) , "::" , stringify ! ( encrypt ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctrcbc_class_ > ( ) ) ) . decrypt as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctrcbc_class_ ) , "::" , stringify ! ( decrypt ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctrcbc_class_ > ( ) ) ) . ctr as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctrcbc_class_ ) , "::" , stringify ! ( ctr ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_block_ctrcbc_class_ > ( ) ) ) . mac as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( br_block_ctrcbc_class_ ) , "::" , stringify ! ( mac ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_big` implementation, CBC encryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_big_cbcenc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcenc_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_big_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_big_cbcenc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_big_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_big_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_big_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_cbcenc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_cbcenc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_cbcenc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_cbcenc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_big` implementation, CBC decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_big_cbcdec_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcdec_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_big_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_big_cbcdec_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_big_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_big_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_big_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_cbcdec_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_cbcdec_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_cbcdec_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_cbcdec_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_big` implementation, CTR encryption
/// and decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_big_ctr_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctr_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_big_ctr_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_big_ctr_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_big_ctr_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_big_ctr_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_big_ctr_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_ctr_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_ctr_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_ctr_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_ctr_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_ctr_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_ctr_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_big` implementation, CTR encryption
/// and decryption + CBC-MAC).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_big_ctrcbc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctrcbc_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_big_ctrcbc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_big_ctrcbc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_big_ctrcbc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_big_ctrcbc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_big_ctrcbc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_ctrcbc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_ctrcbc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_ctrcbc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_ctrcbc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_big_ctrcbc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_big_ctrcbc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_aes_big_cbcenc_vtable" ] 
 pub static mut  br_aes_big_cbcenc_vtable  :  br_block_cbcenc_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_big_cbcdec_vtable" ] 
 pub static mut  br_aes_big_cbcdec_vtable  :  br_block_cbcdec_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_big_ctr_vtable" ] 
 pub static mut  br_aes_big_ctr_vtable  :  br_block_ctr_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_big_ctrcbc_vtable" ] 
 pub static mut  br_aes_big_ctrcbc_vtable  :  br_block_ctrcbc_class ;
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC encryption
/// (`aes_big` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_big_cbcenc_init ( ctx : * mut br_aes_big_cbcenc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC decryption
/// (`aes_big` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_big_cbcdec_init ( ctx : * mut br_aes_big_cbcdec_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR encryption
/// and decryption (`aes_big` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_big_ctr_init ( ctx : * mut br_aes_big_ctr_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR + CBC-MAC
/// (`aes_big` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_big_ctrcbc_init ( ctx : * mut br_aes_big_ctrcbc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC encryption with AES (`aes_big` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to encrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_big_cbcenc_run ( ctx : * const br_aes_big_cbcenc_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC decryption with AES (`aes_big` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_big_cbcdec_run ( ctx : * const br_aes_big_cbcdec_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption and decryption with AES (`aes_big` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (constant, 12 bytes).
/// \param cc     initial block counter value.
/// \param data   data to encrypt or decrypt (updated).
/// \param len    data length (in bytes).
/// \return  new block counter value. 
 
 pub fn br_aes_big_ctr_run ( ctx : * const br_aes_big_ctr_keys , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 
 /// \brief CTR encryption + CBC-MAC with AES (`aes_big` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to encrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_big_ctrcbc_encrypt ( ctx : * const br_aes_big_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR decryption + CBC-MAC with AES (`aes_big` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to decrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_big_ctrcbc_decrypt ( ctx : * const br_aes_big_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption/decryption with AES (`aes_big` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param data     data to MAC (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_big_ctrcbc_ctr ( ctx : * const br_aes_big_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC-MAC with AES (`aes_big` implementation).
///
/// \param ctx      context (already initialised).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to MAC (unmodified).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_big_ctrcbc_mac ( ctx : * const br_aes_big_ctrcbc_keys , cbcmac : * mut :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} 
 /// \brief Context for AES subkeys (`aes_small` implementation, CBC encryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_small_cbcenc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcenc_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_small_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_small_cbcenc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_small_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_small_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_small_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_cbcenc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_cbcenc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_cbcenc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_cbcenc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_small` implementation, CBC decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_small_cbcdec_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcdec_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_small_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_small_cbcdec_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_small_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_small_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_small_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_cbcdec_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_cbcdec_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_cbcdec_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_cbcdec_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_small` implementation, CTR encryption
/// and decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_small_ctr_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctr_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_small_ctr_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_small_ctr_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_small_ctr_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_small_ctr_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_small_ctr_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_ctr_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_ctr_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_ctr_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_ctr_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_ctr_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_ctr_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_small` implementation, CTR encryption
/// and decryption + CBC-MAC).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_small_ctrcbc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctrcbc_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_small_ctrcbc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_small_ctrcbc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_small_ctrcbc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_small_ctrcbc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_small_ctrcbc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_ctrcbc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_ctrcbc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_ctrcbc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_ctrcbc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_small_ctrcbc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_small_ctrcbc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_aes_small_cbcenc_vtable" ] 
 pub static mut  br_aes_small_cbcenc_vtable  :  br_block_cbcenc_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_small_cbcdec_vtable" ] 
 pub static mut  br_aes_small_cbcdec_vtable  :  br_block_cbcdec_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_small_ctr_vtable" ] 
 pub static mut  br_aes_small_ctr_vtable  :  br_block_ctr_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_small_ctrcbc_vtable" ] 
 pub static mut  br_aes_small_ctrcbc_vtable  :  br_block_ctrcbc_class ;
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC encryption
/// (`aes_small` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_small_cbcenc_init ( ctx : * mut br_aes_small_cbcenc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC decryption
/// (`aes_small` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_small_cbcdec_init ( ctx : * mut br_aes_small_cbcdec_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR encryption
/// and decryption (`aes_small` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_small_ctr_init ( ctx : * mut br_aes_small_ctr_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR + CBC-MAC
/// (`aes_small` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_small_ctrcbc_init ( ctx : * mut br_aes_small_ctrcbc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC encryption with AES (`aes_small` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to encrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_small_cbcenc_run ( ctx : * const br_aes_small_cbcenc_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC decryption with AES (`aes_small` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_small_cbcdec_run ( ctx : * const br_aes_small_cbcdec_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption and decryption with AES (`aes_small` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (constant, 12 bytes).
/// \param cc     initial block counter value.
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes).
/// \return  new block counter value. 
 
 pub fn br_aes_small_ctr_run ( ctx : * const br_aes_small_ctr_keys , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 
 /// \brief CTR encryption + CBC-MAC with AES (`aes_small` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to encrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_small_ctrcbc_encrypt ( ctx : * const br_aes_small_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR decryption + CBC-MAC with AES (`aes_small` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to decrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_small_ctrcbc_decrypt ( ctx : * const br_aes_small_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption/decryption with AES (`aes_small` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param data     data to MAC (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_small_ctrcbc_ctr ( ctx : * const br_aes_small_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC-MAC with AES (`aes_small` implementation).
///
/// \param ctx      context (already initialised).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to MAC (unmodified).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_small_ctrcbc_mac ( ctx : * const br_aes_small_ctrcbc_keys , cbcmac : * mut :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} 
 /// \brief Context for AES subkeys (`aes_ct` implementation, CBC encryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_ct_cbcenc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcenc_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_ct_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_ct_cbcenc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_ct_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_ct_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_ct_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_cbcenc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_cbcenc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_cbcenc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_cbcenc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_ct` implementation, CBC decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_ct_cbcdec_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcdec_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_ct_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_ct_cbcdec_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_ct_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_ct_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_ct_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_cbcdec_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_cbcdec_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_cbcdec_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_cbcdec_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_ct` implementation, CTR encryption
/// and decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_ct_ctr_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctr_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_ct_ctr_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_ct_ctr_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_ct_ctr_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_ct_ctr_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_ct_ctr_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_ctr_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_ctr_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_ctr_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_ctr_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_ctr_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_ctr_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_ct` implementation, CTR encryption
/// and decryption + CBC-MAC).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_ct_ctrcbc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctrcbc_class , pub skey : [ u32 ; 60usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_ct_ctrcbc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_ct_ctrcbc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_ct_ctrcbc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_ct_ctrcbc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_ct_ctrcbc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_ctrcbc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_ctrcbc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_ctrcbc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_ctrcbc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct_ctrcbc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct_ctrcbc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_aes_ct_cbcenc_vtable" ] 
 pub static mut  br_aes_ct_cbcenc_vtable  :  br_block_cbcenc_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_ct_cbcdec_vtable" ] 
 pub static mut  br_aes_ct_cbcdec_vtable  :  br_block_cbcdec_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_ct_ctr_vtable" ] 
 pub static mut  br_aes_ct_ctr_vtable  :  br_block_ctr_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_ct_ctrcbc_vtable" ] 
 pub static mut  br_aes_ct_ctrcbc_vtable  :  br_block_ctrcbc_class ;
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC encryption
/// (`aes_ct` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_ct_cbcenc_init ( ctx : * mut br_aes_ct_cbcenc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC decryption
/// (`aes_ct` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_ct_cbcdec_init ( ctx : * mut br_aes_ct_cbcdec_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR encryption
/// and decryption (`aes_ct` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_ct_ctr_init ( ctx : * mut br_aes_ct_ctr_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR + CBC-MAC
/// (`aes_ct` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_ct_ctrcbc_init ( ctx : * mut br_aes_ct_ctrcbc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC encryption with AES (`aes_ct` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to encrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_ct_cbcenc_run ( ctx : * const br_aes_ct_cbcenc_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC decryption with AES (`aes_ct` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_ct_cbcdec_run ( ctx : * const br_aes_ct_cbcdec_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption and decryption with AES (`aes_ct` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (constant, 12 bytes).
/// \param cc     initial block counter value.
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes).
/// \return  new block counter value. 
 
 pub fn br_aes_ct_ctr_run ( ctx : * const br_aes_ct_ctr_keys , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 
 /// \brief CTR encryption + CBC-MAC with AES (`aes_ct` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to encrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_ct_ctrcbc_encrypt ( ctx : * const br_aes_ct_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR decryption + CBC-MAC with AES (`aes_ct` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to decrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_ct_ctrcbc_decrypt ( ctx : * const br_aes_ct_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption/decryption with AES (`aes_ct` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param data     data to MAC (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_ct_ctrcbc_ctr ( ctx : * const br_aes_ct_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC-MAC with AES (`aes_ct` implementation).
///
/// \param ctx      context (already initialised).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to MAC (unmodified).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_ct_ctrcbc_mac ( ctx : * const br_aes_ct_ctrcbc_keys , cbcmac : * mut :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} 
 /// \brief Context for AES subkeys (`aes_ct64` implementation, CBC encryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_aes_ct64_cbcenc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcenc_class , pub skey : [ u64 ; 30usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_ct64_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_ct64_cbcenc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_ct64_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_ct64_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_ct64_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_cbcenc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_cbcenc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_cbcenc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_cbcenc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_ct64` implementation, CBC decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_aes_ct64_cbcdec_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcdec_class , pub skey : [ u64 ; 30usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_ct64_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_ct64_cbcdec_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_ct64_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_ct64_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_ct64_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_cbcdec_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_cbcdec_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_cbcdec_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_cbcdec_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_ct64` implementation, CTR encryption
/// and decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_aes_ct64_ctr_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctr_class , pub skey : [ u64 ; 30usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_ct64_ctr_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_ct64_ctr_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_ct64_ctr_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_ct64_ctr_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_ct64_ctr_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_ctr_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_ctr_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_ctr_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_ctr_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_ctr_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_ctr_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_ct64` implementation, CTR encryption
/// and decryption + CBC-MAC).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_aes_ct64_ctrcbc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctrcbc_class , pub skey : [ u64 ; 30usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_aes_ct64_ctrcbc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_ct64_ctrcbc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_ct64_ctrcbc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_ct64_ctrcbc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_ct64_ctrcbc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_ctrcbc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_ctrcbc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_ctrcbc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_ctrcbc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_ct64_ctrcbc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_ct64_ctrcbc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_aes_ct64_cbcenc_vtable" ] 
 pub static mut  br_aes_ct64_cbcenc_vtable  :  br_block_cbcenc_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_ct64_cbcdec_vtable" ] 
 pub static mut  br_aes_ct64_cbcdec_vtable  :  br_block_cbcdec_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_ct64_ctr_vtable" ] 
 pub static mut  br_aes_ct64_ctr_vtable  :  br_block_ctr_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_ct64_ctrcbc_vtable" ] 
 pub static mut  br_aes_ct64_ctrcbc_vtable  :  br_block_ctrcbc_class ;
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC encryption
/// (`aes_ct64` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_ct64_cbcenc_init ( ctx : * mut br_aes_ct64_cbcenc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC decryption
/// (`aes_ct64` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_ct64_cbcdec_init ( ctx : * mut br_aes_ct64_cbcdec_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR encryption
/// and decryption (`aes_ct64` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_ct64_ctr_init ( ctx : * mut br_aes_ct64_ctr_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR + CBC-MAC
/// (`aes_ct64` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_ct64_ctrcbc_init ( ctx : * mut br_aes_ct64_ctrcbc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC encryption with AES (`aes_ct64` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to encrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_ct64_cbcenc_run ( ctx : * const br_aes_ct64_cbcenc_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC decryption with AES (`aes_ct64` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_ct64_cbcdec_run ( ctx : * const br_aes_ct64_cbcdec_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption and decryption with AES (`aes_ct64` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (constant, 12 bytes).
/// \param cc     initial block counter value.
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes).
/// \return  new block counter value. 
 
 pub fn br_aes_ct64_ctr_run ( ctx : * const br_aes_ct64_ctr_keys , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 
 /// \brief CTR encryption + CBC-MAC with AES (`aes_ct64` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to encrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_ct64_ctrcbc_encrypt ( ctx : * const br_aes_ct64_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR decryption + CBC-MAC with AES (`aes_ct64` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to decrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_ct64_ctrcbc_decrypt ( ctx : * const br_aes_ct64_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption/decryption with AES (`aes_ct64` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param data     data to MAC (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_ct64_ctrcbc_ctr ( ctx : * const br_aes_ct64_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC-MAC with AES (`aes_ct64` implementation).
///
/// \param ctx      context (already initialised).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to MAC (unmodified).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_ct64_ctrcbc_mac ( ctx : * const br_aes_ct64_ctrcbc_keys , cbcmac : * mut :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} 
 /// \brief Context for AES subkeys (`aes_x86ni` implementation, CBC encryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_x86ni_cbcenc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcenc_class , pub skey : br_aes_x86ni_cbcenc_keys__bindgen_ty_1 , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_x86ni_cbcenc_keys__bindgen_ty_1 { pub skni : [ :: std :: os :: raw :: c_uchar ; 240usize ] , _bindgen_union_align : [ u8 ; 240usize ] , } # [ test ] fn bindgen_test_layout_br_aes_x86ni_cbcenc_keys__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_x86ni_cbcenc_keys__bindgen_ty_1 > ( ) , 240usize , concat ! ( "Size of: " , stringify ! ( br_aes_x86ni_cbcenc_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_x86ni_cbcenc_keys__bindgen_ty_1 > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( br_aes_x86ni_cbcenc_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_cbcenc_keys__bindgen_ty_1 > ( ) ) ) . skni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_cbcenc_keys__bindgen_ty_1 ) , "::" , stringify ! ( skni ) ) ) ; } # [ test ] fn bindgen_test_layout_br_aes_x86ni_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_x86ni_cbcenc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_x86ni_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_x86ni_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_x86ni_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_cbcenc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_cbcenc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_cbcenc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_cbcenc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_x86ni` implementation, CBC decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_x86ni_cbcdec_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcdec_class , pub skey : br_aes_x86ni_cbcdec_keys__bindgen_ty_1 , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_x86ni_cbcdec_keys__bindgen_ty_1 { pub skni : [ :: std :: os :: raw :: c_uchar ; 240usize ] , _bindgen_union_align : [ u8 ; 240usize ] , } # [ test ] fn bindgen_test_layout_br_aes_x86ni_cbcdec_keys__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_x86ni_cbcdec_keys__bindgen_ty_1 > ( ) , 240usize , concat ! ( "Size of: " , stringify ! ( br_aes_x86ni_cbcdec_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_x86ni_cbcdec_keys__bindgen_ty_1 > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( br_aes_x86ni_cbcdec_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_cbcdec_keys__bindgen_ty_1 > ( ) ) ) . skni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_cbcdec_keys__bindgen_ty_1 ) , "::" , stringify ! ( skni ) ) ) ; } # [ test ] fn bindgen_test_layout_br_aes_x86ni_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_x86ni_cbcdec_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_x86ni_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_x86ni_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_x86ni_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_cbcdec_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_cbcdec_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_cbcdec_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_cbcdec_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_x86ni` implementation, CTR encryption
/// and decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_x86ni_ctr_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctr_class , pub skey : br_aes_x86ni_ctr_keys__bindgen_ty_1 , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_x86ni_ctr_keys__bindgen_ty_1 { pub skni : [ :: std :: os :: raw :: c_uchar ; 240usize ] , _bindgen_union_align : [ u8 ; 240usize ] , } # [ test ] fn bindgen_test_layout_br_aes_x86ni_ctr_keys__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_x86ni_ctr_keys__bindgen_ty_1 > ( ) , 240usize , concat ! ( "Size of: " , stringify ! ( br_aes_x86ni_ctr_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_x86ni_ctr_keys__bindgen_ty_1 > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( br_aes_x86ni_ctr_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_ctr_keys__bindgen_ty_1 > ( ) ) ) . skni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_ctr_keys__bindgen_ty_1 ) , "::" , stringify ! ( skni ) ) ) ; } # [ test ] fn bindgen_test_layout_br_aes_x86ni_ctr_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_x86ni_ctr_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_x86ni_ctr_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_x86ni_ctr_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_x86ni_ctr_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_ctr_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_ctr_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_ctr_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_ctr_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_ctr_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_ctr_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_x86ni` implementation, CTR encryption
/// and decryption + CBC-MAC).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_x86ni_ctrcbc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctrcbc_class , pub skey : br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 { pub skni : [ :: std :: os :: raw :: c_uchar ; 240usize ] , _bindgen_union_align : [ u8 ; 240usize ] , } # [ test ] fn bindgen_test_layout_br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 > ( ) , 240usize , concat ! ( "Size of: " , stringify ! ( br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 > ( ) ) ) . skni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_ctrcbc_keys__bindgen_ty_1 ) , "::" , stringify ! ( skni ) ) ) ; } # [ test ] fn bindgen_test_layout_br_aes_x86ni_ctrcbc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_x86ni_ctrcbc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_x86ni_ctrcbc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_x86ni_ctrcbc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_x86ni_ctrcbc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_ctrcbc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_ctrcbc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_ctrcbc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_ctrcbc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_x86ni_ctrcbc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_x86ni_ctrcbc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_aes_x86ni_cbcenc_vtable" ] 
 pub static mut  br_aes_x86ni_cbcenc_vtable  :  br_block_cbcenc_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_x86ni_cbcdec_vtable" ] 
 pub static mut  br_aes_x86ni_cbcdec_vtable  :  br_block_cbcdec_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_x86ni_ctr_vtable" ] 
 pub static mut  br_aes_x86ni_ctr_vtable  :  br_block_ctr_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_x86ni_ctrcbc_vtable" ] 
 pub static mut  br_aes_x86ni_ctrcbc_vtable  :  br_block_ctrcbc_class ;
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC encryption
/// (`aes_x86ni` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_x86ni_cbcenc_init ( ctx : * mut br_aes_x86ni_cbcenc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC decryption
/// (`aes_x86ni` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_x86ni_cbcdec_init ( ctx : * mut br_aes_x86ni_cbcdec_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR encryption
/// and decryption (`aes_x86ni` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_x86ni_ctr_init ( ctx : * mut br_aes_x86ni_ctr_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR + CBC-MAC
/// (`aes_x86ni` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_x86ni_ctrcbc_init ( ctx : * mut br_aes_x86ni_ctrcbc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC encryption with AES (`aes_x86ni` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to encrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_x86ni_cbcenc_run ( ctx : * const br_aes_x86ni_cbcenc_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC decryption with AES (`aes_x86ni` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_x86ni_cbcdec_run ( ctx : * const br_aes_x86ni_cbcdec_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption and decryption with AES (`aes_x86ni` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (constant, 12 bytes).
/// \param cc     initial block counter value.
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes).
/// \return  new block counter value. 
 
 pub fn br_aes_x86ni_ctr_run ( ctx : * const br_aes_x86ni_ctr_keys , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 
 /// \brief CTR encryption + CBC-MAC with AES (`aes_x86ni` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to encrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_x86ni_ctrcbc_encrypt ( ctx : * const br_aes_x86ni_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR decryption + CBC-MAC with AES (`aes_x86ni` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to decrypt (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_x86ni_ctrcbc_decrypt ( ctx : * const br_aes_x86ni_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , cbcmac : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption/decryption with AES (`aes_x86ni` implementation).
///
/// \param ctx      context (already initialised).
/// \param ctr      counter for CTR (16 bytes, updated).
/// \param data     data to MAC (updated).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_x86ni_ctrcbc_ctr ( ctx : * const br_aes_x86ni_ctrcbc_keys , ctr : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC-MAC with AES (`aes_x86ni` implementation).
///
/// \param ctx      context (already initialised).
/// \param cbcmac   IV for CBC-MAC (updated).
/// \param data     data to MAC (unmodified).
/// \param len      data length (in bytes, MUST be a multiple of 16). 
 
 pub fn br_aes_x86ni_ctrcbc_mac ( ctx : * const br_aes_x86ni_ctrcbc_keys , cbcmac : * mut :: std :: os :: raw :: c_void , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Obtain the `aes_x86ni` AES-CBC (encryption) implementation, if
/// available.
///
/// This function returns a pointer to `br_aes_x86ni_cbcenc_vtable`, if
/// that implementation was compiled in the library _and_ the x86 AES
/// opcodes are available on the currently running CPU. If either of
/// these conditions is not met, then this function returns `NULL`.
///
/// \return  the `aes_x86ni` AES-CBC (encryption) implementation, or `NULL`. 
 
 pub fn br_aes_x86ni_cbcenc_get_vtable ( ) -> * const br_block_cbcenc_class ; 
} extern "C" {
 
 /// \brief Obtain the `aes_x86ni` AES-CBC (decryption) implementation, if
/// available.
///
/// This function returns a pointer to `br_aes_x86ni_cbcdec_vtable`, if
/// that implementation was compiled in the library _and_ the x86 AES
/// opcodes are available on the currently running CPU. If either of
/// these conditions is not met, then this function returns `NULL`.
///
/// \return  the `aes_x86ni` AES-CBC (decryption) implementation, or `NULL`. 
 
 pub fn br_aes_x86ni_cbcdec_get_vtable ( ) -> * const br_block_cbcdec_class ; 
} extern "C" {
 
 /// \brief Obtain the `aes_x86ni` AES-CTR implementation, if available.
///
/// This function returns a pointer to `br_aes_x86ni_ctr_vtable`, if
/// that implementation was compiled in the library _and_ the x86 AES
/// opcodes are available on the currently running CPU. If either of
/// these conditions is not met, then this function returns `NULL`.
///
/// \return  the `aes_x86ni` AES-CTR implementation, or `NULL`. 
 
 pub fn br_aes_x86ni_ctr_get_vtable ( ) -> * const br_block_ctr_class ; 
} extern "C" {
 
 /// \brief Obtain the `aes_x86ni` AES-CTR + CBC-MAC implementation, if
/// available.
///
/// This function returns a pointer to `br_aes_x86ni_ctrcbc_vtable`, if
/// that implementation was compiled in the library _and_ the x86 AES
/// opcodes are available on the currently running CPU. If either of
/// these conditions is not met, then this function returns `NULL`.
///
/// \return  the `aes_x86ni` AES-CTR implementation, or `NULL`. 
 
 pub fn br_aes_x86ni_ctrcbc_get_vtable ( ) -> * const br_block_ctrcbc_class ; 
} 
 /// \brief Context for AES subkeys (`aes_pwr8` implementation, CBC encryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_pwr8_cbcenc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcenc_class , pub skey : br_aes_pwr8_cbcenc_keys__bindgen_ty_1 , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_pwr8_cbcenc_keys__bindgen_ty_1 { pub skni : [ :: std :: os :: raw :: c_uchar ; 240usize ] , _bindgen_union_align : [ u8 ; 240usize ] , } # [ test ] fn bindgen_test_layout_br_aes_pwr8_cbcenc_keys__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_pwr8_cbcenc_keys__bindgen_ty_1 > ( ) , 240usize , concat ! ( "Size of: " , stringify ! ( br_aes_pwr8_cbcenc_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_pwr8_cbcenc_keys__bindgen_ty_1 > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( br_aes_pwr8_cbcenc_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_cbcenc_keys__bindgen_ty_1 > ( ) ) ) . skni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_cbcenc_keys__bindgen_ty_1 ) , "::" , stringify ! ( skni ) ) ) ; } # [ test ] fn bindgen_test_layout_br_aes_pwr8_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_pwr8_cbcenc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_pwr8_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_pwr8_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_pwr8_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_cbcenc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_cbcenc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_cbcenc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_cbcenc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_pwr8` implementation, CBC decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_pwr8_cbcdec_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcdec_class , pub skey : br_aes_pwr8_cbcdec_keys__bindgen_ty_1 , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_pwr8_cbcdec_keys__bindgen_ty_1 { pub skni : [ :: std :: os :: raw :: c_uchar ; 240usize ] , _bindgen_union_align : [ u8 ; 240usize ] , } # [ test ] fn bindgen_test_layout_br_aes_pwr8_cbcdec_keys__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_pwr8_cbcdec_keys__bindgen_ty_1 > ( ) , 240usize , concat ! ( "Size of: " , stringify ! ( br_aes_pwr8_cbcdec_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_pwr8_cbcdec_keys__bindgen_ty_1 > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( br_aes_pwr8_cbcdec_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_cbcdec_keys__bindgen_ty_1 > ( ) ) ) . skni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_cbcdec_keys__bindgen_ty_1 ) , "::" , stringify ! ( skni ) ) ) ; } # [ test ] fn bindgen_test_layout_br_aes_pwr8_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_pwr8_cbcdec_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_pwr8_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_pwr8_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_pwr8_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_cbcdec_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_cbcdec_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_cbcdec_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_cbcdec_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for AES subkeys (`aes_pwr8` implementation, CTR encryption
/// and decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_aes_pwr8_ctr_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_ctr_class , pub skey : br_aes_pwr8_ctr_keys__bindgen_ty_1 , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_pwr8_ctr_keys__bindgen_ty_1 { pub skni : [ :: std :: os :: raw :: c_uchar ; 240usize ] , _bindgen_union_align : [ u8 ; 240usize ] , } # [ test ] fn bindgen_test_layout_br_aes_pwr8_ctr_keys__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_pwr8_ctr_keys__bindgen_ty_1 > ( ) , 240usize , concat ! ( "Size of: " , stringify ! ( br_aes_pwr8_ctr_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_pwr8_ctr_keys__bindgen_ty_1 > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( br_aes_pwr8_ctr_keys__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_ctr_keys__bindgen_ty_1 > ( ) ) ) . skni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_ctr_keys__bindgen_ty_1 ) , "::" , stringify ! ( skni ) ) ) ; } # [ test ] fn bindgen_test_layout_br_aes_pwr8_ctr_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_pwr8_ctr_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_pwr8_ctr_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_pwr8_ctr_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_pwr8_ctr_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_ctr_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_ctr_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_ctr_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_ctr_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_pwr8_ctr_keys > ( ) ) ) . num_rounds as * const _ as usize } , 248usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_pwr8_ctr_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_aes_pwr8_cbcenc_vtable" ] 
 pub static mut  br_aes_pwr8_cbcenc_vtable  :  br_block_cbcenc_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_pwr8_cbcdec_vtable" ] 
 pub static mut  br_aes_pwr8_cbcdec_vtable  :  br_block_cbcdec_class ;
} extern "C" {
 # [ link_name = "\u{1}br_aes_pwr8_ctr_vtable" ] 
 pub static mut  br_aes_pwr8_ctr_vtable  :  br_block_ctr_class ;
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC encryption
/// (`aes_pwr8` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_pwr8_cbcenc_init ( ctx : * mut br_aes_pwr8_cbcenc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CBC decryption
/// (`aes_pwr8` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_pwr8_cbcdec_init ( ctx : * mut br_aes_pwr8_cbcdec_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for AES CTR encryption
/// and decryption (`aes_pwr8` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_aes_pwr8_ctr_init ( ctx : * mut br_aes_pwr8_ctr_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC encryption with AES (`aes_pwr8` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to encrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_pwr8_cbcenc_run ( ctx : * const br_aes_pwr8_cbcenc_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC decryption with AES (`aes_pwr8` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 16). 
 
 pub fn br_aes_pwr8_cbcdec_run ( ctx : * const br_aes_pwr8_cbcdec_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CTR encryption and decryption with AES (`aes_pwr8` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (constant, 12 bytes).
/// \param cc     initial block counter value.
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes).
/// \return  new block counter value. 
 
 pub fn br_aes_pwr8_ctr_run ( ctx : * const br_aes_pwr8_ctr_keys , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 
 /// \brief Obtain the `aes_pwr8` AES-CBC (encryption) implementation, if
/// available.
///
/// This function returns a pointer to `br_aes_pwr8_cbcenc_vtable`, if
/// that implementation was compiled in the library _and_ the POWER8
/// crypto opcodes are available on the currently running CPU. If either
/// of these conditions is not met, then this function returns `NULL`.
///
/// \return  the `aes_pwr8` AES-CBC (encryption) implementation, or `NULL`. 
 
 pub fn br_aes_pwr8_cbcenc_get_vtable ( ) -> * const br_block_cbcenc_class ; 
} extern "C" {
 
 /// \brief Obtain the `aes_pwr8` AES-CBC (decryption) implementation, if
/// available.
///
/// This function returns a pointer to `br_aes_pwr8_cbcdec_vtable`, if
/// that implementation was compiled in the library _and_ the POWER8
/// crypto opcodes are available on the currently running CPU. If either
/// of these conditions is not met, then this function returns `NULL`.
///
/// \return  the `aes_pwr8` AES-CBC (decryption) implementation, or `NULL`. 
 
 pub fn br_aes_pwr8_cbcdec_get_vtable ( ) -> * const br_block_cbcdec_class ; 
} extern "C" {
 
 /// \brief Obtain the `aes_pwr8` AES-CTR implementation, if available.
///
/// This function returns a pointer to `br_aes_pwr8_ctr_vtable`, if that
/// implementation was compiled in the library _and_ the POWER8 crypto
/// opcodes are available on the currently running CPU. If either of
/// these conditions is not met, then this function returns `NULL`.
///
/// \return  the `aes_pwr8` AES-CTR implementation, or `NULL`. 
 
 pub fn br_aes_pwr8_ctr_get_vtable ( ) -> * const br_block_ctr_class ; 
} 
 /// \brief Aggregate structure large enough to be used as context for
/// subkeys (CBC encryption) for all AES implementations. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_gen_cbcenc_keys { pub vtable : * const br_block_cbcenc_class , pub c_big : br_aes_big_cbcenc_keys , pub c_small : br_aes_small_cbcenc_keys , pub c_ct : br_aes_ct_cbcenc_keys , pub c_ct64 : br_aes_ct64_cbcenc_keys , pub c_x86ni : br_aes_x86ni_cbcenc_keys , pub c_pwr8 : br_aes_pwr8_cbcenc_keys , _bindgen_union_align : [ u64 ; 32usize ] , } # [ test ] fn bindgen_test_layout_br_aes_gen_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_gen_cbcenc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_gen_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_gen_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_gen_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcenc_keys > ( ) ) ) . c_big as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcenc_keys ) , "::" , stringify ! ( c_big ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcenc_keys > ( ) ) ) . c_small as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcenc_keys ) , "::" , stringify ! ( c_small ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcenc_keys > ( ) ) ) . c_ct as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcenc_keys ) , "::" , stringify ! ( c_ct ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcenc_keys > ( ) ) ) . c_ct64 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcenc_keys ) , "::" , stringify ! ( c_ct64 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcenc_keys > ( ) ) ) . c_x86ni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcenc_keys ) , "::" , stringify ! ( c_x86ni ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcenc_keys > ( ) ) ) . c_pwr8 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcenc_keys ) , "::" , stringify ! ( c_pwr8 ) ) ) ; } 
 /// \brief Aggregate structure large enough to be used as context for
/// subkeys (CBC decryption) for all AES implementations. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_gen_cbcdec_keys { pub vtable : * const br_block_cbcdec_class , pub c_big : br_aes_big_cbcdec_keys , pub c_small : br_aes_small_cbcdec_keys , pub c_ct : br_aes_ct_cbcdec_keys , pub c_ct64 : br_aes_ct64_cbcdec_keys , pub c_x86ni : br_aes_x86ni_cbcdec_keys , pub c_pwr8 : br_aes_pwr8_cbcdec_keys , _bindgen_union_align : [ u64 ; 32usize ] , } # [ test ] fn bindgen_test_layout_br_aes_gen_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_gen_cbcdec_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_gen_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_gen_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_gen_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcdec_keys > ( ) ) ) . c_big as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcdec_keys ) , "::" , stringify ! ( c_big ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcdec_keys > ( ) ) ) . c_small as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcdec_keys ) , "::" , stringify ! ( c_small ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcdec_keys > ( ) ) ) . c_ct as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcdec_keys ) , "::" , stringify ! ( c_ct ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcdec_keys > ( ) ) ) . c_ct64 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcdec_keys ) , "::" , stringify ! ( c_ct64 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcdec_keys > ( ) ) ) . c_x86ni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcdec_keys ) , "::" , stringify ! ( c_x86ni ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_cbcdec_keys > ( ) ) ) . c_pwr8 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_cbcdec_keys ) , "::" , stringify ! ( c_pwr8 ) ) ) ; } 
 /// \brief Aggregate structure large enough to be used as context for
/// subkeys (CTR encryption and decryption) for all AES implementations. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_gen_ctr_keys { pub vtable : * const br_block_ctr_class , pub c_big : br_aes_big_ctr_keys , pub c_small : br_aes_small_ctr_keys , pub c_ct : br_aes_ct_ctr_keys , pub c_ct64 : br_aes_ct64_ctr_keys , pub c_x86ni : br_aes_x86ni_ctr_keys , pub c_pwr8 : br_aes_pwr8_ctr_keys , _bindgen_union_align : [ u64 ; 32usize ] , } # [ test ] fn bindgen_test_layout_br_aes_gen_ctr_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_gen_ctr_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_gen_ctr_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_gen_ctr_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_gen_ctr_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctr_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctr_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctr_keys > ( ) ) ) . c_big as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctr_keys ) , "::" , stringify ! ( c_big ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctr_keys > ( ) ) ) . c_small as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctr_keys ) , "::" , stringify ! ( c_small ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctr_keys > ( ) ) ) . c_ct as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctr_keys ) , "::" , stringify ! ( c_ct ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctr_keys > ( ) ) ) . c_ct64 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctr_keys ) , "::" , stringify ! ( c_ct64 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctr_keys > ( ) ) ) . c_x86ni as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctr_keys ) , "::" , stringify ! ( c_x86ni ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctr_keys > ( ) ) ) . c_pwr8 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctr_keys ) , "::" , stringify ! ( c_pwr8 ) ) ) ; } 
 /// \brief Aggregate structure large enough to be used as context for
/// subkeys (CTR encryption/decryption + CBC-MAC) for all AES implementations. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_aes_gen_ctrcbc_keys { pub vtable : * const br_block_ctrcbc_class , pub c_big : br_aes_big_ctrcbc_keys , pub c_small : br_aes_small_ctrcbc_keys , pub c_ct : br_aes_ct_ctrcbc_keys , pub c_ct64 : br_aes_ct64_ctrcbc_keys , _bindgen_union_align : [ u64 ; 32usize ] , } # [ test ] fn bindgen_test_layout_br_aes_gen_ctrcbc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aes_gen_ctrcbc_keys > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( br_aes_gen_ctrcbc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aes_gen_ctrcbc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aes_gen_ctrcbc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctrcbc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctrcbc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctrcbc_keys > ( ) ) ) . c_big as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctrcbc_keys ) , "::" , stringify ! ( c_big ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctrcbc_keys > ( ) ) ) . c_small as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctrcbc_keys ) , "::" , stringify ! ( c_small ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctrcbc_keys > ( ) ) ) . c_ct as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctrcbc_keys ) , "::" , stringify ! ( c_ct ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aes_gen_ctrcbc_keys > ( ) ) ) . c_ct64 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aes_gen_ctrcbc_keys ) , "::" , stringify ! ( c_ct64 ) ) ) ; } 
 /// \brief Context for DES subkeys (`des_tab` implementation, CBC encryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_des_tab_cbcenc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcenc_class , pub skey : [ u32 ; 96usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_des_tab_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_des_tab_cbcenc_keys > ( ) , 400usize , concat ! ( "Size of: " , stringify ! ( br_des_tab_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_des_tab_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_des_tab_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_tab_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_tab_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_tab_cbcenc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_des_tab_cbcenc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_tab_cbcenc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 392usize , concat ! ( "Offset of field: " , stringify ! ( br_des_tab_cbcenc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for DES subkeys (`des_tab` implementation, CBC decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_des_tab_cbcdec_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcdec_class , pub skey : [ u32 ; 96usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_des_tab_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_des_tab_cbcdec_keys > ( ) , 400usize , concat ! ( "Size of: " , stringify ! ( br_des_tab_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_des_tab_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_des_tab_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_tab_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_tab_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_tab_cbcdec_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_des_tab_cbcdec_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_tab_cbcdec_keys > ( ) ) ) . num_rounds as * const _ as usize } , 392usize , concat ! ( "Offset of field: " , stringify ! ( br_des_tab_cbcdec_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_des_tab_cbcenc_vtable" ] 
 pub static mut  br_des_tab_cbcenc_vtable  :  br_block_cbcenc_class ;
} extern "C" {
 # [ link_name = "\u{1}br_des_tab_cbcdec_vtable" ] 
 pub static mut  br_des_tab_cbcdec_vtable  :  br_block_cbcdec_class ;
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for DES CBC encryption
/// (`des_tab` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_des_tab_cbcenc_init ( ctx : * mut br_des_tab_cbcenc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for DES CBC decryption
/// (`des_tab` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_des_tab_cbcdec_init ( ctx : * mut br_des_tab_cbcdec_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC encryption with DES (`des_tab` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to encrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 8). 
 
 pub fn br_des_tab_cbcenc_run ( ctx : * const br_des_tab_cbcenc_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC decryption with DES (`des_tab` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 8). 
 
 pub fn br_des_tab_cbcdec_run ( ctx : * const br_des_tab_cbcdec_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} 
 /// \brief Context for DES subkeys (`des_ct` implementation, CBC encryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_des_ct_cbcenc_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcenc_class , pub skey : [ u32 ; 96usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_des_ct_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_des_ct_cbcenc_keys > ( ) , 400usize , concat ! ( "Size of: " , stringify ! ( br_des_ct_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_des_ct_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_des_ct_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_ct_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_ct_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_ct_cbcenc_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_des_ct_cbcenc_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_ct_cbcenc_keys > ( ) ) ) . num_rounds as * const _ as usize } , 392usize , concat ! ( "Offset of field: " , stringify ! ( br_des_ct_cbcenc_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } 
 /// \brief Context for DES subkeys (`des_ct` implementation, CBC decryption).
///
/// First field is a pointer to the vtable; it is set by the initialisation
/// function. Other fields are not supposed to be accessed by user code. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct br_des_ct_cbcdec_keys { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_block_cbcdec_class , pub skey : [ u32 ; 96usize ] , pub num_rounds : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_br_des_ct_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_des_ct_cbcdec_keys > ( ) , 400usize , concat ! ( "Size of: " , stringify ! ( br_des_ct_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_des_ct_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_des_ct_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_ct_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_ct_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_ct_cbcdec_keys > ( ) ) ) . skey as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_des_ct_cbcdec_keys ) , "::" , stringify ! ( skey ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_ct_cbcdec_keys > ( ) ) ) . num_rounds as * const _ as usize } , 392usize , concat ! ( "Offset of field: " , stringify ! ( br_des_ct_cbcdec_keys ) , "::" , stringify ! ( num_rounds ) ) ) ; } extern "C" {
 # [ link_name = "\u{1}br_des_ct_cbcenc_vtable" ] 
 pub static mut  br_des_ct_cbcenc_vtable  :  br_block_cbcenc_class ;
} extern "C" {
 # [ link_name = "\u{1}br_des_ct_cbcdec_vtable" ] 
 pub static mut  br_des_ct_cbcdec_vtable  :  br_block_cbcdec_class ;
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for DES CBC encryption
/// (`des_ct` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_des_ct_cbcenc_init ( ctx : * mut br_des_ct_cbcenc_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Context initialisation (key schedule) for DES CBC decryption
/// (`des_ct` implementation).
///
/// \param ctx   context to initialise.
/// \param key   secret key.
/// \param len   secret key length (in bytes). 
 
 pub fn br_des_ct_cbcdec_init ( ctx : * mut br_des_ct_cbcdec_keys , key : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC encryption with DES (`des_ct` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to encrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 8). 
 
 pub fn br_des_ct_cbcenc_run ( ctx : * const br_des_ct_cbcenc_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief CBC decryption with DES (`des_ct` implementation).
///
/// \param ctx    context (already initialised).
/// \param iv     IV (updated).
/// \param data   data to decrypt (updated).
/// \param len    data length (in bytes, MUST be multiple of 8). 
 
 pub fn br_des_ct_cbcdec_run ( ctx : * const br_des_ct_cbcdec_keys , iv : * mut :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} 
 /// \brief Aggregate structure large enough to be used as context for
/// subkeys (CBC encryption) for all DES implementations. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_des_gen_cbcenc_keys { pub vtable : * const br_block_cbcenc_class , pub tab : br_des_tab_cbcenc_keys , pub ct : br_des_ct_cbcenc_keys , _bindgen_union_align : [ u64 ; 50usize ] , } # [ test ] fn bindgen_test_layout_br_des_gen_cbcenc_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_des_gen_cbcenc_keys > ( ) , 400usize , concat ! ( "Size of: " , stringify ! ( br_des_gen_cbcenc_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_des_gen_cbcenc_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_des_gen_cbcenc_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_gen_cbcenc_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_gen_cbcenc_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_gen_cbcenc_keys > ( ) ) ) . tab as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_gen_cbcenc_keys ) , "::" , stringify ! ( tab ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_gen_cbcenc_keys > ( ) ) ) . ct as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_gen_cbcenc_keys ) , "::" , stringify ! ( ct ) ) ) ; } 
 /// \brief Aggregate structure large enough to be used as context for
/// subkeys (CBC decryption) for all DES implementations. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union br_des_gen_cbcdec_keys { pub vtable : * const br_block_cbcdec_class , pub c_tab : br_des_tab_cbcdec_keys , pub c_ct : br_des_ct_cbcdec_keys , _bindgen_union_align : [ u64 ; 50usize ] , } # [ test ] fn bindgen_test_layout_br_des_gen_cbcdec_keys ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_des_gen_cbcdec_keys > ( ) , 400usize , concat ! ( "Size of: " , stringify ! ( br_des_gen_cbcdec_keys ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_des_gen_cbcdec_keys > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_des_gen_cbcdec_keys ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_gen_cbcdec_keys > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_gen_cbcdec_keys ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_gen_cbcdec_keys > ( ) ) ) . c_tab as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_gen_cbcdec_keys ) , "::" , stringify ! ( c_tab ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_des_gen_cbcdec_keys > ( ) ) ) . c_ct as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_des_gen_cbcdec_keys ) , "::" , stringify ! ( c_ct ) ) ) ; } 
 /// \brief Type for a ChaCha20 implementation.
///
/// An implementation follows the description in RFC 7539:
///
/// - Key is 256 bits (`key` points to exactly 32 bytes).
///
/// - IV is 96 bits (`iv` points to exactly 12 bytes).
///
/// - Block counter is over 32 bits and starts at value `cc`; the
/// resulting value is returned.
///
/// Data (pointed to by `data`, of length `len`) is encrypted/decrypted
/// in place. If `len` is not a multiple of 64, then the excess bytes from
/// the last block processing are dropped (therefore, "chunked" processing
/// works only as long as each non-final chunk has a length multiple of 64).
///
/// \param key    secret key (32 bytes).
/// \param iv     IV (12 bytes).
/// \param cc     initial counter value.
/// \param data   data to encrypt or decrypt.
/// \param len    data length (in bytes). 
 pub type br_chacha20_run = :: std :: option :: Option < unsafe extern "C" fn ( key : * const :: std :: os :: raw :: c_void , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize ) -> u32 > ; extern "C" {
 
 /// \brief ChaCha20 implementation (straightforward C code, constant-time).
///
/// \see br_chacha20_run
///
/// \param key    secret key (32 bytes).
/// \param iv     IV (12 bytes).
/// \param cc     initial counter value.
/// \param data   data to encrypt or decrypt.
/// \param len    data length (in bytes). 
 
 pub fn br_chacha20_ct_run ( key : * const :: std :: os :: raw :: c_void , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 
 /// \brief ChaCha20 implementation (SSE2 code, constant-time).
///
/// This implementation is available only on x86 platforms, depending on
/// compiler support. Moreover, in 32-bit mode, it might not actually run,
/// if the underlying hardware does not implement the SSE2 opcode (in
/// 64-bit mode, SSE2 is part of the ABI, so if the code could be compiled
/// at all, then it can run). Use `br_chacha20_sse2_get()` to safely obtain
/// a pointer to that function.
///
/// \see br_chacha20_run
///
/// \param key    secret key (32 bytes).
/// \param iv     IV (12 bytes).
/// \param cc     initial counter value.
/// \param data   data to encrypt or decrypt.
/// \param len    data length (in bytes). 
 
 pub fn br_chacha20_sse2_run ( key : * const :: std :: os :: raw :: c_void , iv : * const :: std :: os :: raw :: c_void , cc : u32 , data : * mut :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 
 /// \brief Obtain the `sse2` ChaCha20 implementation, if available.
///
/// This function returns a pointer to `br_chacha20_sse2_run`, if
/// that implementation was compiled in the library _and_ the SSE2
/// opcodes are available on the currently running CPU. If either of
/// these conditions is not met, then this function returns `0`.
///
/// \return  the `sse2` ChaCha20 implementation, or `0`. 
 
 pub fn br_chacha20_sse2_get ( ) -> br_chacha20_run ; 
} 
 /// \brief Type for a ChaCha20+Poly1305 AEAD implementation.
///
/// The provided data is encrypted or decrypted with ChaCha20. The
/// authentication tag is computed on the concatenation of the
/// additional data and the ciphertext, with the padding and lengths
/// as described in RFC 7539 (section 2.8).
///
/// After decryption, the caller is responsible for checking that the
/// computed tag matches the expected value.
///
/// \param key       secret key (32 bytes).
/// \param iv        nonce (12 bytes).
/// \param data      data to encrypt or decrypt.
/// \param len       data length (in bytes).
/// \param aad       additional authenticated data.
/// \param aad_len   length of additional authenticated data (in bytes).
/// \param tag       output buffer for the authentication tag.
/// \param ichacha   implementation of ChaCha20.
/// \param encrypt   non-zero for encryption, zero for decryption. 
 pub type br_poly1305_run = :: std :: option :: Option < unsafe extern "C" fn ( key : * const :: std :: os :: raw :: c_void , iv : * const :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , aad : * const :: std :: os :: raw :: c_void , aad_len : usize , tag : * mut :: std :: os :: raw :: c_void , ichacha : br_chacha20_run , encrypt : :: std :: os :: raw :: c_int ) > ; extern "C" {
 
 /// \brief ChaCha20+Poly1305 AEAD implementation (mixed 32-bit multiplications).
///
/// \see br_poly1305_run
///
/// \param key       secret key (32 bytes).
/// \param iv        nonce (12 bytes).
/// \param data      data to encrypt or decrypt.
/// \param len       data length (in bytes).
/// \param aad       additional authenticated data.
/// \param aad_len   length of additional authenticated data (in bytes).
/// \param tag       output buffer for the authentication tag.
/// \param ichacha   implementation of ChaCha20.
/// \param encrypt   non-zero for encryption, zero for decryption. 
 
 pub fn br_poly1305_ctmul_run ( key : * const :: std :: os :: raw :: c_void , iv : * const :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , aad : * const :: std :: os :: raw :: c_void , aad_len : usize , tag : * mut :: std :: os :: raw :: c_void , ichacha : br_chacha20_run , encrypt : :: std :: os :: raw :: c_int , ) ; 
} extern "C" {
 
 /// \brief ChaCha20+Poly1305 AEAD implementation (pure 32-bit multiplications).
///
/// \see br_poly1305_run
///
/// \param key       secret key (32 bytes).
/// \param iv        nonce (12 bytes).
/// \param data      data to encrypt or decrypt.
/// \param len       data length (in bytes).
/// \param aad       additional authenticated data.
/// \param aad_len   length of additional authenticated data (in bytes).
/// \param tag       output buffer for the authentication tag.
/// \param ichacha   implementation of ChaCha20.
/// \param encrypt   non-zero for encryption, zero for decryption. 
 
 pub fn br_poly1305_ctmul32_run ( key : * const :: std :: os :: raw :: c_void , iv : * const :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , aad : * const :: std :: os :: raw :: c_void , aad_len : usize , tag : * mut :: std :: os :: raw :: c_void , ichacha : br_chacha20_run , encrypt : :: std :: os :: raw :: c_int , ) ; 
} extern "C" {
 
 /// \brief ChaCha20+Poly1305 AEAD implementation (i15).
///
/// This implementation relies on the generic big integer code "i15"
/// (which uses pure 32-bit multiplications). As such, it may save a
/// little code footprint in a context where "i15" is already included
/// (e.g. for elliptic curves or for RSA); however, it is also
/// substantially slower than the ctmul and ctmul32 implementations.
///
/// \see br_poly1305_run
///
/// \param key       secret key (32 bytes).
/// \param iv        nonce (12 bytes).
/// \param data      data to encrypt or decrypt.
/// \param len       data length (in bytes).
/// \param aad       additional authenticated data.
/// \param aad_len   length of additional authenticated data (in bytes).
/// \param tag       output buffer for the authentication tag.
/// \param ichacha   implementation of ChaCha20.
/// \param encrypt   non-zero for encryption, zero for decryption. 
 
 pub fn br_poly1305_i15_run ( key : * const :: std :: os :: raw :: c_void , iv : * const :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , aad : * const :: std :: os :: raw :: c_void , aad_len : usize , tag : * mut :: std :: os :: raw :: c_void , ichacha : br_chacha20_run , encrypt : :: std :: os :: raw :: c_int , ) ; 
} extern "C" {
 
 /// \brief ChaCha20+Poly1305 AEAD implementation (ctmulq).
///
/// This implementation uses 64-bit multiplications (result over 128 bits).
/// It is available only on platforms that offer such a primitive (in
/// practice, 64-bit architectures). Use `br_poly1305_ctmulq_get()` to
/// dynamically obtain a pointer to that function, or 0 if not supported.
///
/// \see br_poly1305_run
///
/// \param key       secret key (32 bytes).
/// \param iv        nonce (12 bytes).
/// \param data      data to encrypt or decrypt.
/// \param len       data length (in bytes).
/// \param aad       additional authenticated data.
/// \param aad_len   length of additional authenticated data (in bytes).
/// \param tag       output buffer for the authentication tag.
/// \param ichacha   implementation of ChaCha20.
/// \param encrypt   non-zero for encryption, zero for decryption. 
 
 pub fn br_poly1305_ctmulq_run ( key : * const :: std :: os :: raw :: c_void , iv : * const :: std :: os :: raw :: c_void , data : * mut :: std :: os :: raw :: c_void , len : usize , aad : * const :: std :: os :: raw :: c_void , aad_len : usize , tag : * mut :: std :: os :: raw :: c_void , ichacha : br_chacha20_run , encrypt : :: std :: os :: raw :: c_int , ) ; 
} extern "C" {
 
 /// \brief Get the ChaCha20+Poly1305 "ctmulq" implementation, if available.
///
/// This function returns a pointer to the `br_poly1305_ctmulq_run()`
/// function if supported on the current platform; otherwise, it returns 0.
///
/// \return  the ctmulq ChaCha20+Poly1305 implementation, or 0. 
 
 pub fn br_poly1305_ctmulq_get ( ) -> br_poly1305_run ; 
} 
 /// \brief Class type of an AEAD algorithm. 
 pub type br_aead_class = br_aead_class_ ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_aead_class_ { 
 /// \brief Size (in bytes) of authentication tags created by
    /// this AEAD algorithm. 
 pub tag_size : usize , 
 /// \brief Reset an AEAD context.
    ///
    /// This function resets an already initialised AEAD context for
    /// a new computation run. Implementations and keys are
    /// conserved. This function can be called at any time; it
    /// cancels any ongoing AEAD computation that uses the provided
    /// context structure.
    ///
    /// The provided IV is a _nonce_. Each AEAD algorithm has its
    /// own requirements on IV size and contents; for most of them,
    /// it is crucial to security that each nonce value is used
    /// only once for a given secret key.
    ///
    /// \param cc    AEAD context structure.
    /// \param iv    AEAD nonce to use.
    /// \param len   AEAD nonce length (in bytes). 
 pub reset : :: std :: option :: Option < unsafe extern "C" fn ( cc : * mut * const br_aead_class , iv : * const :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Inject additional authenticated data.
    ///
    /// The provided data is injected into a running AEAD
    /// computation. Additional data must be injected _before_ the
    /// call to `flip()`. Additional data can be injected in several
    /// chunks of arbitrary length.
    ///
    /// \param cc     AEAD context structure.
    /// \param data   pointer to additional authenticated data.
    /// \param len    length of additional authenticated data (in bytes). 
 pub aad_inject : :: std :: option :: Option < unsafe extern "C" fn ( cc : * mut * const br_aead_class , data : * const :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Finish injection of additional authenticated data.
    ///
    /// This function MUST be called before beginning the actual
    /// encryption or decryption (with `run()`), even if no
    /// additional authenticated data was injected. No additional
    /// authenticated data may be injected after this function call.
    ///
    /// \param cc   AEAD context structure. 
 pub flip : :: std :: option :: Option < unsafe extern "C" fn ( cc : * mut * const br_aead_class ) > , 
 /// \brief Encrypt or decrypt some data.
    ///
    /// Data encryption or decryption can be done after `flip()` has
    /// been called on the context. If `encrypt` is non-zero, then
    /// the provided data shall be plaintext, and it is encrypted in
    /// place. Otherwise, the data shall be ciphertext, and it is
    /// decrypted in place.
    ///
    /// Data may be provided in several chunks of arbitrary length.
    ///
    /// \param cc        AEAD context structure.
    /// \param encrypt   non-zero for encryption, zero for decryption.
    /// \param data      data to encrypt or decrypt.
    /// \param len       data length (in bytes). 
 pub run : :: std :: option :: Option < unsafe extern "C" fn ( cc : * mut * const br_aead_class , encrypt : :: std :: os :: raw :: c_int , data : * mut :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Compute authentication tag.
    ///
    /// Compute the AEAD authentication tag. The tag length depends
    /// on the AEAD algorithm; it is written in the provided `tag`
    /// buffer. This call terminates the AEAD run: no data may be
    /// processed with that AEAD context afterwards, until `reset()`
    /// is called to initiate a new AEAD run.
    ///
    /// The tag value must normally be sent along with the encrypted
    /// data. When decrypting, the tag value must be recomputed and
    /// compared with the received tag: if the two tag values differ,
    /// then either the tag or the encrypted data was altered in
    /// transit. As an alternative to this function, the
    /// `check_tag()` function may be used to compute and check the
    /// tag value.
    ///
    /// Tag length depends on the AEAD algorithm.
    ///
    /// \param cc    AEAD context structure.
    /// \param tag   destination buffer for the tag. 
 pub get_tag : :: std :: option :: Option < unsafe extern "C" fn ( cc : * mut * const br_aead_class , tag : * mut :: std :: os :: raw :: c_void ) > , 
 /// \brief Compute and check authentication tag.
    ///
    /// This function is an alternative to `get_tag()`, and is
    /// normally used on the receiving end (i.e. when decrypting
    /// messages). The tag value is recomputed and compared with the
    /// provided tag value. If they match, 1 is returned; on
    /// mismatch, 0 is returned. A returned value of 0 means that the
    /// data or the tag was altered in transit, normally leading to
    /// wholesale rejection of the complete message.
    ///
    /// Tag length depends on the AEAD algorithm.
    ///
    /// \param cc    AEAD context structure.
    /// \param tag   tag value to compare with.
    /// \return  1 on success (exact match of tag value), 0 otherwise. 
 pub check_tag : :: std :: option :: Option < unsafe extern "C" fn ( cc : * mut * const br_aead_class , tag : * const :: std :: os :: raw :: c_void ) -> u32 > , 
 /// \brief Compute authentication tag (with truncation).
    ///
    /// This function is similar to `get_tag()`, except that the tag
    /// length is provided. Some AEAD algorithms allow several tag
    /// lengths, usually by truncating the normal tag. Shorter tags
    /// mechanically increase success probability of forgeries.
    /// The range of allowed tag lengths depends on the algorithm.
    ///
    /// \param cc    AEAD context structure.
    /// \param tag   destination buffer for the tag.
    /// \param len   tag length (in bytes). 
 pub get_tag_trunc : :: std :: option :: Option < unsafe extern "C" fn ( cc : * mut * const br_aead_class , tag : * mut :: std :: os :: raw :: c_void , len : usize ) > , 
 /// \brief Compute and check authentication tag (with truncation).
    ///
    /// This function is similar to `check_tag()` except that it
    /// works over an explicit tag length. See `get_tag()` for a
    /// discussion of explicit tag lengths; the range of allowed tag
    /// lengths depends on the algorithm.
    ///
    /// \param cc    AEAD context structure.
    /// \param tag   tag value to compare with.
    /// \param len   tag length (in bytes).
    /// \return  1 on success (exact match of tag value), 0 otherwise. 
 pub check_tag_trunc : :: std :: option :: Option < unsafe extern "C" fn ( cc : * mut * const br_aead_class , tag : * const :: std :: os :: raw :: c_void , len : usize ) -> u32 > , } # [ test ] fn bindgen_test_layout_br_aead_class_ ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_aead_class_ > ( ) , 72usize , concat ! ( "Size of: " , stringify ! ( br_aead_class_ ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_aead_class_ > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_aead_class_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . tag_size as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( tag_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . reset as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( reset ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . aad_inject as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( aad_inject ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . flip as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( flip ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . run as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( run ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . get_tag as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( get_tag ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . check_tag as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( check_tag ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . get_tag_trunc as * const _ as usize } , 56usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( get_tag_trunc ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_aead_class_ > ( ) ) ) . check_tag_trunc as * const _ as usize } , 64usize , concat ! ( "Offset of field: " , stringify ! ( br_aead_class_ ) , "::" , stringify ! ( check_tag_trunc ) ) ) ; } 
 /// \brief Context structure for GCM.
///
/// GCM is an AEAD mode that combines a block cipher in CTR mode with a
/// MAC based on GHASH, to provide authenticated encryption:
///
/// - Any block cipher with 16-byte blocks can be used with GCM.
///
/// - The nonce can have any length, from 0 up to 2^64-1 bits; however,
/// 96-bit nonces (12 bytes) are recommended (nonces with a length
/// distinct from 12 bytes are internally hashed, which risks reusing
/// nonce value with a small but not always negligible probability).
///
/// - Additional authenticated data may have length up to 2^64-1 bits.
///
/// - Message length may range up to 2^39-256 bits at most.
///
/// - The authentication tag has length 16 bytes.
///
/// The GCM initialisation function receives as parameter an
/// _initialised_ block cipher implementation context, with the secret
/// key already set. A pointer to that context will be kept within the
/// GCM context structure. It is up to the caller to allocate and
/// initialise that block cipher context. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_gcm_context { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_aead_class , pub bctx : * mut * const br_block_ctr_class , pub gh : br_ghash , pub h : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub j0_1 : [ :: std :: os :: raw :: c_uchar ; 12usize ] , pub buf : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub y : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub j0_2 : u32 , pub jc : u32 , pub count_aad : u64 , pub count_ctr : u64 , } # [ test ] fn bindgen_test_layout_br_gcm_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_gcm_context > ( ) , 112usize , concat ! ( "Size of: " , stringify ! ( br_gcm_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_gcm_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_gcm_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . bctx as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( bctx ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . gh as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( gh ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . h as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( h ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . j0_1 as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( j0_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . buf as * const _ as usize } , 52usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . y as * const _ as usize } , 68usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( y ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . j0_2 as * const _ as usize } , 84usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( j0_2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . jc as * const _ as usize } , 88usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( jc ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . count_aad as * const _ as usize } , 96usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( count_aad ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_gcm_context > ( ) ) ) . count_ctr as * const _ as usize } , 104usize , concat ! ( "Offset of field: " , stringify ! ( br_gcm_context ) , "::" , stringify ! ( count_ctr ) ) ) ; } extern "C" {
 
 /// \brief Initialize a GCM context.
///
/// A block cipher implementation, with its initialised context structure,
/// is provided. The block cipher MUST use 16-byte blocks in CTR mode,
/// and its secret key MUST have been already set in the provided context.
/// A GHASH implementation must also be provided. The parameters are linked
/// in the GCM context.
///
/// After this function has been called, the `br_gcm_reset()` function must
/// be called, to provide the IV for GCM computation.
///
/// \param ctx    GCM context structure.
/// \param bctx   block cipher context (already initialised with secret key).
/// \param gh     GHASH implementation. 
 
 pub fn br_gcm_init ( ctx : * mut br_gcm_context , bctx : * mut * const br_block_ctr_class , gh : br_ghash , ) ; 
} extern "C" {
 
 /// \brief Reset a GCM context.
///
/// This function resets an already initialised GCM context for a new
/// computation run. Implementations and keys are conserved. This function
/// can be called at any time; it cancels any ongoing GCM computation that
/// uses the provided context structure.
///
/// The provided IV is a _nonce_. It is critical to GCM security that IV
/// values are not repeated for the same encryption key. IV can have
/// arbitrary length (up to 2^64-1 bits), but the "normal" length is
/// 96 bits (12 bytes).
///
/// \param ctx   GCM context structure.
/// \param iv    GCM nonce to use.
/// \param len   GCM nonce length (in bytes). 
 
 pub fn br_gcm_reset ( ctx : * mut br_gcm_context , iv : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Inject additional authenticated data into GCM.
///
/// The provided data is injected into a running GCM computation. Additional
/// data must be injected _before_ the call to `br_gcm_flip()`.
/// Additional data can be injected in several chunks of arbitrary length;
/// the maximum total size of additional authenticated data is 2^64-1
/// bits.
///
/// \param ctx    GCM context structure.
/// \param data   pointer to additional authenticated data.
/// \param len    length of additional authenticated data (in bytes). 
 
 pub fn br_gcm_aad_inject ( ctx : * mut br_gcm_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Finish injection of additional authenticated data into GCM.
///
/// This function MUST be called before beginning the actual encryption
/// or decryption (with `br_gcm_run()`), even if no additional authenticated
/// data was injected. No additional authenticated data may be injected
/// after this function call.
///
/// \param ctx   GCM context structure. 
 
 pub fn br_gcm_flip ( ctx : * mut br_gcm_context , ) ; 
} extern "C" {
 
 /// \brief Encrypt or decrypt some data with GCM.
///
/// Data encryption or decryption can be done after `br_gcm_flip()`
/// has been called on the context. If `encrypt` is non-zero, then the
/// provided data shall be plaintext, and it is encrypted in place.
/// Otherwise, the data shall be ciphertext, and it is decrypted in place.
///
/// Data may be provided in several chunks of arbitrary length. The maximum
/// total length for data is 2^39-256 bits, i.e. about 65 gigabytes.
///
/// \param ctx       GCM context structure.
/// \param encrypt   non-zero for encryption, zero for decryption.
/// \param data      data to encrypt or decrypt.
/// \param len       data length (in bytes). 
 
 pub fn br_gcm_run ( ctx : * mut br_gcm_context , encrypt : :: std :: os :: raw :: c_int , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute GCM authentication tag.
///
/// Compute the GCM authentication tag. The tag is a 16-byte value which
/// is written in the provided `tag` buffer. This call terminates the
/// GCM run: no data may be processed with that GCM context afterwards,
/// until `br_gcm_reset()` is called to initiate a new GCM run.
///
/// The tag value must normally be sent along with the encrypted data.
/// When decrypting, the tag value must be recomputed and compared with
/// the received tag: if the two tag values differ, then either the tag
/// or the encrypted data was altered in transit. As an alternative to
/// this function, the `br_gcm_check_tag()` function can be used to
/// compute and check the tag value.
///
/// \param ctx   GCM context structure.
/// \param tag   destination buffer for the tag (16 bytes). 
 
 pub fn br_gcm_get_tag ( ctx : * mut br_gcm_context , tag : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 
 /// \brief Compute and check GCM authentication tag.
///
/// This function is an alternative to `br_gcm_get_tag()`, normally used
/// on the receiving end (i.e. when decrypting value). The tag value is
/// recomputed and compared with the provided tag value. If they match, 1
/// is returned; on mismatch, 0 is returned. A returned value of 0 means
/// that the data or the tag was altered in transit, normally leading to
/// wholesale rejection of the complete message.
///
/// \param ctx   GCM context structure.
/// \param tag   tag value to compare with (16 bytes).
/// \return  1 on success (exact match of tag value), 0 otherwise. 
 
 pub fn br_gcm_check_tag ( ctx : * mut br_gcm_context , tag : * const :: std :: os :: raw :: c_void , ) -> u32 ; 
} extern "C" {
 
 /// \brief Compute GCM authentication tag (with truncation).
///
/// This function is similar to `br_gcm_get_tag()`, except that it allows
/// the tag to be truncated to a smaller length. The intended tag length
/// is provided as `len` (in bytes); it MUST be no more than 16, but
/// it may be smaller. Note that decreasing tag length mechanically makes
/// forgeries easier; NIST SP 800-38D specifies that the tag length shall
/// lie between 12 and 16 bytes (inclusive), but may be truncated down to
/// 4 or 8 bytes, for specific applications that can tolerate it. It must
/// also be noted that successful forgeries leak information on the
/// authentication key, making subsequent forgeries easier. Therefore,
/// tag truncation, and in particular truncation to sizes lower than 12
/// bytes, shall be envisioned only with great care.
///
/// The tag is written in the provided `tag` buffer. This call terminates
/// the GCM run: no data may be processed with that GCM context
/// afterwards, until `br_gcm_reset()` is called to initiate a new GCM
/// run.
///
/// The tag value must normally be sent along with the encrypted data.
/// When decrypting, the tag value must be recomputed and compared with
/// the received tag: if the two tag values differ, then either the tag
/// or the encrypted data was altered in transit. As an alternative to
/// this function, the `br_gcm_check_tag_trunc()` function can be used to
/// compute and check the tag value.
///
/// \param ctx   GCM context structure.
/// \param tag   destination buffer for the tag.
/// \param len   tag length (16 bytes or less). 
 
 pub fn br_gcm_get_tag_trunc ( ctx : * mut br_gcm_context , tag : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute and check GCM authentication tag (with truncation).
///
/// This function is an alternative to `br_gcm_get_tag_trunc()`, normally used
/// on the receiving end (i.e. when decrypting value). The tag value is
/// recomputed and compared with the provided tag value. If they match, 1
/// is returned; on mismatch, 0 is returned. A returned value of 0 means
/// that the data or the tag was altered in transit, normally leading to
/// wholesale rejection of the complete message.
///
/// Tag length MUST be 16 bytes or less. The normal GCM tag length is 16
/// bytes. See `br_check_tag_trunc()` for some discussion on the potential
/// perils of truncating authentication tags.
///
/// \param ctx   GCM context structure.
/// \param tag   tag value to compare with.
/// \param len   tag length (in bytes).
/// \return  1 on success (exact match of tag value), 0 otherwise. 
 
 pub fn br_gcm_check_tag_trunc ( ctx : * mut br_gcm_context , tag : * const :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 # [ link_name = "\u{1}br_gcm_vtable" ] 
 pub static mut  br_gcm_vtable  :  br_aead_class ;
} 
 /// \brief Context structure for EAX.
///
/// EAX is an AEAD mode that combines a block cipher in CTR mode with
/// CBC-MAC using the same block cipher and the same key, to provide
/// authenticated encryption:
///
/// - Any block cipher with 16-byte blocks can be used with EAX
/// (technically, other block sizes are defined as well, but this
/// is not implemented by these functions; shorter blocks also
/// imply numerous security issues).
///
/// - The nonce can have any length, as long as nonce values are
/// not reused (thus, if nonces are randomly selected, the nonce
/// size should be such that reuse probability is negligible).
///
/// - Additional authenticated data length is unlimited.
///
/// - Message length is unlimited.
///
/// - The authentication tag has length 16 bytes.
///
/// The EAX initialisation function receives as parameter an
/// _initialised_ block cipher implementation context, with the secret
/// key already set. A pointer to that context will be kept within the
/// EAX context structure. It is up to the caller to allocate and
/// initialise that block cipher context. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_eax_context { 
 /// \brief Pointer to vtable for this context. 
 pub vtable : * const br_aead_class , pub bctx : * mut * const br_block_ctrcbc_class , pub L2 : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub L4 : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub nonce : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub head : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub ctr : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub cbcmac : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub buf : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub ptr : usize , } # [ test ] fn bindgen_test_layout_br_eax_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_eax_context > ( ) , 136usize , concat ! ( "Size of: " , stringify ! ( br_eax_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_eax_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_eax_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . vtable as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( vtable ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . bctx as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( bctx ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . L2 as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( L2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . L4 as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( L4 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . nonce as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( nonce ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . head as * const _ as usize } , 64usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( head ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . ctr as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( ctr ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . cbcmac as * const _ as usize } , 96usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( cbcmac ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . buf as * const _ as usize } , 112usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_context > ( ) ) ) . ptr as * const _ as usize } , 128usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_context ) , "::" , stringify ! ( ptr ) ) ) ; } 
 /// \brief EAX captured state.
///
/// Some internal values computed by EAX may be captured at various
/// points, and reused for another EAX run with the same secret key,
/// for lower per-message overhead. Captured values do not depend on
/// the nonce. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_eax_state { pub st : [ [ :: std :: os :: raw :: c_uchar ; 16usize ] ; 3usize ] , } # [ test ] fn bindgen_test_layout_br_eax_state ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_eax_state > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( br_eax_state ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_eax_state > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( br_eax_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_eax_state > ( ) ) ) . st as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_eax_state ) , "::" , stringify ! ( st ) ) ) ; } extern "C" {
 
 /// \brief Initialize an EAX context.
///
/// A block cipher implementation, with its initialised context
/// structure, is provided. The block cipher MUST use 16-byte blocks in
/// CTR + CBC-MAC mode, and its secret key MUST have been already set in
/// the provided context. The parameters are linked in the EAX context.
///
/// After this function has been called, the `br_eax_reset()` function must
/// be called, to provide the nonce for EAX computation.
///
/// \param ctx    EAX context structure.
/// \param bctx   block cipher context (already initialised with secret key). 
 
 pub fn br_eax_init ( ctx : * mut br_eax_context , bctx : * mut * const br_block_ctrcbc_class , ) ; 
} extern "C" {
 
 /// \brief Capture pre-AAD state.
///
/// This function precomputes key-dependent data, and stores it in the
/// provided `st` structure. This structure should then be used with
/// `br_eax_reset_pre_aad()`, or updated with `br_eax_get_aad_mac()`
/// and then used with `br_eax_reset_post_aad()`.
///
/// The EAX context structure is unmodified by this call.
///
/// \param ctx   EAX context structure.
/// \param st    recipient for captured state. 
 
 pub fn br_eax_capture ( ctx : * const br_eax_context , st : * mut br_eax_state , ) ; 
} extern "C" {
 
 /// \brief Reset an EAX context.
///
/// This function resets an already initialised EAX context for a new
/// computation run. Implementations and keys are conserved. This function
/// can be called at any time; it cancels any ongoing EAX computation that
/// uses the provided context structure.
///
/// It is critical to EAX security that nonce values are not repeated for
/// the same encryption key. Nonces can have arbitrary length. If nonces
/// are randomly generated, then a nonce length of at least 128 bits (16
/// bytes) is recommended, to make nonce reuse probability sufficiently
/// low.
///
/// \param ctx     EAX context structure.
/// \param nonce   EAX nonce to use.
/// \param len     EAX nonce length (in bytes). 
 
 pub fn br_eax_reset ( ctx : * mut br_eax_context , nonce : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Reset an EAX context with a pre-AAD captured state.
///
/// This function is an alternative to `br_eax_reset()`, that reuses a
/// previously captured state structure for lower per-message overhead.
/// The state should have been populated with `br_eax_capture_state()`
/// but not updated with `br_eax_get_aad_mac()`.
///
/// After this function is called, additional authenticated data MUST
/// be injected. At least one byte of additional authenticated data
/// MUST be provided with `br_eax_aad_inject()`; computation result will
/// be incorrect if `br_eax_flip()` is called right away.
///
/// After injection of the AAD and call to `br_eax_flip()`, at least
/// one message byte must be provided. Empty messages are not supported
/// with this reset mode.
///
/// \param ctx     EAX context structure.
/// \param st      pre-AAD captured state.
/// \param nonce   EAX nonce to use.
/// \param len     EAX nonce length (in bytes). 
 
 pub fn br_eax_reset_pre_aad ( ctx : * mut br_eax_context , st : * const br_eax_state , nonce : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Reset an EAX context with a post-AAD captured state.
///
/// This function is an alternative to `br_eax_reset()`, that reuses a
/// previously captured state structure for lower per-message overhead.
/// The state should have been populated with `br_eax_capture_state()`
/// and then updated with `br_eax_get_aad_mac()`.
///
/// After this function is called, message data MUST be injected. The
/// `br_eax_flip()` function MUST NOT be called. At least one byte of
/// message data MUST be provided with `br_eax_run()`; empty messages
/// are not supported with this reset mode.
///
/// \param ctx     EAX context structure.
/// \param st      post-AAD captured state.
/// \param nonce   EAX nonce to use.
/// \param len     EAX nonce length (in bytes). 
 
 pub fn br_eax_reset_post_aad ( ctx : * mut br_eax_context , st : * const br_eax_state , nonce : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Inject additional authenticated data into EAX.
///
/// The provided data is injected into a running EAX computation. Additional
/// data must be injected _before_ the call to `br_eax_flip()`.
/// Additional data can be injected in several chunks of arbitrary length;
/// the total amount of additional authenticated data is unlimited.
///
/// \param ctx    EAX context structure.
/// \param data   pointer to additional authenticated data.
/// \param len    length of additional authenticated data (in bytes). 
 
 pub fn br_eax_aad_inject ( ctx : * mut br_eax_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Finish injection of additional authenticated data into EAX.
///
/// This function MUST be called before beginning the actual encryption
/// or decryption (with `br_eax_run()`), even if no additional authenticated
/// data was injected. No additional authenticated data may be injected
/// after this function call.
///
/// \param ctx   EAX context structure. 
 
 pub fn br_eax_flip ( ctx : * mut br_eax_context , ) ; 
} extern "C" {
 
 /// \brief Encrypt or decrypt some data with EAX.
///
/// Data encryption or decryption can be done after `br_eax_flip()`
/// has been called on the context. If `encrypt` is non-zero, then the
/// provided data shall be plaintext, and it is encrypted in place.
/// Otherwise, the data shall be ciphertext, and it is decrypted in place.
///
/// Data may be provided in several chunks of arbitrary length.
///
/// \param ctx       EAX context structure.
/// \param encrypt   non-zero for encryption, zero for decryption.
/// \param data      data to encrypt or decrypt.
/// \param len       data length (in bytes). 
 
 pub fn br_eax_run ( ctx : * mut br_eax_context , encrypt : :: std :: os :: raw :: c_int , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute EAX authentication tag.
///
/// Compute the EAX authentication tag. The tag is a 16-byte value which
/// is written in the provided `tag` buffer. This call terminates the
/// EAX run: no data may be processed with that EAX context afterwards,
/// until `br_eax_reset()` is called to initiate a new EAX run.
///
/// The tag value must normally be sent along with the encrypted data.
/// When decrypting, the tag value must be recomputed and compared with
/// the received tag: if the two tag values differ, then either the tag
/// or the encrypted data was altered in transit. As an alternative to
/// this function, the `br_eax_check_tag()` function can be used to
/// compute and check the tag value.
///
/// \param ctx   EAX context structure.
/// \param tag   destination buffer for the tag (16 bytes). 
 
 pub fn br_eax_get_tag ( ctx : * mut br_eax_context , tag : * mut :: std :: os :: raw :: c_void , ) ; 
} extern "C" {
 
 /// \brief Compute and check EAX authentication tag.
///
/// This function is an alternative to `br_eax_get_tag()`, normally used
/// on the receiving end (i.e. when decrypting value). The tag value is
/// recomputed and compared with the provided tag value. If they match, 1
/// is returned; on mismatch, 0 is returned. A returned value of 0 means
/// that the data or the tag was altered in transit, normally leading to
/// wholesale rejection of the complete message.
///
/// \param ctx   EAX context structure.
/// \param tag   tag value to compare with (16 bytes).
/// \return  1 on success (exact match of tag value), 0 otherwise. 
 
 pub fn br_eax_check_tag ( ctx : * mut br_eax_context , tag : * const :: std :: os :: raw :: c_void , ) -> u32 ; 
} extern "C" {
 
 /// \brief Compute EAX authentication tag (with truncation).
///
/// This function is similar to `br_eax_get_tag()`, except that it allows
/// the tag to be truncated to a smaller length. The intended tag length
/// is provided as `len` (in bytes); it MUST be no more than 16, but
/// it may be smaller. Note that decreasing tag length mechanically makes
/// forgeries easier; NIST SP 800-38D specifies that the tag length shall
/// lie between 12 and 16 bytes (inclusive), but may be truncated down to
/// 4 or 8 bytes, for specific applications that can tolerate it. It must
/// also be noted that successful forgeries leak information on the
/// authentication key, making subsequent forgeries easier. Therefore,
/// tag truncation, and in particular truncation to sizes lower than 12
/// bytes, shall be envisioned only with great care.
///
/// The tag is written in the provided `tag` buffer. This call terminates
/// the EAX run: no data may be processed with that EAX context
/// afterwards, until `br_eax_reset()` is called to initiate a new EAX
/// run.
///
/// The tag value must normally be sent along with the encrypted data.
/// When decrypting, the tag value must be recomputed and compared with
/// the received tag: if the two tag values differ, then either the tag
/// or the encrypted data was altered in transit. As an alternative to
/// this function, the `br_eax_check_tag_trunc()` function can be used to
/// compute and check the tag value.
///
/// \param ctx   EAX context structure.
/// \param tag   destination buffer for the tag.
/// \param len   tag length (16 bytes or less). 
 
 pub fn br_eax_get_tag_trunc ( ctx : * mut br_eax_context , tag : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute and check EAX authentication tag (with truncation).
///
/// This function is an alternative to `br_eax_get_tag_trunc()`, normally used
/// on the receiving end (i.e. when decrypting value). The tag value is
/// recomputed and compared with the provided tag value. If they match, 1
/// is returned; on mismatch, 0 is returned. A returned value of 0 means
/// that the data or the tag was altered in transit, normally leading to
/// wholesale rejection of the complete message.
///
/// Tag length MUST be 16 bytes or less. The normal EAX tag length is 16
/// bytes. See `br_check_tag_trunc()` for some discussion on the potential
/// perils of truncating authentication tags.
///
/// \param ctx   EAX context structure.
/// \param tag   tag value to compare with.
/// \param len   tag length (in bytes).
/// \return  1 on success (exact match of tag value), 0 otherwise. 
 
 pub fn br_eax_check_tag_trunc ( ctx : * mut br_eax_context , tag : * const :: std :: os :: raw :: c_void , len : usize , ) -> u32 ; 
} extern "C" {
 # [ link_name = "\u{1}br_eax_vtable" ] 
 pub static mut  br_eax_vtable  :  br_aead_class ;
} 
 /// \brief Context structure for CCM.
///
/// CCM is an AEAD mode that combines a block cipher in CTR mode with
/// CBC-MAC using the same block cipher and the same key, to provide
/// authenticated encryption:
///
/// - Any block cipher with 16-byte blocks can be used with CCM
/// (technically, other block sizes are defined as well, but this
/// is not implemented by these functions; shorter blocks also
/// imply numerous security issues).
///
/// - The authentication tag length, and plaintext length, MUST be
/// known when starting processing data. Plaintext and ciphertext
/// can still be provided by chunks, but the total size must match
/// the value provided upon initialisation.
///
/// - The nonce length is constrained betwen 7 and 13 bytes (inclusive).
/// Furthermore, the plaintext length, when encoded, must fit over
/// 15-nonceLen bytes; thus, if the nonce has length 13 bytes, then
/// the plaintext length cannot exceed 65535 bytes.
///
/// - Additional authenticated data length is practically unlimited
/// (formal limit is at 2^64 bytes).
///
/// - The authentication tag has length 4 to 16 bytes (even values only).
///
/// The CCM initialisation function receives as parameter an
/// _initialised_ block cipher implementation context, with the secret
/// key already set. A pointer to that context will be kept within the
/// CCM context structure. It is up to the caller to allocate and
/// initialise that block cipher context. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_ccm_context { pub bctx : * mut * const br_block_ctrcbc_class , pub ctr : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub cbcmac : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub tagmask : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub buf : [ :: std :: os :: raw :: c_uchar ; 16usize ] , pub ptr : usize , pub tag_len : usize , } # [ test ] fn bindgen_test_layout_br_ccm_context ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_ccm_context > ( ) , 88usize , concat ! ( "Size of: " , stringify ! ( br_ccm_context ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_ccm_context > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_ccm_context ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_ccm_context > ( ) ) ) . bctx as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_ccm_context ) , "::" , stringify ! ( bctx ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_ccm_context > ( ) ) ) . ctr as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_ccm_context ) , "::" , stringify ! ( ctr ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_ccm_context > ( ) ) ) . cbcmac as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_ccm_context ) , "::" , stringify ! ( cbcmac ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_ccm_context > ( ) ) ) . tagmask as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( br_ccm_context ) , "::" , stringify ! ( tagmask ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_ccm_context > ( ) ) ) . buf as * const _ as usize } , 56usize , concat ! ( "Offset of field: " , stringify ! ( br_ccm_context ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_ccm_context > ( ) ) ) . ptr as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( br_ccm_context ) , "::" , stringify ! ( ptr ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_ccm_context > ( ) ) ) . tag_len as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( br_ccm_context ) , "::" , stringify ! ( tag_len ) ) ) ; } extern "C" {
 
 /// \brief Initialize a CCM context.
///
/// A block cipher implementation, with its initialised context
/// structure, is provided. The block cipher MUST use 16-byte blocks in
/// CTR + CBC-MAC mode, and its secret key MUST have been already set in
/// the provided context. The parameters are linked in the CCM context.
///
/// After this function has been called, the `br_ccm_reset()` function must
/// be called, to provide the nonce for CCM computation.
///
/// \param ctx    CCM context structure.
/// \param bctx   block cipher context (already initialised with secret key). 
 
 pub fn br_ccm_init ( ctx : * mut br_ccm_context , bctx : * mut * const br_block_ctrcbc_class , ) ; 
} extern "C" {
 
 /// \brief Reset a CCM context.
///
/// This function resets an already initialised CCM context for a new
/// computation run. Implementations and keys are conserved. This function
/// can be called at any time; it cancels any ongoing CCM computation that
/// uses the provided context structure.
///
/// The `aad_len` parameter contains the total length, in bytes, of the
/// additional authenticated data. It may be zero. That length MUST be
/// exact.
///
/// The `data_len` parameter contains the total length, in bytes, of the
/// data that will be injected (plaintext or ciphertext). That length MUST
/// be exact. Moreover, that length MUST be less than 2^(8*(15-nonce_len)).
///
/// The nonce length (`nonce_len`), in bytes, must be in the 7..13 range
/// (inclusive).
///
/// The tag length (`tag_len`), in bytes, must be in the 4..16 range, and
/// be an even integer. Short tags mechanically allow for higher forgery
/// probabilities; hence, tag sizes smaller than 12 bytes shall be used only
/// with care.
///
/// It is critical to CCM security that nonce values are not repeated for
/// the same encryption key. Random generation of nonces is not generally
/// recommended, due to the relatively small maximum nonce value.
///
/// Returned value is 1 on success, 0 on error. An error is reported if
/// the tag or nonce length is out of range, or if the
/// plaintext/ciphertext length cannot be encoded with the specified
/// nonce length.
///
/// \param ctx         CCM context structure.
/// \param nonce       CCM nonce to use.
/// \param nonce_len   CCM nonce length (in bytes, 7 to 13).
/// \param aad_len     additional authenticated data length (in bytes).
/// \param data_len    plaintext/ciphertext length (in bytes).
/// \param tag_len     tag length (in bytes).
/// \return  1 on success, 0 on error. 
 
 pub fn br_ccm_reset ( ctx : * mut br_ccm_context , nonce : * const :: std :: os :: raw :: c_void , nonce_len : usize , aad_len : u64 , data_len : u64 , tag_len : usize , ) -> :: std :: os :: raw :: c_int ; 
} extern "C" {
 
 /// \brief Inject additional authenticated data into CCM.
///
/// The provided data is injected into a running CCM computation. Additional
/// data must be injected _before_ the call to `br_ccm_flip()`.
/// Additional data can be injected in several chunks of arbitrary length,
/// but the total amount MUST exactly match the value which was provided
/// to `br_ccm_reset()`.
///
/// \param ctx    CCM context structure.
/// \param data   pointer to additional authenticated data.
/// \param len    length of additional authenticated data (in bytes). 
 
 pub fn br_ccm_aad_inject ( ctx : * mut br_ccm_context , data : * const :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Finish injection of additional authenticated data into CCM.
///
/// This function MUST be called before beginning the actual encryption
/// or decryption (with `br_ccm_run()`), even if no additional authenticated
/// data was injected. No additional authenticated data may be injected
/// after this function call.
///
/// \param ctx   CCM context structure. 
 
 pub fn br_ccm_flip ( ctx : * mut br_ccm_context , ) ; 
} extern "C" {
 
 /// \brief Encrypt or decrypt some data with CCM.
///
/// Data encryption or decryption can be done after `br_ccm_flip()`
/// has been called on the context. If `encrypt` is non-zero, then the
/// provided data shall be plaintext, and it is encrypted in place.
/// Otherwise, the data shall be ciphertext, and it is decrypted in place.
///
/// Data may be provided in several chunks of arbitrary length, provided
/// that the total length exactly matches the length provided to the
/// `br_ccm_reset()` call.
///
/// \param ctx       CCM context structure.
/// \param encrypt   non-zero for encryption, zero for decryption.
/// \param data      data to encrypt or decrypt.
/// \param len       data length (in bytes). 
 
 pub fn br_ccm_run ( ctx : * mut br_ccm_context , encrypt : :: std :: os :: raw :: c_int , data : * mut :: std :: os :: raw :: c_void , len : usize , ) ; 
} extern "C" {
 
 /// \brief Compute CCM authentication tag.
///
/// Compute the CCM authentication tag. This call terminates the CCM
/// run: all data must have been injected with `br_ccm_run()` (in zero,
/// one or more successive calls). After this function has been called,
/// no more data can br processed; a `br_ccm_reset()` call is required
/// to start a new message.
///
/// The tag length was provided upon context initialisation (last call
/// to `br_ccm_reset()`); it is returned by this function.
///
/// The tag value must normally be sent along with the encrypted data.
/// When decrypting, the tag value must be recomputed and compared with
/// the received tag: if the two tag values differ, then either the tag
/// or the encrypted data was altered in transit. As an alternative to
/// this function, the `br_ccm_check_tag()` function can be used to
/// compute and check the tag value.
///
/// \param ctx   CCM context structure.
/// \param tag   destination buffer for the tag (up to 16 bytes).
/// \return  the tag length (in bytes). 
 
 pub fn br_ccm_get_tag ( ctx : * mut br_ccm_context , tag : * mut :: std :: os :: raw :: c_void , ) -> usize ; 
} extern "C" {
 
 /// \brief Compute and check CCM authentication tag.
///
/// This function is an alternative to `br_ccm_get_tag()`, normally used
/// on the receiving end (i.e. when decrypting value). The tag value is
/// recomputed and compared with the provided tag value. If they match, 1
/// is returned; on mismatch, 0 is returned. A returned value of 0 means
/// that the data or the tag was altered in transit, normally leading to
/// wholesale rejection of the complete message.
///
/// \param ctx   CCM context structure.
/// \param tag   tag value to compare with (up to 16 bytes).
/// \return  1 on success (exact match of tag value), 0 otherwise. 
 
 pub fn br_ccm_check_tag ( ctx : * mut br_ccm_context , tag : * const :: std :: os :: raw :: c_void , ) -> u32 ; 
} 
 /// \brief RSA public key.
///
/// The structure references the modulus and the public exponent. Both
/// integers use unsigned big-endian representation; extra leading bytes
/// of value 0 are allowed. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_rsa_public_key { 
 /// \brief Modulus. 
 pub n : * mut :: std :: os :: raw :: c_uchar , 
 /// \brief Modulus length (in bytes). 
 pub nlen : usize , 
 /// \brief Public exponent. 
 pub e : * mut :: std :: os :: raw :: c_uchar , 
 /// \brief Public exponent length (in bytes). 
 pub elen : usize , } # [ test ] fn bindgen_test_layout_br_rsa_public_key ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_rsa_public_key > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( br_rsa_public_key ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_rsa_public_key > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_rsa_public_key ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_public_key > ( ) ) ) . n as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_public_key ) , "::" , stringify ! ( n ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_public_key > ( ) ) ) . nlen as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_public_key ) , "::" , stringify ! ( nlen ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_public_key > ( ) ) ) . e as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_public_key ) , "::" , stringify ! ( e ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_public_key > ( ) ) ) . elen as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_public_key ) , "::" , stringify ! ( elen ) ) ) ; } 
 /// \brief RSA private key.
///
/// The structure references the primvate factors, reduced private
/// exponents, and CRT coefficient. It also contains the bit length of
/// the modulus. The big integers use unsigned big-endian representation;
/// extra leading bytes of value 0 are allowed. However, the modulus bit
/// length (`n_bitlen`) MUST be exact. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct br_rsa_private_key { 
 /// \brief Modulus bit length (in bits, exact value). 
 pub n_bitlen : u32 , 
 /// \brief First prime factor. 
 pub p : * mut :: std :: os :: raw :: c_uchar , 
 /// \brief First prime factor length (in bytes). 
 pub plen : usize , 
 /// \brief Second prime factor. 
 pub q : * mut :: std :: os :: raw :: c_uchar , 
 /// \brief Second prime factor length (in bytes). 
 pub qlen : usize , 
 /// \brief First reduced private exponent. 
 pub dp : * mut :: std :: os :: raw :: c_uchar , 
 /// \brief First reduced private exponent length (in bytes). 
 pub dplen : usize , 
 /// \brief Second reduced private exponent. 
 pub dq : * mut :: std :: os :: raw :: c_uchar , 
 /// \brief Second reduced private exponent length (in bytes). 
 pub dqlen : usize , 
 /// \brief CRT coefficient. 
 pub iq : * mut :: std :: os :: raw :: c_uchar , 
 /// \brief CRT coefficient length (in bytes). 
 pub iqlen : usize , } # [ test ] fn bindgen_test_layout_br_rsa_private_key ( ) { assert_eq ! ( :: std :: mem :: size_of :: < br_rsa_private_key > ( ) , 88usize , concat ! ( "Size of: " , stringify ! ( br_rsa_private_key ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < br_rsa_private_key > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( br_rsa_private_key ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . n_bitlen as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( n_bitlen ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . p as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( p ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . plen as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( plen ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . q as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( q ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . qlen as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( qlen ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . dp as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( dp ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . dplen as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( dplen ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . dq as * const _ as usize } , 56usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( dq ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . dqlen as * const _ as usize } , 64usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( dqlen ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . iq as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( iq ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: std :: ptr :: null :: < br_rsa_private_key > ( ) ) ) . iqlen as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( br_rsa_private_key ) , "::" , stringify ! ( iqlen ) ) ) ; } 
 /// \brief Type for a RSA public key engine.
///
/// The public key engine performs the modular exponentiation of the
/// provided value with the public exponent. The value is modified in
/// place.
///
/// The value length (`xlen`) is verified to have _exactly_ the same
/// length as the modulus (actual modulus length, without extra leading
/// zeros in the modulus representation in memory). If the length does
/// not match, then this function returns 0 and `x[]` is unmodified.
///
/// It `xlen` is correct, then `x[]` is modified. Returned value is 1
/// on success, 0 on error. Error conditions include an oversized `x[]`
/// (the array has the same length as the modulus, but the numerical value
/// is not lower than the modulus) and an invalid modulus (e.g. an even
/// integer). If an error is reported, then the new contents of `x[]` are
/// unspecified.
///
/// \param x      operand to exponentiate.
/// \param xlen   length of the operand (in bytes).
/// \param pk     RSA public key.
/// \return  1 on success, 0 on error. 
 pub type br_rsa_public = :: std :: option :: Option < unsafe extern "C" fn ( x : * mut :: std :: os :: raw :: c_uchar , xlen : usize , pk : * const br_rsa_public_key ) -> u32 > ; 
 /// \brief Type for a RSA signature verification engine (PKCS#1 v1.5).
///
/// Parameters are:
///
/// - The signature itself. The provided array is NOT modified.
///
/// - The encoded OID for the hash function. The provided array must begin
/// with a single byte that contains the length of the OID value (in
/// bytes), followed by exactly that many bytes. This parameter may
/// also be `NULL`, in which case the raw hash value should be used
/// with the PKCS#1 v1.5 "type 1" padding (as used in SSL/TLS up
/// to TLS-1.1, with a 36-byte hash value).
///
/// - The hash output length, in bytes.
///
/// - The public key.
///
/// - An output buffer for the hash value. The caller must still compare
/// it with the hash of the data over which the signature is computed.
///
/// **Constraints:**
///
/// - Hash length MUST be no more than 64 bytes.
///
/// - OID value length MUST be no more than 32 bytes (i.e. `hash_oid[0]`
/// must have a value in the 0..32 range, inclusive).
///
/// This function verifies that the signature length (`xlen`) matches the
/// modulus length (this function returns 0 on mismatch). If the modulus
/// size exceeds the maximum supported RSA size, then the function also
/// returns 0.
///
/// Returned value is 1 on success, 0 on error.
///
/// Implementations of this type need not be constant-time.
///
/// \param x          signature buffer.
/// \param xlen       signature length (in bytes).
/// \param hash_oid   encoded hash algorithm OID (or `NULL`).
/// \param hash_len   expected hash value length (in bytes).
/// \param pk         RSA public key.
/// \param hash_out   output buffer for the hash value.
/// \return  1 on success, 0 on error. 
 pub type br_rsa_pkcs1_vrfy = :: std :: option :: Option < unsafe extern "C" fn ( x : * const :: std :: os :: raw :: c_uchar , xlen : usize , hash_oid : * const :: std :: os :: raw :: c_uchar , hash_len : usize , pk : * const br_rsa_public_key , hash_out : * mut :: std :: os :: raw :: c_uchar ) -> u32 > ; 
 /// \brief Type for a RSA private key engine.
///
/// The `x[]` buffer is modified in place, and its length is inferred from
/// the modulus length (`x[]` is assumed to have a length of
/// `(sk->n_bitlen+7)/8` bytes).
///
/// Returned value is 1 on success, 0 on error.
///
/// \param x    operand to exponentiate.
/// \param sk   RSA private key.
/// \return  1 on success, 0 on error. 
 pub type br_rsa_private = :: std :: option :: Option < unsafe extern "C" fn ( x : * mut :: std :: os :: raw :: c_uchar , sk : * const br_rsa_private_key ) -> u32 > ; 
 /// \brief Type for a RSA signature generation engine (PKCS#1 v1.5).
///
/// Parameters are:
///
/// - The encoded OID for the hash function. The provided array must begin
/// with a single byte that contains the length of the OID value (in
/// bytes), followed by exactly that many bytes. This parameter may
/// also be `NULL`, in which case the raw hash value should be used
/// with the PKCS#1 v1.5 "type 1" padding (as used in SSL/TLS up
/// to TLS-1.1, with a 36-byte hash value).
///
/// - The hash value computes over the data to sign (its length is
/// expressed in bytes).
///
/// - The RSA private key.
///
/// - The output buffer, that receives the signature.
///
/// Returned value is 1 on success, 0 on error. Error conditions include
/// a too small modulus for the provided hash OID and value, or some
/// invalid key parameters. The signature length is exactly
/// `(sk->n_bitlen+7)/8` bytes.
///
/// This function is expected to be constant-time with regards to the
/// private key bytes (lengths of the modulus and the individual factors
/// may leak, though) and to the hashed data.
///
/// \param hash_oid   encoded hash algorithm OID (or `NULL`).
/// \param hash       hash value.
/// \param hash_len   hash value length (in bytes).
